
#pragma mark - ****************************************************************** 1Z201000 项目的组织与管理(概论) 31
/*
 */
 #pragma mark  ******************************** 1Z201010 建设工程管理的内涵和任务      1

/*
 */
 #pragma mark ******************************** 1Z201020 建设工程项目管理的目标和任务

/*

 
 1.工程管理与项目管理的区别
 
     (1)时间范畴不同 P3
 
         工程管理:全寿命期 (P1 决策、实施、使用阶段);
 
         项目管理:实施阶段(P3 设计准备、设计、施工、 动用前准备和保修。)
 
         注意与P121的区别(有物资采购， 无保修)。
                 项目的实施阶段：设计准备、设计、施工、动用前准备、保修
                 业主进度的实施阶段：设计准备、设计、施工、物资采购、动用前准备
 
         建设工程项目全寿命周期示意图
             1.项目决策阶段
                     决策阶段
                             1.编制项目建议书
                             2.编制可行性研究报告
             2.项目实施阶段（项目管理）
                     1.设计准备阶段
                             1.编制设计任务书
                     2.设计阶段
                             1.初步设计
                             2.技术设计
                             3.施工图设计
                     3.施工阶段
                             施工
                     4.动用前准备阶段
                             竣工验收
                     5.保修阶段
                             动用开始阶段 到 保修期结束
             3.项目使用阶段
                     保修阶段（和实施阶段是重复的）
                     报废
 
 
     (2)核心任务不同
 
         工程管理核心任务:为工程的建设和使用增值。 P3
         项目管理核心任务:项目的目标控制。 P4
 
         工程管理是一种增值服务：
                工程建设增值
                         确保工程建设安全
                         提高工程质量
                         有利于投资（成本）控制
                         有利于进度控制
                工程使用（运行）增值
                         确保工程使用安全
                         有利于环保
                         有利于节能
                         满足最终用户的使用功能
                         有利于降低工程运营成本
                         有利于工程维护
 
     (3)内涵不同
 
         工程管理:不仅涉及全过程的管理，还涉及项目参与各方的管理。P1-2
 
         工程管理
                 涉及建设工程项目的全过程的管理
                         项目前期策划与管理 DM（决策管理）
                         项目实施期项目管理 PM（项目管理）
                         项目使用期设施管理 FM（使用管理）
                 涉及参与建设工程项目的各个单位对工程的管理
                         业主方（投资方、开发方）
                         设计方
                         施工方
                         供货方
                         物业方（项目使用期的管理方）
 
         项目管理:自项目开始至项目完成，通过项目策划 和项目控制，以使项目的费用、进度和质量目标得以实现。P3
                 (1)“自项目开始至项目完成”指的是项目的实施阶段;(易误解为全寿命期)
                 (2)“项目策划”指的是目标控制前的一系列筹划和准备工作;(易误解为决策阶段的主要任务)
                 (3)“费用目标”对业主而言是投资目标，对施工方而言是成本目标。
 
 2.立项是决策的标志。 P1
 3.决策阶段的主要任务:确定项目的定义。 P1
     定义什么?
     组织、地点、任务、原则、资金、三大目标。
 4.实施阶段的主要任务:通过管理使目标实现。 P3
 
 5.1Z201021—1Z201023 项目管理“五方”
 */
#pragma mark 1Z201021—1Z201023 项目管理“五方”

/*
 
 类型               利益                    目标                       阶段                         任务
 业主方 (核心)       本身              投资、进度、 质量               实施阶段全过程             三控三管一协调 (投资)
 设计方          整体、 本身        成本、进度、 质量、投资        主要在设计阶段，也涉及其他阶段     三控三管一协调 (成本+投资)
 供货方          整体、 本身           成本、进度、 质量          主要在施工阶段，也涉及其他阶段     三控三管一协调 (成本)
项目总包方 DB\EPC 整体、 本身    安全管理、投资、成本、进度、质量         实施阶段全过程             三控三管一协调 (投资+成本)
 施工方          整体、 本身        安全管理、成本、进度、质量      主要在施工阶段，无设计准备阶段    三控三管一协调 (成本)
 
 
 6.业主的进度目标:项目动用、交付使用，如?
        质量目标:涉及施工、设计、材料、设备、环境质量，满足技术规范技术标准、业主要求。
 
 7.各项任务中，安全管理最重要。
 
 
 8.工程总承包项目管理的主要内容 P15
 
     (1)任命项目经理，组建项目部，编制项目计划; —人
 
     (2)实施【设计】，【采购】，施工，试运行管理;—过程
 
     (3)进行范围管理。—职能管理
         范围管理:范围计划编制、定义、验证、变更控制。
 
 9.按照国际惯例，自行分包、指定分包，不论与总包、总管或业主签合同，签合同前，必须得到总包、总管认可， 因此，均由总包或总管进行管理，且总包、总管对其工期、 质量目标负责。
 
 10.施工方的项目管理，不能认为只是施工企业对项目的管理。施工企业委托的项目管理咨询公司对项目的管理， 也属于施工方项目管理的范畴。
 
 
 */
#pragma mark ********************************  1Z201030 建设工程项目的组织

/*
 
 本节考法:
 1.基本概念;
 2.四图四关系四方框;
 3.三种典型组织结构;
 4.两个分工表;
 5.三种工作流程组织;
 6.两层合同关系
 
 
 一、基本概念
 
     影响目标实现的因素:组织、人、方法、工具。
     目标决定组织，组织是决定性因素。
     控制项目目标的主要措施:组织、管理、经济和技术措施，其中，组织措施最重要。
 
 二、组织论和组织工具
 
      组织论
             组织结构模式（相对静态关系）
                     职能组织结构
                     线性组织结构
                     矩阵组织结构
             组织分工（相对静态关系）
                     工作任务分工
                     管理职能分工
             工作流程组织（动态关系）
                     管理工作流程组织
                     信息处理工作流程组织
                     物质流程组织

 
 组织结构模式反映各部门或人员之间的指令关系。
 工作流程组织反映各工作之间的逻辑关系。
 
 组织工具是组织论的应用手段，包括:(四图两表)
 (1)项目结构图;
 (2)组织结构图(项目管理组织结构图);
 (3)工作任务分工表;
 (4)管理职能分工表;
 (5)工作流程图;
 (6)合同结构图。
 
 */
#pragma mark 1Z201031 项目结构分析在项目管理中的应用

/*
 
 项目结构图(WBS):是一个组织工具，通过树状图， 逐层分解，【反映所有工作任务】。
 
 同一项目可有不同的分解方法，分解应与整个工程实施部署相结合，并与合同结构相结合。
 
 项目结构分解没有统一模式，但应参考以下原则:
 (1)考虑部署;
 (2)考虑组成;
 (3)有利于发包，有利于实施，结合合同结构;
 (4)有利于目标控制;
 (5)结合组织结构。
 2考虑2结合3有利于
 
 项目结构的编码依据是项目结构图。
 项目结构图和项目结构编码是其他编码的基础。
 其他编码指:投资、进度、质量、合同、信息、安全等编码(即三控三管编码)。
 
 */
#pragma mark 1Z201032 组织结构在项目管理中的应用

/*
  一、基本的组织结构模式——四图
         项目结构图
         组织结构图
         合同结构图
         工作流程图
 
 四图四关系四方框(P18—P23—P35)
 组织工具       表达的含义       矩形框内容       矩形框连接
 项目结构图      任务关系         任务              直线
 组织结构图      指令关系        工作部门          单向箭线
 合同结构图      合同关系        参与单位          双向箭线
 工作流程图      逻辑关系      工作和工作执行者      单向箭线
 
 二、基本的组织结构模式——三种典型组织结构
 
     职能组织结构
     线性组织结构
     矩阵组织结构
 
 三种典型组织结构的比较
    类型          指令源                   特点                        应用                      弊端
 职能组织结构        多         一个上级多个下级 一个下级多个上级      企业、学校、 事业单位     严重影响机制运行、目标实现
 线性组织结构        一              一个下级只有一个上级            国际上常用 不适特大系统         指令路径过长
 矩阵组织结构        二                纵向、横向两个指令               适合大系统
 
 矩阵制矛盾怎么解决?（三种方式）
 (a)最高指挥者协调、决策;
 (b)以纵向为主;
 (c)以横向为主
 

 */
#pragma mark  1Z201033 工作任务分工在项目管理中的应用

/*

 各方都应编各自的任务分工表。
 任务分工表是组织设计文件的一部分。
 
 
 编制任务分工表的程序:任务分解，明确任务，编制工作任务分工表。
 明确谁的任务?项目经理、主管工作部门或主管人员
 
 任务分工表的目的:应明确各项工作任务由哪个部门(或个人)负责、配合或参与。
 
 项目进展过程中，视必要对任务分工表进行调整。
 随着工程进展，任务分工表还将不断深化和细化。
 每一个任务，至少一个主办工作部门。
 运营部和物业开发部参与整个项目实施过程，不是在竣工前才介入。
 

 */
#pragma mark  1Z201034  管理职能分工在项目管理中的应用

/*

 管理是由多个【工作环节】组成的有限循环过程
 1.提出问题
 2.筹划-----提出多个方案
 3.决策-----从多方案中选择一个
 4.执行-----执行决策
 5.检查-----决策是否执行 -决策执行效果
 如发现新的问题 则提出问题 按上述流程走
 
 
 管理环节就是管理职能。
 不同职能可由不同部门承担。
 各方都应编各自的管理职能分工表。
 管理职能分工表反映项目经理、各工作部门、各工作岗位的职能分工。
 管理职能分工表也可用于企业管理（管理职能分工表既可用于企业管理，也可用于项目管理 ）。
 
 由差到好：
 岗位责任描述书
 管理职能分工表
 管理职能分工描述书
 
 
 */
#pragma mark  1Z201035 工作流程组织在项目管理中的应用

/*
 
 三种工作流程组织:
     (1)管理流程组织:投资、进度、合同、付款和设计变更;
     (2)信息流程组织:报告、数据;
     (3)物质流程组织:设计、采购、施工。
 
 工作流程组织的任务:定义工作的流程。
 工作流程图应视需要逐层细化。
 各方，都有各自的工作流程组织任务。
 
 工作流程图:
 反映一个组织系统中各项工作之间的逻辑关系(动态关系)，是一个组织工具。
 矩形框表示工作，(单向)箭线表示工作之间的逻辑关系，菱形框表示判别条件。
 两个矩形框分别表示工作和工作执行者。
 

 */
#pragma mark 1Z201036  合同结构在项目管理中的应用

/*
 
 合同结构图反映业主方和各参与方之间，以及项目各参与方相互之间的合同关系。
 
 合同结构图可以清晰地了解一个项目有哪些或将有哪些合同，以及项目各参与方的合同组织关系。
 
 */
#pragma mark********************************  1Z201040 建设工程项目策划

/*
 
 
 项目策划旨在为项目建设决策和实施增值。
 项目策划是专家知识、信息的组织和集成，实质是知识管理，是开放性的工作过程。
 
 实施策划的内容涉及的范围和深度，没有统一规定。
 
                            项目策划的主要任务和基本内容
                        主要任务                基本内容
 决策阶段策划     定义开发或建设的任务和意义。  1.项目环境和条件调查分析;
                                         2.项目定义和目标论证;
                                         3-7.组织、管理、经济、技术、合同策划。 关键词:实施期(运营期)......总体......
 
 实施阶段策划      确定如何开发或建设。        1.项目实施的环境和条件调查分析;
                                         2.项目目标的分析和再论证;
                                         3-8.项目实施的组织、管理、经济、技术、合同、风险策划。关键词:再，实施的
 
 决策策划，第二步，“定义和论证”的内容: (3)项目总投资的规划和论证; (4)建设周期的规划和论证。
 实施策划，第二步，“分析再论证”的内容: (1、3)......论证;(2、4)......规划;(5-7) 项目功能分解，建筑面积分配，确定项目质量目标。
 

 */
#pragma mark ********************************   1Z201050 建设工程项目采购的模式

/*

 
 */
#pragma mark 1Z201051  项目管理委托的模式

/*

 
 国际上，项目管理咨询公司的服务性质属于工程咨询(工程顾问)服务。
 国际上，业主方项目管理的模式: (1)自管;(2)托管;(3)共管(以咨询公司为主)。
 
 */
#pragma mark 1Z201052 设计任务委托的模式

/*

 
 国际上，建筑师事务所起主导作用。
 
 选择设计单位的方式:
 我国，设计招标;国际上，设计竞赛。
 
 设计任务的委托模式: (1)设计总包;(2)设计平行。
 
 */
#pragma mark 1Z201053 项目总承包的模式

/*
 
 一、项目总承包的内涵及分类
 
     项目总包受业主委托，对项目的【勘察、设计、采购、施工、试运行】等实行全过程或若干阶段的承包。
 
     项目总包的两种主要方式: (1)设计施工总包(DB); (2)设计采购施工总包(EPC)。
     均对工程的质量、安全、工期、造价全面负责。
 
     项目总包的基本出发点:借鉴工业生产的经验，实现生产过程的【组织集成化】，以克服由于设计施工分离导致的投资增加，以及设计施工不协调而影响进度的弊病。
 
     项目总包的主要意义:不在于总价包干和“交钥匙”。
             核心目的:为项目建设增值。
             计价方式:多数采用变动总价合同。
 
 
 二、项目总包从招标至确定合同价的基本工作程序
 
     (1)业主编制项目建设纲要或设计纲要，它是项目总包编制设计建议书的依据。
     (2)项目总包编制设计建议书和报价文件。
     (3)设计评审。
     (4)合同洽谈，包括确定合同价。
 
     项目总包招标多数采用功能描述方式，而不采用构造描述方式，因为招标时还没有设计文件。
 
 三、项目总包的工作程序 (对应P15)
 
     (1)启动:任命项目经理，组建项目部;
     (2)初始:编制项目计划;
     (3)设计;
     (4)采购;
     (5)施工:施工准备、施工，竣工试验、决算，移交资料、管理权;
     (6)试运行;
     (7)合同收尾:取得目标考核证书、履约证书， 办理决算、债权债务;(证书)
     (8)项目管理收尾:项目资料归档、项目总结、 项目人员考核、解散项目部。(项目)
 
 */
#pragma mark 1Z201054 施工任务委托的模式

/*
  一、三种承发包模式的特点比较——对业主而言
      模式         投资          进度          质量          合同          组织协调
      平行       早控不利       好 (短)      他控 (好)      量大， 不好      量大，不好
     施工总包     早控有利      不好 (长)      依赖总包       唯一， 好        唯一，好
     施工总管   不利( 管理费)    好 (短)      他控 (好)     量大， 不好    总管负责， 大大减轻
 
     1. 施工总包的最大缺点:建设周期较长。
     2. 工程实践中，“费率招标”，开口合同，对业主合同管理和投资控制十分不利。
     3. 一般情况，施工总管不参与具体施工，也想承担施工任务，通过投标获得。
     4. 施工总管的基本出发点:由施工总管负责对所有分包管理及协调，大大减轻业主的工作。
 
 二、施工总管与施工总包的模式比较
 
     1.工作程序不同
 
         施工总包:  施工图全部完成，招投标，施工，竣工验收。
         施工总管(平行):  施工图部分完成，招投标，施工， 竣工验收。
 
     2.合同关系不同
 
         施工总包:  业主   总包   分包
         施工总管:  业主     管理
                   业主    分包
                  或 业主   管理  分包
 
     3.对分包单位的选择和认可不同
 
         施工总包:一般情况，分包由总包选择，由业主认可。
         施工总管:一般情况，分包由业主选择，由总管认可。
 
     4.对分包单位的付款不同(与合同一致)
 
         施工总包:总包 分包
         施工总管:业主 分包
                 或施工总管   分包
 
     5.合同价格不同
 
         施工总包:工程款
         施工总管:管理费
 
     6.对分包单位的管理和服务相同
 
         既要负责对现场管理协调，也要负责向分包提供相应的服务。
         施工总管，不仅要管理和协调，还要对项目目标控制承担责任。
 
 三、施工总管与施工总包相比，合同价方面的优点:
 
         合同总额确定较有依据;
         所有分包通过招标获得，对业主节约投资有利;
         分包合同价对业主透明;(因为分包由业主签合同)
     其他方面的优点:
         只收管理费，不赚差价;
         边设计边施工，缩短建设周期，利于进度控制。
 
 */
#pragma mark 1Z201055 物资采购的模式

/*
 
 国际上，物资采购模式，如:
 (1)业主方自行采购;——甲购
 (2)约定某些物资为指定供货商;——甲招
 (3)承包商采购。——乙购
 
 我国，发包单位不得指定购入材料、构配件和设备或生产厂、供应商。
 
 采购管理程序:
 (1)明确采购产品或服务的要求;
 (2)编制采购计划;
 (3)市场调研，选择产品供应或服务单位;
 (4)确定供应或服务单位;
 (5)签订采购合同;
 (6)运输、验证、移交采购产品或服务;
 (7)处置不合格产品或不符合要求的服务;
 (8)采购资料归档。
 
 
 */
#pragma mark ********************************    1Z201060 建设工程项目管理规划的内容和编制方法

/*
 
 一、项目管理规划的内涵
 
     是纲领性文件。
     涉及项目整个实施阶段。
     属于业主方项目管理范畴。
     如果采用项目总包模式，业主也可委托项目总包编制。
     其他参与单位，也需要编制，但只涉及一个方面。
     包括【项目管理规划大纲和实施规划】两类。
 
 */
#pragma mark 1Z201061 项目管理规划的内容

/*
 
 项目管理规划的内容涉及的范围和深度，没有统一的规定，必须动态调整。
 规划大纲的内容:项目概况 + ......规划
 实施规划的内容:项目概况 + ......计划+ 既无“规划”也无“计划”。
 
 */
#pragma mark 1Z201062 项目管理规划的编制方法

/*
 
 
 1.规划大纲由组织管理层或组织委托的项目管理单位编制;
 2.实施规划由项目经理组织编制。
 
                规划大纲                实施规划
 编制依据       (1)可研报告;             (1)项目规划大纲;
              (2)设计文件;              (2)项目分析资料;
            (3)招标、合同文件;           (3)工程合同文件;
            (4)市场、环境信息。          (4)同类项目资料。
 编制程序       (1)明确目标;             (1)了解要求;
             (2)分析条件;              (2)分析条件;
             (3)收集资料;               (3)熟悉文件;
             (4)确定组织;               (4)组织编制;
             (5)明确内容;               (5)报批。
             (6)编制计划;
             (7)报批。
 
 
 */
#pragma mark ********************************    1Z201070 施工组织设计的内容和编制方法

/*
 
 
 施工组织设计以施工项目为对象编制，是指导施工的综合性文件。

 */
#pragma mark 1Z201071 施工组织设计的内容

/*
 
 一、施工组织设计的基本内容
 1. 工程概况
 2. 施工部署及施工方案(人材机安排，施工顺序)
 3. 施工进度计划(施工方案在时间上的安排)
 4. 施工平面图(方案、进度在空间上的安排)
 5. 主要技术经济指标
 
 二、施工组织设计的分类及其内容
 
     三种施工组织设计的编制对象:
     1.施工组织总设计——群体工程或特大型项目
     2.单位工程施工组织设计——单位工程
     3.施工方案——分部(分项)或专项工程
 
     三种施工组织设计的主要内容:
     施工组织总设计                        单位工程施工组织设计          施工方案
     1）工程概况                          1）工程概况                 1）工程概况
     2）总体施工部署                       2）施工部署                 2）施工安排
     3）施工总进度计划                     3）施工进度计划              3）施工进度计划
     4）总体施工准备与主要资源配置计划        4）施工准备与资源配置计划      4）施工准备与资源配置计划
     5）主要施工方法                       5）主要施工方案              5）施工方法及工艺要求
     6）施工总平面布置                     6）施工现场平面布置
 
     单无方法，“分”无部署、无平面布置
     都要 工程概况、施工进度计划、施工准备与资源配置计划
 
 */
#pragma mark 1Z201072 施工组织设计的编制方法

/*
 
 一、施工组织设计的编制和审批
 
     (1)由【项目负责人主持编制】，可分阶段进行。
     (2)施工组织总设计由总承包单位技术负责人审批;
         单位工程施工组织设计由施工单位技术负责人或 技术负责人授权的技术人员审批;
         施工方案应由项目技术负责人审批;
         重点、难点分部(分项)工程和专项工程施工方案由施工单位技术负责人批准。
     (总单分专，单位技术负责人审;施工方案，项目技术负责人审)
 
     专项施工方案，经施工单位技术负责人、总监签字后实施:
     1)基坑支护与降水工程;2)土方开挖工程;3) 模板工程;4)起重吊装工程;5)脚手架工程;6) 拆除爆破工程。
     其中，涉及深基坑、地下暗挖工程、高大模板工程的专项施工方案，还应组织专家论证。
 
     (3)专业承包的分部(分项)工程和专项工程施工方案，由专业承包单位技术负责人或技术负责人授权的技术人员审核;有总包的，由总包项目技术负责人审核。
     (4)规模较大的分、专施工方案，按单位工程施工组织设计进行编、审。
 
 二、施工组织设计的动态管理
 
     1.以下情况之一，应及时修改或补充。
         (1)设计，重大修改，修改;一般性修改，补充 【不包括更正】
         (2)法律、法规、规范和标准实施、修订和废止
         (3)主要施工方法有重大调整
         (4)主要施工资源配置有重大调整
         (5)施工环境有重大改变
     2.经修改或补充，应重新审批后实施。
 
 */
#pragma mark ********************************    1Z201080 建设工程项目目标的动态控制

/*
 
 
 
 */
#pragma mark 1Z201081 项目目标动态控制的方法及其应用

/*
 
 
 动态控制是项目管理最基本的方法论。
 
 一、动态控制工作程序(动态控制三大步、实施过程三小步)
 
    准备工作
            目标分解
            确定计划值
    动态跟踪与控制
            收集实际值
            比较计划与实际
            采取纠偏措施
                 组织措施
                 管理（合同）措施
                 经济措施
                 技术措施
    目标调整（如有必要进行调整，调整后要重新准备工作）
 

 
 二、纠偏措施关键词汇总(P57\P83\P153\P323\P356)
 
    组织措施        组织、人、部门、分工、流程、会议、责任制、编审调整(进度、工作计划);
                  生产要素优化配置、定额管理、任务单管理、活劳动、物化劳动、施工调度
    管理措施        思想、方法、手段、合同管理、风险管理、网络计划、信息技术、承发包(采购)模式
    经济措施        资金、资源、激励、成本风险分析;增减帐、业主签证
    技术措施        设计、施工、换机换料、技术经济分析
    合同措施        合同结构、合同条款、合同索赔(成本、合同两章特有)
 
 
 三、项目目标的动态控制和主动控制
 
    项目目标控制
            项目目标的事前控制------主动控制
                    事前分析可能导致项目目标偏离的各种影响因素
                    针对这些影响因素采取有效的预防措施
            项目目标的过程控制------动态控制
                    定期的进行项目目标的计划值和实际值的比较
                    当发现项目目标偏离时采取纠偏措施
 
 */
#pragma mark 1Z201082-83 动态控制的应用(进度、投资)

/*
 
 1.步骤:三大步三小步
 2.计划值和实际值的比较，两者是相对的，在前的为计划值，在后的为实际值。
 3.比较的性质:定量
 4.比较的成果:进度跟踪控制报告
 5.投资目标分解的目的:通过编制项目投资规划，分析论证目标实现的可能性。
 6.投资控制包括设计过程投资控制和施工过程投资控制，前者更重要。
 
 计划值和实际值的比较:
 时间先后顺序:
 投资规划、概算、预算、合同价、工程款支付、决算
 设计过程:(2个——1、1) 概算与投资规划、预算与概算
 施工过程:(8个——2、3、3)
 1)合同价与概算、预算;
 2)工程款支付与概算、预算、合同价;
 3)决算与概算、预算、合同价
 
 
 运用动态控制原理进行建设工程项目投资控制， 首先进行的工作是进行投资目标分解，确定投资控制的计划值
 
 */
#pragma mark ********************************    1Z201090 施工企业项目经理的工作性质、 任务和责任

/*
 
*/
#pragma mark 1Z201091 项目经理的工作性质

/*
 
 项目经理必须由取得建造师注册证书的人员担任，是否担任，由施工企业自主决定。
 项目经理，是施工企业法定代表人在项目上的代表人。
 建造师是专业人士，项目经理是工作岗位。
 
 1.项目经理应为合同当事人确认的人选，并在专用合同条款中明确项目经理的姓名、职称、证书编号、联系方式、 授权范围。承包人应向发包人提交项目经理的劳动合同、缴纳社会保险的有效证明。
 2.紧急情况，项目经理确保安全，48小时内书面报告。
 3.承包人更换项目经理，提前14天书面通知，并征得发包人书面同意。
 4.发包人要求更换项目经理，承包人14天内提书面改进报告。仍要求更换，28天内更换。
 5.授权下属履行职责，提前7天书面通知监理，并征得发包人书面同意。
 
 
 */
#pragma mark 1Z201092 施工企业项目经理的任务

/*
 
 1.项目经理的职责:4项
     (1)贯彻执行法律、法规、政策、企业制度;
     (2)严格财务制度;
     (3)履行各项条款;
     (4)对施工进行有效控制，确保质量工期安全文明。
 
 2.项目经理的权力:6项
     (1)组织项目管理班子;(参与)
     (2)受托签署有关合同;
     (3)调配进入工程项目的人力、物资、机械、资金等生产要素;
     (4)选择施工作业队伍;(参与)
     (5)进行合理经济分配。
 */
#pragma mark 1Z201093 施工企业项目经理的责任

/*
 
 一、项目管理目标责任书
 
     项目管理目标责任书应在项目实施前，由法定代表人或其授权人与项目经理协商制定。
 
 编制依据:
     (1)项目合同文件;
     (2)组织管理制度;
     (3)项目管理规划大纲;(易改为“实施规划”)
     (4)组织经营方针和目标
 
 二、项目经理的职责
     (2)主持编制项目管理实施规划;
     (3)对资源进行动态管理;
     (4)建立各种专业管理体系;
     (5)进行授权范围内利益分配;
     (6)参与工程竣工验收;
     (7)接受审计;
     (8)协助组织项目的检查、鉴定和评奖申报工作。
 
 三、项目经理的权限
     (1)参与招标、投标和合同签订;
     (2)参与组建项目经理部;
     (3)主持项目经理部工作;
     (4)授权范围内资金投入和使用;
     (5)制定内部计酬方法;
     (6)参与选择分包人;
     (7)参与选择物资供应单位;
     (8)授权范围内协调内、外部关系;
 
 四、项目经理的责任
 
     项目经理由于主观原因或工作失误，可能承担法律责任和经济责任。
     政府主要追究法律责任，企业主要追究经济责任。
     如果项目经理违法，企业也可以追究法律责任。
 
 */
#pragma mark 1Z201094 项目各参与方之间的沟通方法

/*
 
 一、沟通过程的要素
 
     五要素，即:主体、客体、介体、环境和渠道。
 
     主体:主导地位。
     客体:即沟通对象，出发点和落脚点。
     介体:包括沟通内容和沟通方法。
     环境:包括社会整体环境和区域环境。
     渠道:介体从主体到客体的途径。
 
 二、沟通能力和沟通障碍
 
     沟通能力:表达、争辩、倾听和设计能力。
     沟通两个要素:思维、表达。
     沟通两个层面:思维交流、语言交流。
     沟通障碍三个方面:发送者(表达、传递、过滤)、接受者(译码、筛选、心理、情绪)和通道(媒介、渠道、干扰)。
     沟通障碍两种形式:组织沟通障碍(组织机构过于庞大)、个人沟通障碍(个性，知识、经验，记忆，态度，不信任，畏惧感、心理品质)。
 
 */
#pragma mark 1Z201095 施工企业人力资源管理的任务

/*
 一、相关内涵
 
     1.人力资源管理的目的:调动所有项目参与人的积极性。
 
 二、项目人力资源管理计划
 
     包括:人力资源需求、配置、培训计划。
 
 三、劳动用工和工资支付管理
 
     1. 农民工是管理的重点对象;
     2(1).不得使用零散工;
     2(2).自用工之日起，订立书面合同;
     3(2).每月核算一次工资;
     3(3).至少每月支付一次工资，每季度结清工资;
     3(4).直接发放给劳动者本人;
     3(6).延期支付工资，最长不超过30日。
 
 */
#pragma mark ********************************    1Z201100 建设工程项目的风险 和风险管理的工作流程

/*
 
 
 
 */
#pragma mark 1Z201101 项目的风险类型

/*
 
 
 一、风险和风险量的内涵
 
     风险量:不确定的损失程度和损失发生的概率。
     风险等级=(概率+损失量)/2
 
     概率   很大       3 （C）          4           5(A)
           中等       2                3           4
           极小       1  (D)           2           3(B)
                   轻度损失(小)     中度损失(中)     重大损失(大)               损失量
 
    根据坐标轴：
     A降低概率 到B
     A降低风险量 到C

     A—5等风险;B、C—3等风险;D—1等风险。
 

 
 二、项目风险类型
 
     1.组织风险
 
         组织、流程、分工、人员
 
     2.经济与管理风险
 
         经济、资金、合同、防火、防范、安全
 
     3.工程环境风险
 
         自然、地质、水文、气象、火灾爆炸
 
     4.技术风险
 
         勘测、设计、施工、物资、机械
 
 */
#pragma mark 1Z201102 项目风险管理的工作流程

/*
 
 管理流程               工作内容
 识别         1.收集信息;2.确定因素;3.编制报告
 评估         1.分析概率;2.分析损失量;3.确定风险量、 风险等级
 响应         规避、减轻、自留、转移(投保)
 控制         预测、监控、预警
 
 */
#pragma mark ********************************     1Z201110 建设工程监理的工作性质、 工作任务和工作方法

/*
 
 
 
 */
#pragma mark  1Z201111 监理的工作性质

/*
 

 工程监理，属于【业主方】项目管理范畴，归为【工程咨询(工程顾问)】服务。
 
 监理工作特点:服务性、科学性、独立性、公平性。
 服务性:不可能......，也不可能......;
 独立性:不依附于监理对象;
 公平性:维护业主合法权益时，不损害承包商合法权益。
 
 */
#pragma mark 1Z201112 监理的工作任务

/*
 
 一、《建设工程质量管理条例》
 
     1.监理承担监理责任。
     2.未经监理工程师签字，建筑材料、构配件和 设备不得在工程上使用或安装，不得进行下一道工 序施工。未经总监签字，建设单位不拨付工程款， 不进行竣工验收。
     3.监理形式:旁站、巡视和平行检验。
 
 二、《建设工程安全生产管理条例》
 
     1.监理单位应当审查施工组织设计中的安全技术措施或者专项施工方案是否符合工程建设强制性标准。
     2.监理单位在实施监理过程中，发现存在安全事故隐患的，应当要求施工单位整改;情况严重的，应当要求施工单位暂时停止施工，并及时报告建设单位。拒不 整改或不停止施工，及时向有关主管部门报告。
 
 三、几个主要阶段监理工作的主要任务
 
     1.施工准备阶段
         1)审查施工组织设计;
         2)参与设计交底;
         3、4) 检查制度、机构、人员;
         5)审核分包资质;
         6)检查试验室;
         7)查验测量放线成果;
         8)审查开工条件。
 
     2.施工阶段
 
         (1)质量控制:1)验收隐蔽、分部分项工程，签署分部分项、单位工程质量评定表;3)审查质量证明资料;5)度量衡;6)监督试件抽查。
         (2)进度控制:3)建立进度台帐，核对形象进度。
         (3)投资控制:1)签发支付证书;2)建立支付台 帐;3、4)审查变更、索赔、争议、结算资料。
         (4)安全管理:2)编制监理应急预案;3)审查制度、 机构、人员;4)发现隐患，要求整改;情况严重，要求暂 停(总监下令);不改不停，向主管部门报告(举报)。
 
     3.竣工验收阶段
 
         2)审查竣工验收申请，编写质量评估报告;3)组织预 验收，参加竣工验收，签署验收意见。
 
 */
#pragma mark  1Z201113 监理的工作方法

/*
  一、监理工作有关规定
 
     监理认为施工不符合设计要求、技术标准和合同约定，有权要求建筑施工企业改正。
     监理发现设计不符合质量标准、合同约定，报告建设单位要求设计单位改正。
 
 
 二、监理规划和监理实施细则
 
     (一)编制时间、谁编谁审?
 
         监理文件名称             编制时间                编制人         审批人
         监理规划       签订监理合同、收到设计文件后          总监      监理单位技术负责人
         监理实施细则           施工开始前                 专业监         总监
 
     (二)编制内容(排除法)
 
         1.监理规划—— 12条
         2.监理实施细则—— 4条
 
            (1)专业工程特点
            (2)监理工作流程
            (3)监理工作要点
            (4)监理工作方法及措施
 
         异:专业要流; 同:方法措施
 
     (三)编制依据
 
         1.监理规划(项目...... + 监理大纲、监理合同)
                 1)法律、法规及项目审批文件;
                 2)与项目有关的标准、设计和技术资料;
                 3)监理大纲、监理合同及项目合同文件。
         2.实施细则(专业工程...... + 监理规划、施组设计)
                 1)已批准的工程建设监理规划;
                 2)相关专业工程的标准、设计和技术资料;
                 3)施工组织设计。
 
 
 
 */
#pragma mark - ****************************************************************** 1Z202000 项目成本控制 15
/*
 */
#pragma mark  ********************************    1Z202010 施工成本管理的任务与措施

/*
 */
#pragma mark  1Z202011 施工成本管理的任务

/*
 
 
 施工成本管理从投标报价开始，至保证金返还为止。
 
 施工成本:全部生产费用的总和。
 直接成本:构成工程实体的费用，包括人材机。
 间接成本:组织和管理生产的费用，包括管理人员工资、办公费、差旅费。
 
 施工成本管理是在保证工期和质量的情况下，寻求最大程度的成本节约。
 
 施工成本管理的任务:预测、计划、控制、核算、分析、考核。
 
 (一)施工成本预测
 
         施工前对成本进行估算，是决策与计划的依据。
 
 (二)施工成本计划
 
     以货币形式编制的书面方案，降低成本的指导文件，设立目标成本的依据。
     编制原则:从企业实际出发，与施工方案、进度计划等其他计划相结合，采用先进定额，统一领导分级管理，适度弹性。
 
     三类指标: (1)数量指标—成本额;(2)质量指标—降低率; (3)效益指标—降低额
 
 (三)施工成本控制
 
     贯穿于投标阶段直至保证金返还的全过程。
     分为事先、事中和事后控制。
 
     合同文件和成本计划是成本控制的目标，进度报告和工程变更索赔资料是成本控制的动态资料。体现了动态跟踪控制的原理。
 
 (四)施工成本核算
 
     核算是预测、计划、控制、分析和考核的依据。
     以单位工程为对象。
     形象进度、产值统计、实际成本归集三同步。同
     什么?工程量。
 
 (五) 施工成本分析
 
     分析是在核算的基础上，对成本的形成过程和影响成本升降的因素进行分析，以寻求进一步降低成本的途径，包括有利偏差挖掘和不利偏差纠正。
     贯穿施工成本管理的全过程。
     成本偏差控制:分析是关键，纠偏是核心。
 
 (六)施工成本考核
 
     目的:调动员工积极性。
     以【施工成本降低额和施工成本降低率】作为成本考核的主要指标。
     预测是决策的前提。计划是决策的具体化。 核算是最后检验。 考核是保证和手段。
 
 */
#pragma mark  1Z202012  施工成本管理的措施

/*
  一、施工成本管理的基础工作
 
     1.最根本最重要的基础工作:建立成本管理责任体系;
     2.统一成本计划的内容格式;
     3.建立施工定额;
     4.建立价格信息的收集网络和询价网点;
     5.建立管理制度;
     6.设计成本核算账册。
 
 二、纠偏措施关键词汇总(P57\P83\P153\P323\P356)
 
 组织措施       组织、人、部门、分工、流程、会议、责任制、编审调整(进度、工作计划);
               生产要素优化配置、定额管理、任务单管理、活劳动、物化劳动、施工调度
 管理措施       思想、方法、手段、合同管理、风险管理、网络计划、信息技术、承发包(采购)模式
 经济措施       资金、资源、激励、成本【风险分析】;增减帐、业主签证
 技术措施       设计、施工、换机换料、技术经济分析
 合同措施       合同结构、合同条款、合同索赔(成本、合同两章特有)
 

 */
#pragma mark  ********************************    1Z202020 施工成本计划

/*
 
 */
#pragma mark  1Z202021 施工成本计划的类型

/*

 类型         阶段           依据         定额
 竞争性    投标、签订合同     招标文件
 指导性    选派项目经理       合同价       预算定额
 实施性     施工准备        实施方案       施工定额
 
 施工预算内容:以单位工程为对象。
 预算表格包括 (7个表) :工程量汇总表， 工料分析表，人、材、机量汇总表，施工预算表，“两算”对比表。
 前5表关键词:分层、分段、分部位
 
 施工预算和施工图预算的区别
 1.编制依据不同
        施工预算——施工定额
        施工图预算——预算定额
 2.适用范围不同
        施工预算——施工企业内部
        施工图预算——既适用于发包，又适用于承包
 3.发挥作用不同
        施工预算——组织生产
        施工图预算——投标报价
 
“两算”对比的方法:
         1.实物对比法:计算人、材、机量。
         2.金额对比法:计算人、材、机费。
 
“两算”对比的内容:
        1.2.3. 总原则:实际比计划少。
        4.周转材
                脚手架:施工预算按施工方案确定，施工图预算以建筑面积为基数计算。
                模板:施工预算按混凝土与模板接触面积计算， 施工图预算按混凝土体积计算。
 
 */
#pragma mark  1Z202022 施工成本计划的编制依据

/*
 
 1.投标报价文件;
 2.企业定额、施工预算;
 3.施工组织设计或施工方案;
 4-6.人、材、机的价;
 7-8.合同
 9.成本核算制度和财务历史资料;
 10.施工成本预测资料;
 11.降低施工成本的措施;
 
 
 */
#pragma mark 1Z202023-25 施工成本计划的编制方法(3种)

/*
 
 编制施工成本计划，关键是确定目标成本。
 一、按成本构成编制
 二、按项目组成编制

         编成本支出计划时，要在【总体层面考虑总预备费】，在【主要分项工程安排不可预见费】。  【主要分项  不是所有分项】
 
 三、按进度编制
 
     对施工成本目标按时间进行分解。
 
     在编制网络计划时，应充分考虑进度，考虑成本，对项目划分的要求。
 
     两种表示方式:
     (1)在时标网络图上按月编制成本计划直方图; (2)时间-成本累积曲线(S曲线)。
 
     S曲线的绘制步骤:
     (1)编制横道图
     (2)在时标网络图上按月编制成本支出计划直方图
     (3)计算累计成本额
     (4)绘制S曲线
 
     S曲线的形状:
     原点出发，
     先凹后凸，不低头。
     越陡，进度越快;
     越缓，进度越慢。
     水平，进度暂停。
     所有工作按最迟开始时间开始，利于节约贷款利息，但降低按期竣工保证率。
 

 */
#pragma mark  ********************************    1Z202030 施工成本控制

/*
 
 */
#pragma mark  1Z202031 施工成本控制的依据

/*
 
  1.工程承包合同(预算收入和实际成本)
  2.施工成本计划(包括目标、措施、规划)
  3.进度报告(实际值)
  4.工程变更
  5.施工组织设计
  6.分包合同

 */
#pragma mark  1Z202032 施工成本控制的步骤

/*
 
 要做好施工成本的过程控制，必须制定规范的过程控制程序。
 
 成本过程控制的两类程序:行为控制程序，指标控制程序。
 行为是基础，指标是重点。两者既独立又联系，既补充又制约。
 
 1.行为控制程序
     (1)建立成本管理体系的评审组织和程序
 
         成本管理体系的建立是企业自身的需要，没有社会组织评审和认证。
 
     (2)建立成本管理体系运行的评审组织和程序
     (3)检查
     (4)纠偏
 2.指标控制程序
     (1)确定项目及月度成本目标
     (2)收集数据，监测过程
     (3)分析偏差，制定对策
     (4)指标考核行为，行为保证指标
 两个程序要相结合。
 

 */
#pragma mark  1Z202033 施工成本控制的方法

/*
 
 一、施工成本过程控制方法
     (一) 人工费——量价分离，劳务合同
     (二) 材料费——量价分离
          材料用量
                定额控制——有消耗定额的，限额领料。
                     1)限额领料的形式
                         1 按分项工程，以施工班组为对象。
                         2 按工程部位，以施工专业队为对象。
                         3 按单位工程，以项目经理部或分包单位为对象。
 
                     2)限额领料的依据
                         1 工程量，图纸是基础;
                         2 施工定额、企业定额，是标准;
                         3 施工组织设计，是非实体性消耗材料的基础;
                         4 变更洽商单，是调整限额量的依据。
 
                 指标控制——无消耗定额的，制定指标。
                 计量控制——收发计量、投料计量。
                 包干控制——小型及零星材料，量折费包干。
 
            材料价格 由材料采购部门控制，采用招标和询价等方式。
 
     (三)施工机械使用费的控制
 
             1.台班数量
                 (1)充分利用现有机械设备，加强内部调配
                 (2)保证作业时间，安排好工序衔接
                 (3)核定台班产量，实行超产奖励
                 (4)加强租赁
             2.台班单价
                 (1)加强维修保养
                 (2)加强人员培训
                 (3)加强配件管理
                 (4)做好采购计划，降低材料成本
                 (5)成立领导小组
 
     (四)施工分包费用的控制
                 做好分包工程的【询价】、订立平等互利的分包合同、建立稳定的分包关系网络、加强施工【验收】和分包【结算】。
 
 
 二、赢得值(挣值)法
 
         参数及指标名称       具体内容
         三个基本参数
                             已完工作预算费用(BCWP) =已完成工作量×预算单价
                             计划工作预算费用(BCWS) =计划工作量×预算单价
                             已完工作实际费用(ACWP) =已完成工作量×实际单价
 
         四个评价指标
                             费用偏差(CV)=已完工作预算费用 (BCWP)-已完工作实际费用(ACWP) C=B-A
                             1.CV<0时，表示费用超支
                             2.CV>0时，表示费用节支
 
                             进度偏差(SV)=已完工作预算费用 (BCWP)-计划工作预算费用(BCWS)S=P-S
                             1.SV<0时，表示进度延误
                             2.SV>0时，表示进度提前
                 （绝对偏差，仅适用于对同一项目作偏差分析）
 
                             费用绩效指数(CPI)=已完工作预算费 用(BCWP)/已完工作实际费用(ACWP)C=B/A
                             1.CPI<1时，表示费用超支
                             2.CPI>1时，表示费用节支
                             进度绩效指数(SPI)=已完工作预算费用 (BCWP)/计划工作预算费用(BCWS)S=P/S
                             1.SPI<1时，表示进度延误
                             2.SPI>1时，表示进度提前
                     相对偏差，可适用于同一项目和不用项目之间的偏差分析

 
 三、偏差分析的表达方法
     1.横道图法
         形象、直观、一目了然，能准确表达费用绝对偏差， 信息量少。一般在较高管理层应用。
     2.表格法
         最常用
         (1)灵活、适用性强。
         (2)信息量大。
         (3)可借助于计算机(定量)。
 
     3.曲线法 对应P110表8(效率、进度、投入) 定性
         反映费用(进度)累计偏差。
         CV<0，效率低 SV<0，进度慢
         真上假下，超前 真多假少，超前
     最理想的状态是三条曲线靠得很近、平稳上升，表示项目按预定计划目标进行。
 
 序号          图形                       三参数关系                     分析                         措施
 1                           ACWP>BCWS> BCWP  SV<0;CV<0      效率低 进度较慢 投入超前      用效率高的人员更换一批效率低的人员
 2                           BCWP>BCWS >ACWP SV>0;CV>0       效率高 进度较快 投入延后       若偏离不大， 维持现状
 3                           BCWP>ACWP> BCWS SV>0;CV>0       效率较高 进度快 投入超前       抽出部分人 员，放慢进度
 4                           ACWP>BCWP >BCWS SV>0;CV<0       效率较低 进度较快 投入超前     抽出部分人员 增加少量骨干人员
 5                           BCWS>ACWP >BCWP SV<0;CV<0       效率较低 进度慢 投入延后       增加高效人员投入
 6                           BCWS>BCWP >ACWP SV<0;CV>0       效率较高 进度较慢 投入延后      迅速增加人员投入
 

 */
#pragma mark  ********************************    1Z202040 施工成本分析

/*
 
 一、施工成本分析的依据
 
     1.会计核算——主要是价值核算
     2.业务核算——范围比会计、统计核算广
 
         会计和统计核算对已经发生的进行核算;
         业务核算，可以对已经发生的，尚未发生或正在发生的进行核算。
         特点:对个别经济业务进行单项核算
         目的:迅速取得资料。
 
     3.统计核算——计量尺度比会计宽，可以是货币、实物或劳动量。
 
 
 二、施工成本分析的方法
 
     (一)成本分析的基本方法
         1.比较法
             又称“指标对比分析法”，对比技术经济指标， 检查目标完成情况，分析产生差异的原因。
             (1)实际与目标比:检查完成情况，分析积极因素和消极因素
             (2)本期与上期比:反映提高降低程度
             (3)与平均、先进比:反映差距
 
         2.因素分析法
             又称连环置换法，分析各种因素对成本的影响程度。
             计算步骤:
             ● 确定分析对象
             ● 确定影响因素，并排序(排序规则:先实物量，后价值量;先绝对值，后相对值)
             ● 目标数相乘
             ● 替换计算
             ● 结果比较，确定影响程度
 
             计算思路:
             已知:目标数A、B、C，实际数A1、B1、C1 则有:
             ● 目标:A*B*C ——————1
             ● 量变:A1*B*C——————2
             ● 价变:A1*B1*C —————3
             ● 率变:A1*B1*C1—————4
             ● 2-1:量变引起费变
             ● 3-2:价变引起费变
             ● 4-3:率变引起费变
             ● 4-1:量价率均变引起费变
             (即实际与目标差额)
 
         3.差额计算法——因素分析法的简化形式
 
         4.比率法
             用两个以上指标的比例进行分析。
             (1)相关比率法:性质不同且相关，如产值与工资。
             (2)构成比率法:比重分析法或结构对比分析法，
                 考察量、本、利，即预算、实际和降低成本比例关系。
             (3)动态比率法:同类指标不同时期，基期指数、环比指数。
 
 
     (二)综合成本的分析方法
 
         1.分部分项工程成本分析
             (1)是项目成本分析的基础;
             (2)分析对象:已完分部分项工程;
             (3)分析方法:预算、目标和实际成本“三算”;
             (4)资料来源:预算成本来自投标报价，目标成本来自施工预算，实际成本来自施工任务单。
             (5)无法也没必要对每个分部分项工程进行成本分析。但主要分部分项工程必须进行成本分析，而且从开工到竣工。
         2.月(季)度成本分析
             (1)依据:当月(季)成本报表;
             (2)实际与预算比，分析降低水平;
             (3)实际与目标比，分析落实情况和管理中的问题和不足。
         3.年度成本分析
             (1)一年结算一次，不得转入下一年度;
             (2)依据:年度成本报表;
             (3)重点:针对下一年度施工进展制定可行的成本管理措施，保证成本目标实现。
         4.竣工成本的综合分析
             (1)以单位工程竣工成本分析资料为基础。
             (2)单位工程竣工成本分析的内容:
                 竣工成本分析;
                 主要资源节超对比分析;
                 主要技术节约措施及经济效果分析。
 
     (三)成本项目的分析方法
         1.人工费
         2.材料费
             (1)主材结构件——受价格和消耗量影响
             (2)周转材——取决周转率和损耗率
             (3)采购保管费——分析保管费率的变化
             (4)材料储备资金——分析日平均用量、单价、储备天数对储备资金的影响程度。储备天数是关键因素。
         3.机械使用费
         4.管理费
 
     (四)专项成本分析方法
         1.成本盈亏异常分析
             从 “三同步”入手。
             原因:经济核算基本规律是完成多少产值、消耗多少资源、发生多少成本之间有着同步关系。
             “三同步”适用于盈亏异常、月度成本检查。
             通过以下五方面进行分析:
             (1)产值与实际工程量和形象进度是否同步;
             (2)资源消耗与实耗人、材、机是否同步;
             (3)产值统计与实际支付是否同步;
             (4)预算成本与产值统计是否同步;
             (5)实际成本与资源消耗是否同步。
         2.工期成本分析
             计划工期成本与实际工期成本的比较分析。 先用比较法，再用“因素分析法”。
         3.资金成本分析
             应用“成本支出率”指标，即支出占收入的比例。
 

 
 */
#pragma mark - ****************************************************************** 1Z203000 项目进度控制 17
/*
 

 一、进度控制的工作环节
 项目管理各方，进度控制的目标和时间范畴不相同。
 进度控制是一个动态的管理过程。它包括: (1)目标分析和论证(目的:论证进度目标是否合理，
 有否可能实现。) (2)编制进度计划 (3)跟踪检查 (4)纠偏或调整
 1.项目进度控制的主要工作环节中，首先应进行的工作 是( )。
 A.编制进度计划 B.分析和论证进度目标 C.定期跟踪进度计划执行情况 D.采取纠偏措施
 【答案】B
 
 */
#pragma mark 1Z203010 ********************************   建设工程项目进度控制与进度计划系统

/*
 
 */
#pragma mark 1Z203011 项目进度控制的目的

/*
 
 进度控制的目的:通过控制实现进度目标。
 进度控制的过程也是进度不断调整的过程。
 进度控制不仅关系到进度目标能否实现，还直接关系
 到质量和成本。 最基本的工程管理原则:确保质量，控制进度。 项目进度计划系统是项目进度控制的依据。P123 项目进度计划系统建立完善有个过程，逐步形成。
 
 2.关于建设工程项目进度控制的说法，正确的是( )。 A.进度控制的过程，就是随着项目的进展，进度计划
 不断调整的过程 B.施工方进度控制的目的就是尽量缩短工期 C.项目各参与方进度控制的目标和时间范畴是相同的 D.施工进度控制直接关系到工程的质量和成本 E.进度控制的目的是通过过程控制以实现进度目标
 【答案】ADE
 */
#pragma mark 1Z203012 项目进度控制的任务

/*
  业主方——控制整个项目实施阶段的进度。包括设计准备、
 设计、施工、物资采购、动用前准备。与P4区别!
 设计方——依据设计合同控制设计进度。应尽可能使设计进 度与招标、施工、物资采购相协调。国际上，设计进度计划 主要是出图计划。出图计划，是设计方控制进度的依据，也 是业主方控制设计进度的依据。
 施工方——依据施工合同控制施工进度。施工方应编制不同 深度、不同功能、不同周期的进度计划。
 供货方——依据供货合同控制供货进度。
 
 3.建设项目进度控制中，业主方的任务是控制整个 项目( )的进度。
 A.实施阶段 B.决策阶段 C.项目全寿命周期 D.使用阶段
 【答案】A 【拓展】该实施阶段是指?
 4.施工方进度控制的任务是依据( )对施工进 度的要求控制施工进度。
 A.施工组织设计 B.施工任务委托合同 C.施工平面布置图 D.施工图
 【答案】B
 5.在项目实施过程中，设计方编制的设计工作进度应 尽可能与招标、施工和( )等工作进度相协调。
 A.项目选址 B.可行性研究
 C.竣工验收 D.物资采购
 【答案】D 【拓展】国际上，设计进度计划主要是?
 
 */
#pragma mark 1Z203013 项目进度计划系统的建立

/*
 
 进度计划系统的四个层次:P123图
 第二层次(平面):不同项目参与方 第三、四层次(平面):不同深度
 进度计划系统的四个类型: 1.不同深度——总规划、子规划、 单项计划 2.不同功能——控制性、指导性、实施性 3.不同项目参与方——业主、设计、施工和采购供货 4.不同周期——5年、年、季、月和旬
 必须注意各进度计划系统之间的联系协调。
 6.如果一个进度计划系统由总进度计划、项目子 系统进度计划、项目子系统的单项工程进度计划 组成。该进度计划系统是由(  )的计划组成的 计划系统。
 A.不同功能 B.不同项目参与方
 C.不同深度 D.不同周期
 【答案】 C
 */
#pragma mark 1Z203014 计算机辅助建设工程项目进度控制

/*
 
 进度计划软件是在网络计划原理的基础上编制的。
 计算机辅助网络计划编制的意义: (1)解决计算量大的困难;(2)确保计算准确性; (3)利于网络计划调整; (4)利于编资源计划。
 为使各方快捷获取信息，可利用项目信息门户作为
 基于互联网信息处理平台辅助进度控制。
 
 7.计算机辅助工程网络计划编制的意义，在于( )。 A.确保工程网络计划计算的准确性 B.确保工程网络计划原始资料的准确性 C.确保工程网络计划的按时完成 D.有利于工程网络计划的及时调整
 E 有利于编制资源需求计划
 【答案】ADE 【拓展】为使各方快捷获取信息，怎么办?
 */
#pragma mark 1Z203020 ********************************   建设工程项目总进度目标的论证

/*
 
 一、总进度目标论证的工作内容
  1.总进度目标确定的时间范畴:决策阶段
  2.总进度目标控制的时间范畴:实施阶段
  3.哪方任务:业主方(协助业主的项目总包方)  4.总进度目标控制前，首先做什么工作?:分析
 和论证目标实现的可能性。
 
 二、总进度目标论证的工作内容
 总进度目标论证的工作:总进度规划编制、工程
 实施条件分析和工程实施策划。
 总进度目标论证的核心工作:通过编制总进度纲
 要论证总进度目标实现的可能性。
 总进度纲要的主要内容:(4总1子，里程碑)
 (1) 总体部署;
 (2) 总进度规划;
 (3) 子系统进度规划;
 (4) 里程碑事件进度目标;
 (5) 总进度目标实现的条件和采取的措施。
 
 三、总进度目标论证的工作步骤:(三先三后)
 (1) 调研;
 (2) 项目结构分析;
 (3) 进度结构分析;
 (4) 项目编码;
 (5) 编各层(各级)进度计划; (6) 编总进度计划;
 (7) 调整(计划);
 (8) 报告。
 1. 调研和收集资料包括:(1)-(3)收集:决策阶段 进度目标资料、组织管理经济技术资料、类似项目进度 资料;(4)-(5)调查:总体部署、主客观条件。
 2. 项目结构分析是将整个项目逐层分解，确立工作目录， 一到三级工作目录分别是子系统、子项目、工作项。
 3. 进度结构分析第一至三层进度计划，分别是子系统、 子项目、工作项的进度计划。
 4. 项目编码应考虑:计划层、计划对象、工作。
 
 1.建设工程项目总进度目标论证的主要任务有(  )。    A. 总进度规划编制
 B. 工程实施条件分析   C. 工程实施策划
 D. 项目总进度目标确定   E. 项目经济评价
 【答案】ABC
 2.大型建设工程项目总进度纲要的内容之一是( )。 A.里程碑事件的计划进度目标 B.工程项目总进度计划 C.工程项目设计总进度计划
 D.各子系统进度计划
 【答案】A
 3. 建设工程项目总进度目标论证的工作有:1确定项目 的工作编码;2调查研究和收集资料;3进行项目结构 分析;4进行进度计划系统的结构分析等。其工作步骤 为( )。
 A.1-2-3-4 B.2-1-4-3
 C.1-4-2-3 D.2-3-4-1
 【答案】D
 4. 关于大型建设工程项目总进度目标论证的说法，正确 的是( )。
 A.大型建设工程项目总进度目标论证的核心工作是 编制总进度纲要
 B.大型建设工程项目总进度目标论证首先开展的工 作是调查研究和收集资料
 C.大型建设工程项目总进度目标的确定应在项目的 实施阶段进行
 D.若编制的总进度计划不符合项目的总进度目标， 应调整总进度目标
 【答案】B
 5. 将一个子项目进度计划分解为若干个工作项，属于 项目总进度目标论证工作的( )。
 A. 项目的结构分析
 B. 进度计划系统的结构分析 C. 项目的工作编码
 D. 各层进度计划的关系协调
 【答案】A
 */
#pragma mark 1Z203040 ********************************   建设工程项目进度控制的措施

/*
  纠偏措施关键词汇总(P57\P83\P153\P323\P356)
 组织措施
 组织、人、部门、分工、流程、会议、责任制、编审调整
 (进度、工作计划);生产要素优化配置、定额管理、任
 务单管理、活劳动、物化劳动、施工调度
 管理措施
 思想、方法、手段、合同管理、风险管理、网络计划、信 息技术、承发包(采购)模式
 经济措施
 资金、资源、激励、成本风险分析;增减帐、业主签证
 技术措施
 设计、施工、换机换料、技术经济分析
 合同措施
 合同结构、合同条款、合同索赔(成本、合同两章特有)
 
 1.编制进度计划的流程，如:定义组成;编审调整程序。 2.会议应明确:类型、人、时间、文件。
 3.管理观念方面应加强:1)系统的观念;2)动态控制的 观念;3)多方案比选的观念。
 4.在预算中，应考虑加快工程进度的资金。
 5.进度受阻，分析是否存在设计技术的影响因素，有无设 计变更的可能性。是否存在施工技术的影响因素，有无改 变施工技术、施工方法和施工机械的可能性。
 
 1.下列进度控制措施中，属于管理措施的是( )。 A.编制工程资源需求计划 B.应用互联网进行进度控制 C.制定进度控制工作流程
 D.选择先进施工技术
 【答案】B
 2. 下列建设工程项目进度控制的措施中，属于技术 措施的是( )。
 A. 确定各类进度计划的审批程序 B. 选择合理的合同结构
 C. 优选工程项目施工方案
 D. 选择工程承发包模式
 【答案】C
 3. 项目进度控制的组织措施包括( )。 A.设立专门的进度控制工作部门 B.编制施工进度控制的工作流程 C.重视信息技术在进度控制中的应用 D.编制与进度计划相适应的资源需求计划 E.进度控制的主要工作环节应在项目管理组织
 设计的任务分工和管理职能分工表中标示并落实
 【答案】ABE
 4.下列建设工程项目进度控制措施中，属于经济措施 的有( )。
 A.编制资源需求计划 B.明确资金供应条件 C.对施工成本进行风险分析 D.进行进度风险分析 E.分析设计技术的影响因素
 【答案】ABC
 5.为实现进度目标而采取的经济激励措施所需的费用， 应在(  )中考虑加快工程进度所需要的资金。
 A.工程预算 B.投标报价
 C.投资估算 D.工程概算
 【答案】A
 6. 项目进度控制的技术措施以及对实现进度目标有利的技术， 包括( )。
 A.施工人员 B.施工技术 C.施工方法 D.施工机械 E.信息处理技术
 【答案】BCD
 */
#pragma mark 1Z203030 ********************************   建设工程项目进度计划的编制和调整方法

/*
 
 */
#pragma mark 1Z203031 横道图进度计划的编制方法

/*
 
 是最简单、
 运用最广、传统
 的进度计划方法。
 用于小型项
 目、大型项目子
 项目、计算资源
 需求量和概要预
 示进度。
 
  横道图优点:直观、易懂
  横道图缺点: (1)逻辑关系不易表达清楚; (2)手工编制; (3)不能确定关键工作、关键路线与时差; (4)手工调整; (5)难以适应较大的系统。
 1. 与工程网络计划方法相比，横道图进度计划方法 的缺点是不能( )。
 A. 直观表示计划中工作的持续时间 B. 确定实施计划所需要的资源数量 C. 直观表示计划完成所需要的时间 D. 确定计划中的关键工作和时差
 【答案】D
 */
#pragma mark 1Z203032 工程网络计划的编制方法

/*
 
 */
#pragma mark 1Z203033 工程网络计划有关时间参数的计算

/*
 
 我国常用的工程网络计划包括: 1.双代号网络计划
 2.单代号网络计划 3.双代号时标网络计划 4.单代号搭接网络计划
 专题一:双、单代号网络计划的基本概念及看图识错  双代号网络计划(P127)
  单代号网络计划(P133)
 节点编号
 
 1.双代号网络计划的基本概念(P127)
 (1)箭线(工作)——表示逻辑关系 实箭线——占用时间、多数消耗资源
 (只占时间，不耗资源，如混凝土养护) 虚箭线——不占时间，也不耗资源
 作用——联系、区分、断路 工作类型——本工作、紧前工作、紧后工作、平行工作 箭线方向——从左到右
 (2)节点——一项工作只有唯一一条箭线和一对节点。 节点编号——从小到大，可不连续，但不允许重复。
 (3)线路
 从起始到终点的通路，叫线路。 总时间最长的线路，称为关键路线。 关键线路上的工作，叫关键工作。 关键线路至少一条，可能多条，可能转移。
 
 (4)逻辑关系 工艺关系——工艺过程、工作程序决定的先后顺序 组织关系——组织安排或资源(人、财、机、资金)
 调配而产生的先后顺序(同类型的先后顺序)
 
 2.双代号网络计划的绘图规则(P128)
 (1)必须正确表达逻辑关系(扎1与支3、浇1与扎3之间本没 有逻辑关系，上图形成了逻辑关系，下图采用断路法修正)
 
 (2)不允许(严禁)出现循环回路
 (3)节点之间严禁出现双向箭头或无箭头的连线
 
 (4)严禁出现无箭头节点或箭尾节点的箭线
 (5)当节点有多条箭线时，可使用母线绘制
 
 (6)箭线不宜交叉，不可避免，可用过桥法或指向法
 (7)网络图中只有一个起点节点和一个终点节点
 
 3.单代号网络计划的基本概念(P133)
 不用虚箭线。
 4.单代号网络计划的绘图规则(P133)
 (6)只有一个起点和一个终点，当有多个起点或终 点时，应在两端分别设一项虚工作。
 
 1.在双代号网络图中，虚工作(虚箭线)表示工作之间的 ( )。
 A. 停歇时间 B. 总时差
 C. 逻辑关系 D. 自由时差
 【答案】C 【拓展】虚箭线的作用?联系、区分、断路
 2. 某工程施工进度计划如图所示，下列说法正确的有( )。
 A. R的紧后工作时A、B B. E的紧前工作只有C C. D的紧后工作只有F D. P没有紧前工作
 E. A、B的紧后工作都有D
 【答案】ACDE
 
 3. 某分部工程双代号网络计划如图所示，根据绘图规则要 求，该图的错误为( )。
 A.节点编号错误 B.逻辑关系颠倒 C.有多个起点节点 D.有多个终点节点
 【答案】D
 
 4.某分部工程双代号网络计划如下图所示，其作图错误包括 ( )。
 A.有多个起点节点 B.有多个终点节点 C.存在循环回路 D.工作代号重复 E.节点编号有误
 【答案】BCE
 5.某单代号网络图如下图所示，存在的错误有( )。
 A.多个起点节点 B.有多余虚箭线 C.出现交叉箭线 D.没有终点节点 E.出现循环回路
 【答案】ABC
 
 工作
 A
 B
 C
 D
 E
 F
 紧前工作
 —
 —
 A
 A、B
 D
 C、D
 6.某分部工程各工作 之间的逻辑关系如上 表所示，根据该逻辑 关系表绘出的正确网 络图是( )。
 【答案】C
 专题二:双代号网络计划时间参数计算及关键线路
 确定
 1.工作持续时间和工期(P137) 工作持续时间(Di-j)——一项工作从开始到完成的时间。 工期(T)
 计算工期Tc——根据网络计划计算出来的工期 要求工期Tr——任务委托人要求的工期 计划工期Tp——任务实施人计划的工期
 已规定要求工期，计划工期小于等于要求工期，Tp≤Tr
 未规定要求工期，计划工期等于计算工期，Tp=Tc
 2.六个时间参数 (1)最早开始时间ESi-j，各紧前工作全部完成，
 本工作有可能开始的最早时刻。
 (2)最早完成时间EFi-j，各紧前工作全部完成， 本工作有可能完成的最早时刻。
 (3)最迟开始时间LSi-j，不影响整个任务按期完 成，本工作必须开始的最迟时刻。
 (4)最迟完成时间LFi-j，不影响整个任务按期完成， 本工作必须完成的最迟时刻。
 (5)总时差TFi-j，不影响总工期，本工作可以利 用的机动时间。
 (6)自由时差FFi-j，不影响紧后工作最早开始， 本工作可以利用的机动时间。
 
 3.六时参数的数值表达(对应P138-139的10个公式)
  起点工作最早开始时间=0
  其他工作最早开始时间=各紧前工作的最早完成时间的最 大值
  最早完成时间=最早开始时间+持续时间
  计算工期=终点节点的各项工作的最早完成时间的最大值  终点工作最迟完成时间=计划工期
 
  其他工作最迟完成时间=各紧后工作的最迟开始时间的最小值  最迟开始时间=本工作的最迟完成时间-持续时间
  总时差=最迟开始时间-最早开始时间=最迟完成时间-最早完 成时间
  终点工作自由时差=计划工期-终点节点最早完成时间
  其他工作自由时差=紧后工作的最早开始时间-本工作的最早完 成时间
 
 4.计算 (1)步骤:
 (1)从左到右计算ES、EF，遇到有大小时取大; (副产品:计算工期Tc);
 (2)从右到左计算LF、LS，遇到有大小时取小; (3)从右到左计算TF; (4)从右到左计算FF，遇到有大小时取小。
 (2)口诀:
 顺加取大，逆减取小
 
 5.【示例】计算双代号网络计划的时间参数、总工期并 标出关键线路(六时法) 总工期:终点节点最早完成时间; 关键线路:总时差最小(此处为零)的工作连成的线路
 解析:
 
 1. 工作E有四项紧前工作A、B、C、D，其持续时间分别为2 天、6天、7天、5天，最早开始时间分别为第8天、4天、6天、 10天，则工作E的最早开始时间为第( )天。
 A.10 B.12
 C.13 D.15
 【答案】D
 2. 某施工企业与业主签订了某工程的施工承包合同。经监 理工程师审核批准的施工进度计划如图所示(单位:天)。
 (1)监理工程师审核批准的进度计划工期是( )天。 A.210 B.245 C.280 D.300
 【答案】D
 (2)上述施工网络计划中，外装修作业的最早开始 时间和最迟开始时间分别是( )天。
 A.185和205 B.185和235
 C.205和235 D.235和255
 【答案】A
 (3)上述施工网络计划中，电梯安装及调试工作的 总时差为( )天。
 A.30 B.60 C.90 D.120
 【答案】C
 3. 某工程网络计划中，工作M的自由时差为2天，总时差为5天。 实施进度检查时发现该工作的持续时间延长了4天，则工作M的 实际进度( )。
 A.不影响总工期，但将其紧后工作的最早开始时间推迟2天 B.既不影响总工期，也不影响其后续工作的正常进行 C.将使总工期延长4天，但不影响其后续工作的正常进行 D.将其后续工作的开始时间推迟4天，并使总工期延长1天
 【答案】A
 4. 在工程网络计划中，工作M的最迟完成时间为第28天， 其持续时间为6天。该工作有两项紧前工作，它们的最早完成时 间分别为第12天和第15天，则工作M的总时差为( )天。
 A. 5 B. 6 C. 7 D. 8
 【答案】C
 5. 某工程网络计划中，工作F的最早开始时间为第11 天，持续时间为5天，工作F有三项紧后工作，它们的 最早开始时间分别为第20天、第22天和第23天，最 迟开始时间分别为第21天、第24天和第27天，则工 作F的总时差和自由时差分别为( )天。
 A. 5;4 B. 4;5
 C. 5;5 D. 4;4
 【答案】A
 最快速计算工期、判断关键线路的方法——标号法 示例:
 解析:
 
 6. 下列网络计划的计算工期是( )。
 A. 9 B. 11 C. 12 D. 13
 【答案】C
 7. 某工程双代号网络计划中关键线路有( )。
 A. 1-2-6-7 B. 1-2-5-6-7
 C. 1-2-4-5-6-7 D.1-2-4-6-7
 【答案】C
 
 8. 某工程双代号网络计划如下图所示，其关键线路有( )。
 A.1—2—4—6—8—9 B.1—2—5—6—8—9 C.1—2—7—8—9 D.1—2—4—6—7—8—9 E.1—2—5—6—7—8—9
 【答案】ABDE (标号法)
 
 专题三:单代号网络计划的时间参数计算及关键线路
 确定 1.计算工期和关键线路(标号法)
 解析:
 计算工期=15天
 1.下图所示的单代号网络计划，其计算工期为( )天。
 A.11 B.9 C.12 D.15
 【答案】C
 
 2. 某工程单代号网络计划如下图所示，其关键线路有 ( )条。
 A.1 B.2 C.3 D.4
 【答案】B
 
 3. 某分部工程的单代号网络计划如图所示(单位:天)，
 正确的有( )。
 A.有两条关键路线 B.计算工期为15天 C.工作G的总时差和
 自由时差均为4
 2 A
 7 G
 5 8 10 D H Fin
 530
 69
 EI 65
 D.工作D和I之间的时间间隔为1
 4 2
 E.工作H的自由时差为2 C
 【答案】BCD 【解析】C:TF=10-6=4，FF=15-11=4
 1 St
 0
 3 B 4
 6 5
 2.时间参数的计算公式(P142)
 (3)计算相邻两项工作之间的时间间隔LAGi,j LAGi,j=ESj-EFi (即自由时差)
 (4)计算工作总时差(逆) TFi=min{TFj+LAGi,j}
 (5)计算工作自由时差(逆) FFi=min{LAGi,j}
 
 4. 某网络计划中，工作A的紧后工作是B和C，工作B的 最迟开始时间为14天，最早开始时间为10，工作C的 最迟完成时间为16，最早完成时间为14，工作A和工 作B、C的间隔时间分别为5、6天，则工作A的总时差 为( )天。
 A. 3 B. 7 C. 8 D. 10
 【答案】C
 【解析】TFi= min{TFj+LAGi,j}
 专题四:双代号时标网络计划的概念及识图(P130-132)
 1.定义
 实箭线表示工作，虚箭线表示虚工作，波形线表示
 工作的自由时差。
 2.特点
 (2)图上直接显示各工作的最早开始与最早完成 时间，自由时差，关键线路。
 
 3. 解题思路
 先找关键线路，最后判断选项正误。
 
 4.主要题型 第一类:求时间参数、计算工期、关键线路
 ● 最早开始时间——实箭头起点
 ● 最早完成时间——实箭头终点(或波形线的起点) ● 最迟开始时间=最早开始时间+总时差
 ● 最迟完成时间=最早完成时间+总时差
 ● 计算工期——终点节点与起点节点的位置之差
 ● 关键线路——无波形线的通路(逆序)
 ● 自由时差——波形线长度
 ● 总时差—— 该工作及后续线路上波形线之和的最小值
 1.关于工作D的时间参数的说法中，正确的为( )。 (单位:月)
 A.最迟开始时间为第3个月末 B.总时差为1个月 C.自由时差为0个月 D.最迟完成时间为第8个月末
 E.最早开始时间为第4月初
 【答案】BCE
 
 2.已知某基础工程双代号时标网络计划如下图所示，如果 工作E实际进度延误了4周，则施工进度计划工期延误( )周。
 A.2 B. 3 C.4 D. 5
 【答案】B
 
 3.某分部工程双代号时标网络计划如下图所示，该计划 所提供的正确信息有( )。
 A.工作B的总时差为3天 B.工作C的总时差为2天 C.工作D为关键工作 D.工作E的总时差为3天 E.工作G的自由时差为2天
 【答案】ABCD
 
 ★第二类:实际进度前锋线:自上而下，用点画线，将各项 工作实际进度达到的前锋点连接而成的折线。
 解题步骤:先沿着时点画竖直线，再找关键线路，然后判
 断选项正误。
 
 4.双代号时标网络计划， 执行到第4周末及第10周 末时，检查其进度如图 前锋线所示，检查结果 表明( )。
 A.第4周末检查时工作B拖后1周，但不影响工期 B.第4周末检查时工作A拖后1周，影响工期1周 C.第10周末检查时工作I提前1周，可使工期提前一周 D.第10周末检查时工作G拖后1周，但不影响工期 E.在第5周到第10周内，工作F和工作I的实际进度正常 【答案】BD 平行关键线路，部分提前不能提前
 5.某分部工程时标网络计划如图所示，当执行到第3周末及 第6周末时，检查得到的实际进度如图的实际进度前锋线所示， 该图表明( )。
 
 A.工作A和工作D在第4周至第6周内实际进度正常 B.工作B和工作E在第4周至第6周内实际进度正常 C.第3周末检查时预计工期拖后1周 D.第6周末检查时工作G实际进度拖后1周 E.第6周末检查时预计工期拖后1周
 【答案】CE 【解析】平行关键线路，部分拖后一定拖后
 总结:提前按最少的算，拖后按最大的算!
 专题五:单代号搭接网络计划的概念及计算(P134-137， P144-150)
 1.搭接顺序(时距)
 FTSi,j ——工作i完成到紧后工作j开始的时间间距; FTFi,j ——工作i完成到紧后工作j完成的时间间距; STSi,j ——工作i开始到紧后工作j开始的时间间距; STFi,j ——工作i开始到紧后工作j完成的时间间距。
 
 2.搭接关系——记住四个例子 (1)完成到开始时距(FTS)
 堤坝护坡，一定要等土堤自然沉降后才能修护坡。
 (2)完成到完成时距(FTF)
 工作前慢后快，前工作必须先完成，后工作才能完成。
 (3)开始到开始时距(STS)
 道路路基路面工程，路基开始，路面才能开始。
 (4)开始到完成时距(STF)
 地下水位以上的土方开挖几天后，降水工作必须完成。
 3.时间参数计算(P144-146，对应P147-148)
 (1)计算最早时间(开始、完成) 3)当出现最早开始时间为负时，应将该工作与起点
 节点用虚箭线相连接，并确定时距为:STS=0;——对应 P147(4)
 5)当有两种以上的时距(有两项及以上紧前工作)时， 分别计算最早时间，取其最大值;——对应P148(7)
 6)最早完成时间的最大值若在中间工作，则该工作应 与终点节点用虚箭线相连接，并确定时距为:FTF=0;—— 对应P148(9)
 
 (2)计算时间间隔LAGi,j
 (3)计算工作总时差(逆) TFn=Tp-EFn
 (4)计算工作自由时差(逆) FFn=Tp-EFn
 (5)计算工作最迟完成时间 LFn=Tp LFi=EFi+TFi
 (6)计算工作最迟开始时间 LSi=ESi+TFi
 TFi=min{TFj+LAGi,j} FFi=min{LAGi,j}
 1.某道路工程在进行基层和面层施工时，为了给面层铺设提供 工作面和工作条件，需待基层铺设一定时间后才能进行面层摊 铺，这种时间间隔是( )时距。
 A.STS B.FTF C.STF D.FTS
 【答案】A
 2.已知某单代号搭接网络计划中，工作A最早开始时间和 最早完成时间分别为10天和24天，工作持续时间为14天，如果工 作A和工作B之间的搭接关系STS1,2=3;FTF1,2=6，设A，B工作均 为连续，B工作持续时间为8天，则工作B的ES2和EF2分别为( )。
 10
 1
 14
 A.13天和21天
 C.22天和30天
 【答案】C
 24
 ES 2
 EF 2
 STS 1.2 =3 FTF 1.2=6
 B.19天和27天 D.23天和31天
 2 8
 A
 B
 
 3.某单代号搭接网络计划如图所示，节点中下方数字为该 工作的持续时间，其中的关键工作有( )。
 D 10
 AG
 B
 FTS=1 9
 STS=4
 FTS=6
 FTF=8
 6
 8
 A.工作A B.工作B D.工作D E.工作E
 4 E
 7
 STF=5
 STS=5
 C
 STS=10
 C.工作C
 【解析】
 000 026
 SA 0 LAG=0 6
 4 2 13
 14 2 24
 STS=5
 STS=4
 LAG=2
 LAG=0
 FTS=6
 LAG=0
 STF=5
 FTF=8 LAG=0
 LAG=3
 【答案】CE
 LAG=0
 008
 10 0 17
 B FTS=1 D 9 LAG=0 10
 21 0 25
 G 4
 C
 STS=10
 E 8 LAG=0 7
 */
#pragma mark 1Z203034 关键工作、关键路线和时差的确定

/*
 
 1.关键工作——总时差最小的工作 计划工期等于计算工期，总时差为零(特例) 要求工期小于计算工期，总时差为负 要求工期大于计算工期，总时差为正
 
 2.四种网络计划关键工作、关键线路的确定
 网络 类型
 双代号 网络计划
 P139
 单代号(搭接) 网络计划 P143、
 146
 双代号时标 网络计划 P132
 关键 工作
 (1)当计划工期=计算工期，总时差为0的工作; (2)当计划工期不等于计算工期，总时差最小的工作;
 关键 线路
 (1)总的持续时 间最长的线路;
 (2)全部由关键 工作组成的线路
 (1)总的持续时间 最长的线路;
 (2)全部由关键工 作组成的线路;
 (3)从起点到终点 均为关键工作，且所 有工作的时间间隔为 零的线路
 (1)总的持续时 间最长的线路;
 (2)全部由关键 工作组成的线路; (3)无波形线的
 通路
 
 3.网络计划调整的方法
  压缩关键线路(工作)的持续时间
  当计算工期不能满足要求工期时，压缩关键工作持续时间
 以满足工期要求。选择关键工作时，宜考虑下述因素:  (1)不影响质量和安全的工作;
  (2)有充足备用资源的工作;
  (3)增加的费用最少的工作。
 拓展——工期、紧后工作延误索赔
 责任
 工作
 赔偿方法
 施工方
 关键工作
 工期:不给顺延
 非关键工作
 业主方、 不可抗力
 关键工作
 工期:延误天数就是顺延天数
 非关键工作
 工期:比较总时差，超过总时差的
 天数就是顺延天数
 业主方、 不可抗力
 关键工作
 紧后工作:延误天数就是影响天数
 非关键工作
 紧后工作:比较自由时差，超过自
 由时差的天数就是影响天数
 
 1. 在双代号或单代号网络计划中，判别关键工作的条 件是该工作( )。
 A. 自由时差最小
 B. 与其紧后工作的时间间隔为零
 C. 持续时间最长
 D. 最迟开始时间与最早开始时间的差值最小
 【答案】D
 2. 关于双代号网络计划的说法正确的有( )。 A.可能没有关键线路
 B.至少一条关键线路 C.当计划工期等于计算工期时，关键工作为总时
 差为零的工作 D.在网络计划执行过程中，关键线路不能转移 E.由关键节点组成的线路就是关键线路
 【答案】BC
 3. 在工程项目网络计划中，关键线路是指( )。 A.单代号网络计划中总时差为零的线路 B.双代号网络计划中总的持续时间最长的线路 C.单代号网络计划中总时差为零且工作时间间隔
 为零的线路 D.双代号时标网络计划中无波形线的线路 E.双代号网络计划中无虚箭线的线路
 【答案】BD
 4. 当计算工期不能满足要求工期时，需要压缩关键工作的持续 时间以满足工期要求。在选择缩短持续时间关键工作时宜考虑 ( )。
 A.缩短持续时间对质量影响不大的工作 B.缩短持续时间所需增加的费用最少的工作 C.有充足备用资源的工作 D.便于修改网络计划的工作 E.缩短持续时间对安全影响不大的工作
 【答案】ABCE
 */
#pragma mark 1Z203035 进度计划调整的方法

/*
 
 一、进度计划的检查 ——检查内容
 (1)关键工作进度; (2)非关键工作时差; (3)实际进度对逻辑关系的影响; (4)资源状况;
 (5)成本状况。
 二、进度计划的调整 1.调整内容
 (1)调整关键线路的长度; (2)调整非关键工作时差; (3)增、减工作项目; (4)调整逻辑关系; (5)调整持续时间; (6)调整资源投入。
 2.调整方法 (1)调整关键线路长度
 1)拖后，选资源强度小或费用低的工作缩短持续时间。
 2)提前，若不拟提前，选资源占用量大或直接费用高 的关键工作，适当延长持续时间。
 (2)调整非关键工作时差——在其时差范围内进行 1)在最早开始与最迟完成时间范围内移动; 2)延长工作持续时间; 3)缩短工作持续时间。
 (3)增、减工作项目
 1)只对局部逻辑关系进行调整;
 2)重新计算，保证工期不变。
 (4)调整逻辑关系
 只有要求改变施工方法或组织方法时才进行。
 (5)调整工作持续时间
 原持续时间估计有误或实现条件不充分。
 (6)调整资源投入
 资源供应异常，优化、应急，使其对工程影响最小。
 网络计划的调整，可定期，也可在必要时进行。
 1. 当工程施工的实际进度与计划进度不符时，需要对网络计 划作出调整，调整的内容有( )。
 A.调整关键线路的长度 B.调整非关键工作时差 C.调整组织结构 D.增减工作项目 E.调整资源的投入
 【答案】ABDE
 2. 关于进度计划调整的说法，正确的是( )。 A.网络计划中某项工作进度超前，不需要进行计划的调整 B.非关键线路上的工作不需进行调整 C.当某项工作实际进度拖延的时间超过其总时差时，只需
 考虑总工期的限制条件 D.根据计划检查的结果在必要时进行计划的调整
 【答案】D

 
 */
#pragma mark - ****************************************************************** 1Z204000 项目质量控制 25
/*
 */
#pragma mark ******************************** 1Z204010 建设工程项目质量控制的内涵

/*
 */
#pragma mark 1Z204011 项目质量控制的目标、任务与责任

/*
 
 
 
 一、相关概念 1.质量——一组固有特性满足要求的程度。 包括:产品质量、工作质量，运行质量。 质量特性主要体现在安全、适用、耐久、
 可靠、经济、协调性等六个方面。
 
 2.质量管理——建立和确定方针、目标及职责，通过 策划、控制、保证和改进等手段实现管理职能。
 3.质量控制——在明确的质量目标和条件下，通过计 划、实施、检查和监督，进行质量目标的控制。
 质量控制是质量管理的一部分，是致力于满足质量要 求的一系列活动，包括:(1)设定目标;(2)测量结 果;(3)评价;(4)纠偏。
 质量要求由业主提出。项目实施过程中，各方应致力
 于实现业主要求的质量总目标的一系列活动。
 
 二、项目质量控制的目标与任务
 目标:满足建设单位需要并符合法、规、标要求。
 任务:对各方质量行为和工程实体质量进行控制。
 施工质量控制是项目质量控制的重点。
 三、项目质量控制的责任和义务
 1. 建设单位——第2、4、5、8、10、11条 2. 勘察设计单位——第2、5条
 3. 施工单位——第3、6、7条
 4. 监理单位——第4、5条
 
 建筑工程五方责任主体项目负责人:建设、勘察、设计
 单位项目负责人，施工单位项目经理、监理单位总监。
 符合下列情形之一的，追究项目负责人质量终身责任: (1)发生质量事故;
 (2)发生严重质量问题; (3)设计使用年限内不能正常使用。
 质量终身责任实行书面承诺和竣工后永久性标牌制度。
 
 1. 根据质量管理体系标准，质量管理就是确定和建立质量方 针、质量目标及职责，并在质量管理体系中通过( )等手段 来实施和实现全部质量管理职能的所有活动。
 A.质量规划、质量控制、质量检查和质量改进
 B.质量策划、质量控制、质量保证和质量改进   C.质量策划、质量检查、质量监督和质量审核   D.质量规划、质量检查、质量审核和质量改进 【答案】B
 2. 根据《质量管理体系基础和术语》，有关质量管理和 质量控制的说法，正确的是( )。
 A.质量管理是质量控制的一部分，致力于满足质量 要求的一系列相关活动
 B.项目参与各方应致力于实现施工单位要求的质量 总目标的一系列活动
 C.项目质量控制的任务是对各方质量行为和工程实 体质量进行控制
 D.质量管理包括设定目标、测量结果等一系列活动
 【答案】C
 3. 施工单位应该加强施工质量的控制，下列( ) 不属于追究项目经理质量终身责任的情形。
 A.施工过程中发生工程质量事故 B.建筑物设计使用年限内无法正常使用 C.使用过程中发现严重质量问题 D.处单位罚款数额5%-10%的罚款
 【答案】D
 */
#pragma mark 1Z204012 项目质量的形成过程和影响因素分析

/*
 
 一、项目质量的基本特性
 反映:使用功能、安全可靠、文化艺术、工程环境
 二、项目质量的形成过程 1.需求识别——在决策阶段，业主需求、法律法规
 要求是决定质量目标的主要依据。 2.目标定义——主要在设计阶段，也涉及施工阶段 3.目标实现——主要在施工阶段，包括施工准备和
 作业技术活动。
 业主方，担负着整个工程项目质量总目标的策划、
 决策和实施的监控任务。
 
 三、项目质量的影响因素 1.人的因素——起决定性作用。 2.机械的因素
 工程设备:组成工程实体，工程完工后拿不走的。如
 电梯、泵机，通风空调、消防、环保设备等。
 施工机械和各类工器具统称施工机械设备，指工程完
 工后拿走了的。如运输、吊装、工具、仪器、设施等。
 3.材料的因素——材料质量是工程质量的基础。 4.方法的因素——也称技术因素。如多项新技术，BIM。
 
 5.环境的因素 (1)自然环境:地质、水文、气象、地下、不可抗力。 (2)社会环境:......程度、力度、理念、水准、高低、
 状况。 (3)管理环境:质量管理体系、质量管理制度和各单位
 之间的协调。 (4)作业环境:能源介质、照明、通风、防护、给排水、
 交通、道路。
 4. “建设工程项目法人决策的理性化程度以及建筑 企业经营者的经营管理理念”属于影响建设工程质 量的( )。
 A. 管理环境因素  B. 人的因素
 C. 方法的因素   D. 社会环境因素
 【答案】D
 5. 下列影响建设工程项目质量的环境因素中，属于 作业环境因素的有( )。
 A.照明方式 B.执法力度 C.风力等级 D.验收程序 E.围挡设施
 【答案】AE
 */
#pragma mark 1Z204013 项目质量风险分析和控制

/*
 
 一、质量风险识别 1.从风险产生的原因分:
 (1)自然风险:自然条件、自然灾害。
 (2)技术风险:技术水平局限，技术掌握、应用不当 (如新结构、技术、工艺、材料应用风险更大)。
 (3)管理风险:管理体系、制度、能力，责任心，组 织，流程，分工、职能划分。
 (4)环境风险:社会环境(腐败和违法)、工作环境 (现场的五大污染)。
 
 2.风险识别的方法 识别分三步:
 (1)采用层次分析法画质量风险结构层次图; (2)分析每种风险的促发因素; (3)将风险识别的结果汇总成为质量风险识别报告。
 质量风险识别报告的内容:风险编号、风险种类、
 风险促发因素、可能发生的风险事故的简单描述以及
 风险承担的责任方。
 
 二、质量风险评估
 分析概率、损失量、风险量、风险等级。
 质量风险评估表的内容:编号、风险种类、风险因
 素、风险事件描述、发生概率、损失量、风险等级、备注。
 三、质量风险响应
 包括制定对策和编制风险管理计划。
 1.对策
 规避:避免更大的风险。依法招投标，慎选单位;
 正确选址，避开灾害;选用成熟可靠的方案;合理安排工
 期进度。
 
 减轻:制定对策，把风险降到最低。制定预案，落实质量
 保证措施。
 转移:分包、担保、保险。
 自留:自我承担，分为无计划自留和有计划自留(设立风
 险基金、预留不可预见费)。
 2.质量风险管理计划表
 内容:编号、风险事件、风险等级、响应策略、主要监控
 措施、责任部门、责任人、备注。
 四、质量风险控制
 监控、预测、预警。
 
 6. 下列项目质量风险中，属于管理风险的是(  )。 A.项目实施人员对工程技术的应用不当 B.社会上的腐败现象和违法现象 C.采用不够成熟的新结构，新技术，新工艺 D.工程质量责任单位的质量管理体系存在缺陷
 【答案】D
 7. 下列( )不属于风险识别的步骤。 A.采用层次分析法画出质量风险结构层次图 B.分析每种风险的促发因素 C.将风险识别的结果汇总成为质量风险识别报告 D.制定质量风险管理计划
 【答案】D
 8. 某投标人在招标工程开标后发现自己由于报价失误，比正 常报价少报18%，虽然被确定为中标人，但拒绝与业主签订 施工合同。该投标人所采用的风险对策是(  )。
 A.风险减轻 B.风险自留
 C.风险规避 D.风险转移
 【答案】C
 9. 关于风险对策的说法，正确的有( )。
 A. 编制质量事故应急预案是生产者风险规避策略
 B. 招标人要求中标人提交履约担保是招标人合同风险减
 轻策略
 C. 承包商设立质量缺陷风险基金是承包商的质量风险自 留策略
 D. 承包商合理安排施工工期，进度计划，避开可能发生 的自然灾害是承包商质量风险规避策略
 E. 依法组成联合体承接大型工程项目是承包商的风险转 移策略
 【答案】CDE
 */
#pragma mark ******************************** 1Z204020 建设工程项目质量控制体系

/*
 
 */
#pragma mark 1Z204021 全面质量管理思想和方法的应用

/*
 
 一、全面质量管理(TQC)的思想 1.全面质量管理
 指项目参与各方进行质量管理的总称，包括工程(产
 品)质量和工作质量的全面管理。
 2.全过程质量管理——强调 “过程方法”原则。 3.全员参与质量管理——每个部门，每个工作岗位。
 二、质量管理的PDCA循环
 1.计划 P
 确定质量目标，制定行动方案。
 2.实施 D
 行动方案部署交底，作业技术活动。
 3.检查 C
 是否执行了行动方案，实际条件是否发生了变化， 不执行的原因，执行的结果。
 4.处置 A
 纠偏和预防改进。
 1.根据全面质量管理的思想，工程项目的全面质量管理是 指对(  )的全面管理。
 A.工程质量形成过程 B.工程建设各参与方 C.工程质量和工作质量 D.工程建设所需的材料、设备
 【答案】C 【拓展】三全?
 2.建设工程项目质量管理的PDCA循环中，质量计划阶段的 主要任务是(  )。
 A.明确质量目标并制定实现目标的行动方案 B.展开工程项目的施工作业技术活动 C.对计划实施过程进行科学管理 D.对质量问题进行原因分析，采取措施予以纠正
 【答案】A
 */
#pragma mark 1Z204022 项目质量控制体系的建立和运行

/*
 
 一、性质、特点和构成
 (一)性质
 1.以项目为对象，由总组织者负责建立;
 2.是项目管理组织的一个目标控制体系(仅 是其中一个);
 3. 一次性。
 
 (二)特点(与企业质量管理体系对比) 排除法解题
 1.目的不同——只用于特定的项目质量控制 2.范围不同——涉及项目所有质量责任主体 3.目标不同——是项目的质量目标 4.时效不同——一次性 5.方式不同——由总组织者自我评价诊断，
 不需第三方认证
 
 (三)结构
 1.多层次结构 第一层次，建设单位、代建方、受托方、项目总包的
 项目管理机构
 第二层次，设计总负责、施工总承包
 第三层次，承担设计、施工、供货的各承包单位
 2.多单元结构
 第二层次及以下的质量保证体系可能有多个(即总包、
 分包可能有多个单位)。
 二、项目质量控制体系的建立
 (二)建立的程序
 1.确立网络——明确各层面质量控制负责人。 2.制定制度——例会制、协调制等，形成管理文件或手册。 3.分析界面
 静态界面:法律法规、合同、组织分工。
 动态界面:各单位之间的衔接配合。 4.编制计划——总组织者编总的，各责任主体编各自的。
 (三)建立的责任主体
 由建设单位或项目总包的项目管理机构负责建立。 区别于P181 施工质量计划由施工单位编制。
 三、项目质量控制体系的运行 1.运行环境
 项目的合同结构;质量管理的资源配置、组织制度。
 2.运行机制——内在动力 (1)动力机制——核心机制，竞争机制、利益机制 (2)约束机制——内部自我约束、外部监控 (3)反馈机制——信息反馈 (4)持续改进机制——PDCA循环原理
 
 3. 在大型群体工程项目中，第一层次质量控制体系可由( ) 的项目管理机构负责建立。
 A.建设单位   B.设计总责任单位
 C.代建单位   D.施工总承包单位
 E.工程总承包企业
 【答案】ACE
 4. 建立项目质量控制体系时，首先开展的工作是( )。   A.分析质量控制界面
 B.编制质量控制计划   C.制定质量控制制度   D.确立系统质量控制网络
 【答案】D
 5. 建设工程项目质量控制系统运行的约束机制，取决于 (  )。
 A.各质量责任主体对利益的追求 B.质量信息反馈的及时性和准确性 C.各主体内部的自我约束能力 D.外部的监控效力 E.工程项目管理文化建设的程度
 【答案】CD
 6. 建设工程项目质量控制系统运行机制的核心是( )。 A.约束机制 B.激励机制
 C.反馈机制 D.动力机制
 【答案】D
 */
#pragma mark 1Z204023 施工企业质量管理体系的建立和认证

/*
 
 一、质量管理八项原则
 1. 以顾客为关注焦点
 2. 领导作用
 3. 全员参与
 4. 过程方法:作为过程
 5. 系统方法:作为系统
 6. 持续改进:永恒目标
 7. 基于事实的决策方法:数据、信息 8. 与供方互利的关系
 
 二、企业质量管理体系文件构成 1.质量方针和质量目标
 反映用户、社会对质量的要求及企业的承诺。
 2.质量手册——纲领性文件 对企业质量体系作系统、完整和概要的描述。 内容包括:企业的质量方针、质量目标;组织机构
 及质量职责;体系要素或基本控制程序;质量手册的评
 审、修改和控制的管理办法。
 
 3.程序性文件——支持性文件、细则 各项管理标准、规章制度都属于程序性文件。 一般有以下六个方面的通用性管理程序:
 (1)文件控制程序; (2)质量记录管理程序; (3)内部审核程序; (4)不合格品控制程序; (5)纠正措施控制程序;(6)预防措施控制程序。
 4.质量记录
 质量活动进行及结果的客观反映。
 
 三、企业质量管理体系的运行
 (4)落实企业质量体系内审程序的目的:P176 1)评价执行情况; 2)揭露问题，为改进提供依据; 3)检查质量体系运行信息;4)向外审单位提供证据。
 四、企业质量管理体系的认证与监督 1.认证机构:公正的第三方 2.维持与监督管理 有效期3年
 企业通报、监督检查、认证注销、..、复评、重新换证。 (4)认证暂停:体系不符合要求的警告措施; (5)认证撤销:企业可申诉，一年后可重新认证;
 
 7. 根据《质量管理体系基础和术语》GB/T I9000--2008， 属于质量管理的八项原则的有( )。
 A.以顾客为关注焦点 B.持续改进 C.全过程控制 D.全员参与 E.过程方法
 【答案】ABDE
 8. 质量管理体系文件由(  )构成。 A.质量方针和质量目标 B.质量记录 C.质量报告 D.质量手册 E.程序性文件
 【答案】ABDE
 9. 质量手册是规定企业组织建立质量管理的文件，对企业 质量体系作系统、完整和概要的描述。它的基本内容一般 应包括( )。
 A.企业的质量方针和质量目标 B.管理标准和规章制度 C.体系要素或基本控制程序 D.文件控制程序 E.质量手册的评审、修改和控制的管理方法
 【答案】ACE
 10. 某企业通过质量管理体系认证后，由于管理不善，经 认证机构调查做出了撤销认证的决定，则该企业( )。
 A. 不能提出申诉，不能在重新提出认证申请
 B. 不能提成申诉，但在一年后可以重新提出认证申请 C. 可以提出申诉，并在一年后可重新提出认证申请 D. 可以提出申诉，并在半年后可重新提出认证申请
 【答案】C
 */
#pragma mark  ******************************** 1Z204030 建设工程项目施工质量控制

/*

 */
#pragma mark 1Z204031 施工质量控制的依据与基本环节

/*
 
 一、施工质量的基本要求
 最基本要求:实体质量验收合格。
 验收合格的规定:
 (1)符合勘察、设计文件的要求:
 (2)符合标准和相关专业验收规范的规定。 规定(1)按图施工;规定(2)依法施工;另，践约施工。
 
 二、施工质量控制的基本环节 1.事前——施工前，编计划，明目标，定方案，设管理点，
 落实责任，分析影响因素，制定预防措施。
 2.事中——包括自控(自己活动行为的约束)和监控(活动过程 和结果的监督检查)。自控、监控主体分别是?P192、P193
 目标:确保工序质量合格。
 关键:坚持质量标准。
 重点:对工序质量、工作质量和质量控制点的控制。
 3.事后——结果评价、认定，纠偏，整改，处理。
 1. 建设工程施工质量的事后控制是指(  )。 A.质量活动结果的评价和认定 B.质量活动的检查和监控 C.质量活动的行为约束
 D.质量偏差的纠正
 E.落实质量责任
 【答案】AD
 */
#pragma mark 1Z204032 施工质量计划的内容与编制方法

/*
  一、施工质量计划的形式和内容
 包含在企业质量管理体系中，以施工项目为对象。
 1.形式
 (1)施工质量计划; (2)施工组织设计(含施工质量计划); (3)管理实施规划(含施工质量计划)。
 
 2.基本内容
 (1)工程特点施工条件分析; (2)质量总、分目标; (3)质量管理组织机构和职责，人员及资源配置; (4)技术方案和施工组织方案; (5)材料、设备等的质量管理及控制措施; (6)施工质量检验的安排、方法、标准; (7)施工质量控制点及其跟踪控制的方式与要求; (8)质量记录的要求。
 
 2.下列质量管理的内容中，属于施工质量计划基本内容 的是(  )。
 A.项目部的组织机构设置 B.质量控制点的控制要求 C.质量手册的编制 D.施工质量体系的认证
 【答案】B
 二、施工质量计划的编制与审批
 1.编制主体
 由自控主体即施工承包企业编制。
 平行发包，各单位分别编制;
 总分包模式，总编总，分编分，作为总的一部分。
 总对分指导和审核，并承担连带责任。
 2.施工质量计划的审批 (1)企业内部审批
 由项目经理部主持编制，报企业组织管理层批准。
 (2)项目监理机构审查
 施工单位开工前填写《施工组织设计报审表》，报送
 监理机构审查;符合要求，总监签认报建设单位;需要调
 整，重新审查。
 
 3.关于施工质量计划的说法，正确的是( )。 A.施工质量计划是以施工项目为对象由建设
 单位编制的计划 B.施工质量计划应包括施工组织方案 C.施工质量计划一经审核批准不得修改 D.施工总承包单位不对分包单位的施工质量
 计划进行审核
 【答案】B
 三、施工质量控制点的设置与管理 1.质量控制点的设置
 技术要求高、施工难度大、质量影响大、
 发生质量问题危害大。
 (1)关键、隐蔽; (2)薄弱、不稳定; (3)较大影响; (4)新技术、新工艺、新材料; (5)难;
 (6)不良。
 2.质量控制点的重点控制对象 (1)人的行为(生理、心理、技术能力) (2)材料的质量与性能(高强螺栓、焊条、水泥) (3)施工方法与关键操作(预应力张拉、大模滑模升
 板法施工)
 (4)施工技术参数(...量、比、度、等级) (5)技术间歇(砌筑与抹灰、混凝土浇筑与模板拆除) (6)施工顺序(先焊后拉) (7)质量通病(研究对策，制定预防措施)
 3.质量控制点的管理
 首先，事前预控;其次，交底;
 还要，动态设置、动态跟踪管理。
 专项施工方案或作业指导书，经施工单位技术负责人、
 项目总监、建设单位项目负责人签字。超过一定规模的危险
 性较大的分部分项工程，还要组织专家论证。
 质量控制点，分为“见证点”和“待检点” 。 见证点:重要部位、特种作业、专门工艺;24h 待检点:隐蔽工程。
 4. 工程施工质量控制点应选择技术要求高、对工程质量影响 大或是发生质量问题时危害大或(  )的对象进行设置。
 A.劳动强度大 B.施工难度大
 C.施工技术先进 D.施工管理要求高
 【答案】B
 5. 质量控制点的选择原则通常包括( )。 A. 施工中的薄弱环节
 B. 对下道工序有较大影响的上道工序 C. 施工投入资源大的工序和部位
 D. 施工无把握、施工条件困难的工序
 E. 采用新技术或者新员工的部位或环节
 【答案】ABD
 6. 下列质量控制点的重点控制对象中，属于施工技术 间歇的是( )。
 A.水泥的安定性 B.砌体的砂浆饱满度 C.预应力钢筋的张拉 D.混凝土浇筑后的拆模时间
 【答案】D
 */
#pragma mark 1Z204033 施工生产要素的质量控制

/*
 
 1.技术方案:施工工艺、施工方法; 组织方案:区段划分、施工流向、劳动组织。
 2.施工机械设备，应从设备选型、性能参数、操作要求 等方面加以控制。
 3.模具、脚手架等施工设备，需按设计、施工要求进行 专项设计。
 4.危险性较大的起重机械设备，安装方案要审批，使用 前经专业管理部门验收。
 5.施工环境因素控制，采取预测预防的风险控制方法。
 
 7.下列影响施工质量的生产要素中，只能通过采取预测预防 的控制方法以消除其对施工质量不利影响的是(  )。
 A.环境因素 B.施工人员
 C.材料设备 D.施工机械
 【答案】A
 */
#pragma mark 1Z204034 施工准备的质量控制

/*
 
 一、施工技术准备的质量控制
 施工前，室内进行。如:熟悉图纸、设计交底、图
 纸会审、项目划分、细化方案、编制作业指导书、绘制
 各种详图(大样配筋配板配线图)、技术交底、技术培
 训。完善控制措施，明确控制对象和方法。
 二、现场施工准备的质量控制 1.计量控制——按规定对计量器具进行维修和校验，
 统一计量单位，组织量值传递，保证量值统一。
 
 2.测量控制——测量控制方案，由项目技术负责人批准。测 量控制点，建设单位提供、施工单位复核、监理审核。
 3.平面图控制
 三、工程质量检查验收的项目划分
 工程质量验收划分为单位、分部、分项和检验批。
 划分原则:
 单位工程——独立使用功能 分部工程——专业性质、工程部位 分项工程——工种、材料、工艺、设备
 检验批 ——工程量、楼层、施工段、变形缝。
 
 8. 施工准备的质量控制工作中，属于技术准备质量控制 工作内容有( )。
 A.做好设计交底和图纸会审 B.进行工程项目划分和编号 C.编制施工作业技术指导书 D.做好工程定位和标高基准的控制工作 E.绘制各种施工详图
 【答案】ABCE
 
 */
#pragma mark 1Z204035 施工过程的质量控制

/*
 
 施工过程质量控制，属于事中质量控制。
 一、工序施工质量控制
 对施工过程的质量控制，必须以工序质量控制为基础
 和核心，工序质量控制是施工质量控制的重点。
 包括:
 1.工序施工条件控制——生产要素、生产环境 2.工序施工效果控制——质量特征、特性指标 工序施工效果控制，属于事后质量控制。
 
 下列工序质量必须现场检测，合格后才能进行下道工
 序:(依据“事后”判断，注意数据)
 (1)地基基础工程:地基承载力，桩的承载力，桩身 完整性
 (2)主体结构工程:混凝土、砂浆、砌体强度，钢筋 保护层厚度，构件结构性能
 (3)建筑幕墙工程:硅酮结构胶相容性 (4)钢结构及管道工程:钢结构力学性能
 
 二、施工作业质量自控
 1.自控主体:施工单位; 2.自控程序:作业技术交底(是最基层的技术管理
 交底活动)、作业活动实施、作业质量三检(自检、互
 检、专检);
 三、施工作业质量监控 1.监控主体:建设、监理、设计、质监单位
 
 2.现场质量检查的内容
 1 开工前检查——开工条件;
 2 工序交接检查——自检、互检、专检;
 3 隐蔽工程检查;
 4 停工后复工检查;
 5 分项、分部工程完工检查; 6 成品保护检查。
 3.现场质量检查的方法 (1)目测法 —— 看、摸、敲、照 (2)实测法 ——
 靠:直尺、塞尺检查平整度;
 量:测量工具、计量仪表检查偏差，坍落
 度;
 吊:垂吊线检查垂直度;
 套:方尺套方，阴阳角、踢脚线、对角线
 (3)试验法 ——
 
 理 化 试 验
 物理力学 性能检验
 力学指标测定，如抗拉、抗压、抗弯、
 抗折、冲击韧性、硬度、承载力等。
 物理性能测定，如密度、含水量、凝结
 时间、安定性、抗渗、耐磨、耐热性等。
 化学成分 及性质测 定
 如钢筋中的磷、硫含量，混凝土中粗骨
 料中的活性氧化硅成分，以及耐酸、耐碱、
 抗腐蚀性等。
 现场试验
 静载试验、通水试验、耐压试验、蓄水
 淋水试验。
 无 损检 测
 表面探测内部结构或损伤情况。超声波、X射线、γ射 线探伤。
 
 4.技术核定、隐蔽工程验收及成品保护 (1)技术核定
 施工方以技术核定单的方式向监理提出，报送设计
 单位确认。
 (2)隐蔽工程验收程序
 施工方自检合格，填写《隐蔽工程验收单》，事先 通知监理及有关方;按约定时间验收，验收合格，各方 共同签署验收记录;验收不合格，整改、重新验收。 (3)成品保护
 防护、覆盖、封闭、包裹。
 9. 关于施工过程的作业质量控制的说法，正确的是( )。 A.工序施工效果的控制属于事前质量控制 B.在施工阶段，施工方和监理方都是质量自控主体 C.工序施工质量控制主要包括工序施工效果控制和纠正
 质量偏差 D.工序质量控制包括作业者的自我控制和作业者外部的
 检查、监督
 【答案】D
 10. 关于钢筋保护层厚度检测的说法，正确的是( )。   A.检测机构部位由监理确定
 B.梁类应抽取构件数量的2%且不少于5个构件   C.板类构件应抽取构件数量5%且不少于2个构件
 D.必须采用无损检测方法
 【答案】B
 11.关于主体结构工程现场质量检测的说法，正确的是( )。 A.砌体工程中，普通砖5万块、多孔砖10万块各为一
 检验批，抽检数量为1组 B.按照统计方法评定混凝土强度时，同一强度等级试
 件的留置数量不宜少于10组，按非统计方法评定时，留置 数量不宜少于3组
 C.对梁板类构件，应抽取构件数量的1%且不少于5个 构件进行钢筋保护层厚度检测
 D.混凝土预制构件结构性能检测应按同一工艺生产的 不超过100件且不超过3个月的同类产品为一检验批 【答案】B
 12. 下列施工过程的质量控制中，属于工序施工效果控 制的有( )。
 A.钢材力学性能检测 B.钢筋保护层厚度检测 C.幕墙工程硅酮结构相容性检测 D.水泥物理力学性能检测 E.砌体强度现场检测
 【答案】BCE
 13.现场质量检查包括工序交接检查，应严格执行( ) 制度。
 A.自检自查 B.巡视检查 C.互检互查 D.平行检查 E.专职管理人员的质量检查
 【答案】ACE 【拓展】安全三检:自检、互检、交接检
 14.对装饰工程的水磨石、面砖、石材饰面等现场检查时， 均应进行敲击检查其铺设质量。该方法属于现场质量检查方 法中的(  )。
 A.实测法 B.目测法
 C.记录法 D.试验法
 【答案】 B
 15.下列现场质量检查方法中，属于无损检测方法是( )。 A.托线板挂锤吊线检查
 B.超声波探伤检查
 C.铁锤敲击检查
 D.留置试块试验检查
 【答案】B
 */
#pragma mark 1Z204036 施工质量与设计质量的协调

/*
 
 一、项目设计质量的控制
 以使用功能、安全可靠性为核心。
 二、施工与设计的协调 1.设计联络 2.设计交底和图纸会审
 (1)设计交底:1理解设计意图;2了解设计内容 和技术要求;3明确质量控制重点难点。
 (2)图纸会审:1解决各专业设计之间的矛盾; 2消除施工图的差错。
 3.设计现场服务和技术核定
 4.设计变更
 16. 建设单位和监理单位组织设计单位向所有的施工单位 进行详细的设计交底，其主要目的有( )。
 A. 深入发现和解决各专业设计之间可能存在的矛盾 B. 充分理解设计意图
 C. 了解设计内容和技术要求
 D. 消除施工图的差错，解决施工的可行性问题
 E. 明确质量控制的重点与难点
 【答案】 BCE
 */
#pragma mark  ******************************** 1Z204040 建设工程项目质量验收

/*

 */
#pragma mark 1Z204041 施工过程的质量验收

/*
 
 一、施工过程的质量验收(检验批、分项、分部) 1.检验批合格规定:(最小单位)
 (1)主控项目合格; (2)一般项目合格; (3)完整记录。
 2.分项工程合格规定:
 (1)检验批合格; (2)记录完整。
 3.分部工程合格规定:
 (1)分项工程合格;
 (2)资料完整; (3)安全、节能、环保和主要使用功能符合规定; (4)观感质量符合要求。(不给“合格、不合格”)
 分别由谁组织验收?
 检验批 ——由专业监组织验收。 分项工程——由专业监组织验收。 分部工程——由总监组织验收。
 二、施工过程质量验收不合格的处理
 1.严重缺陷推倒重做，一般缺陷返修更换，重新验收; 2.检测单位鉴定达到设计要求，予以验收; 3.原设计单位核算满足安全和使用，予以验收; 4.加固处理，按技术处理方案和协商文件验收;
 
 1. 建设工程施工质量验收中，检验批质量验收的内容 包括(  )。
 A.质量资料 B.主控项目 C.一般项目 D.允许偏差项目 E.观感项目
 【答案】 BC
 2. 根据《建筑法工程施工质量验收统一标准》，单位 工程质量验收合格的规定有( )。
 A.所含分部工程的质量均应验收合格 B.质量控制资料应完整 C.主控项目抽检全部符合有关专业工程验收规范
 的规定 D.主要使用功能的抽查结果应符合相关专业质量
 验收规范的规定 E.一般项目抽检合格
 【答案】ABD
 3. 如工程质量不符合要求，经过返修或加固处理的工程， 虽然局部尺寸等不符合设计要求，但仍然能满足使用要求， ( )。
 A.应予以验收
 B.严禁验收
 C.返工重新验收 D.按技术处理方案和协商文件进行验收
 【答案】D
 */
#pragma mark 1Z204042 竣工质量验收

/*
 
 一、验收依据
 (1)法律法规、条例、办法; (2)工程施工质量验收统一标准; (3)专业工程施工质量验收规范; (4)批准的设计文件、施工图纸及说明书; (5)工程施工承包合同;
 二、验收条件
 (2)施工单位自检合格，提出竣工报告; (3)监理单位提出质量评估报告; (4)勘察、设计单位提出质量检查报告; (8)施工单位签署质量保修书。
 三、验收标准——单位工程合格规定
 (1)分部工程合格;
 (2)资料完整; (3)安全、节能、环保和主要使用功能资料完整; (4)主要使用功能符合规定; (5)观感质量符合要求。
 住宅工程要分户验收。
 建设单位组织施工、监理等单位，对每户及公共部
 位的观感质量和使用功能进行检查验收。
 验收完毕，填写《住宅工程质量分户验收表》;建
 设、施工单位项目负责人，监理单位总监分别签字。
 《住宅工程质量分户验收表》作为《住宅质量保证书》
 的附件，一同交给住户。
 分户验收不合格，不能进行整体竣工验收。
 四、验收程序和组织
 总监组织竣工预验收。
 验收程序:
 (1)施工单位提交工程竣工报告(须总监签署意 见)，申请竣工验收。
 (2)建设单位组成验收组，制定验收方案。
 (3)建设单位在竣工验收7 个工作日前将验收的时 间、地点以及验收组名单书面通知质监机构。
 (4)建设单位组织竣工验收。 不能形成一致意见时，协商，待意见一致后，重新
 组织工程竣工验收。
 
 五、竣工验收报告
 验收合格后，建设单位提出竣工验收报告。
 竣工验收报告的内容:工程概况;建设单位执行
 基本程序情况;对勘察、设计、施工、监理的评价;
 验收时间、程序、内容、组织形式;竣工验收意见。
 还应附文件:施工许可证;设计文件审查意见;
 竣工报告;质量评估报告;质量检查报告;质量保修
 书;竣工验收意见。
 
 六、验收备案
 建设单位应当自竣工验收合格之日起15日内备案。
 备案应提交的文件: (1)竣工验收备案表; (2)竣工验收报告; (3)规划、环保部门的认可文件; (4)消防部门的合格证明文件; (5)质量保修书。
 
 4. 工程项目竣工验收的依据有( )。 A.工程施工组织设计或施工质量计划 B.工程施工承包合同 C.批准的设计文件及施工图纸 D.质量检测功能性试验报告 E.施工质量验收规范
 【答案】BCE
 5. 下列有关工程施工质量验收的说法错误的是( )。 A.进行观感质量验收时，检查结果分为“合格”、
 “不合格”、“优良” B.检验批质量合格的条件有:有完整记录、主控项
 目均应合格、一般项目检验合格 C.分项工程验收需进行观感质量的验收 D.非所有的单位工程都要进行观感质量的验收 E.预验收由建设单位组织相关单位参加
 【答案】ACDE
 6. 施工项目竣工质量验收需满足一定的条件，其中， 质量检查报告应由( )负责提出。
 A.施工单位 B.监理单位
 C.勘察、设计单位 D.建设单位
 【答案】C
 7. 建设单位应在工程竣工验收前( )个工作日前，将 验收时间、地点、验收组名单书面通知该工程的工程质 量监督机构。
 A. 7 B. 3 C. 14 D. 15
 【答案】A
 8. 施工项目竣工质量验收时，若参与验收的建设、勘 察、设计、施工、监理等各方不能形成一致意见时，正 确的做法是( )。
 A.协商提出解决方法，待意见一致后作出验收结论
 B.协商提出解决方法，待意见一致后重新组织工程 竣工验收
 C.由建设单位作出验收结论
 D.由监理单位作出验收结论
 【答案】B
 9. 工程竣工验收合格后，建设单位应及时提出竣工 验收报告，以下哪些属于竣工验收报告的内容和所 附文件( )。
 A. 建设单位执行基本建设程序情况
 B. 竣工验收时间、程序、内容和组织形式 C. 规划、环保部门出具的认可文件
 D. 质量评估报告、质量保修书 E.公安消防部门出具的工程验收合格证明
 【答案】ABD
 */
#pragma mark ******************************** 1Z204050 施工质量不合格的处理

/*
 
 */
#pragma mark 1Z204051 工程质量问题和质量事故的分类

/*
 
 二、工程质量事故的分类
 1.按损失程度分级 (313\151\151，往严重的靠)
 事故 等级
 伤亡人数(人)
 直接经济损失 (万元)
 死亡(或)
 重伤(或)
 特大
 R≥30
 R≥100
 M≥10000
 重大
 10≤R< 30
 50≤R< 100
 5000≤M<10000
 较大
 3≤R<10
 10≤R<50
 1000≤M<5000
 一般
 R<3
 R<10
 M<1000
 
 按事
 故的 责任 分类
 指导 责任事 故
 指导或领导失误。如，不按规范指导施
 工，强令他人违章作业，片面追求施工
 进度，降低施工质量标准等。
 操作 责任事 故
 操作者不按规程和标准实施操作。如，
 浇筑混凝土随意加水，或振捣疏漏等。
 自然 灾害事 故
 不可抗力。如地震、台风、暴雨、雷电
 及洪水。
 */
#pragma mark  1Z204052 施工质量事故的预防

/*

 一、施工质量事故发生的原因   1.技术原因:勘察、设计、施工在技术上的失误。   2.管理原因:管理不完善。如，体系不完善，措施 不力，制度不严，控制不严，检验不严，检测仪器管理 不善失准等。   3.社会、经济原因:社会上的不正之风，七无三边， 盲目追求利润，随意压低标价，偷工减料等。
 4.人为事故和自然灾害原因:人为，不可抗力。
 1.下列施工质量事故发生的原因中，不属于管理原因 的是( )。
 A.施工单位的检验制度不严密
 B.对水文地质情况判断错误
 C.施工单位的质量控制不严密
 D.施工单位质量管理措施落实不力 【答案】B
 2. 某建设工程发生一起质量事故，经调查分析是由于 边勘察、边设计、边施工导致的，则引起这起事故的 主要原因是(  )。
 A.社会、经济原因 B.技术原因
 C.管理原因 D.人为事故和自然灾害原因
 【答案】A
 3. 下列有关工程质量事故分类的说法正确的是( )。 A.检验制度不严密引起的质量事故属于技术原因
 引发的质量事故 B.某工程质量事故造成人员死亡25人，属于重大
 事故 C.某工程质量事故损失3000万元，属于较大事故 D.操作者不按规程和标准实施操作造成事故，属
 于指导责任事故 E.某工程质量事故造成人员重伤50人，属于重大
 事故
 【答案】BE
 */
#pragma mark 1Z204053 施工质量问题 和质量事故的处理

/*
 
 二、施工质量事故处理程序 (8步)
 若事故不要处理，步骤:
 事故报告、事故调查、原因 分析、事故结论、提交事故处理 报告(5步)
 
 1.事故报告
 事故发生，现场人员立即向建设单位负责 人报告建设单位负责人1小时内上报。
 事故报告的内容:简要的、初步的......
 2.事故调查   事故调查报告的内容:单位概况，事故经 过救援情况，人员伤亡直接经济损失，技术分 析报告，原因性质，责任认定责任者处理建议， 防范整改措施。
 
 3.原因分析
 4.制定处理方案 5.事故处理(技术处理，责任处罚) 6.检查验收
 7.事故结论
 8.提交处理报告
 事故处理报告的内容:原始资料数据，原因
 分析论证，处理依据，处理方案措施，处理过程
 资料，检查验收记录，责任者处罚和事故处理结
 论，等。
 
 4. 工程施工质量事故的处理方法包括:1事故调查;2事故 原因分析;3事故处理;4事故处理鉴定验收;5制定事故 处理方案。正确的程序是(  )。
 A.1→2→5→3→4 B.1→2→3→4→5 C.2→1→3→4→5 D.1→2→5→4→3
 【答案】A
 5. 建设工程施工质量事故处理报告的主要内容 应当包括( )。
 A. 事故发生的简要经过 B. 质量事故的处理依据 C. 检查验收记录
 D. 事故处理的建议方案 E. 事故原因分析和论证
 【答案】BCE
 三、施工质量事故处理的基本方法
 1.修补处理
 蜂窝、麻面、局部损伤、裂缝。 缝窄，表面密封;缝宽，嵌缝密闭;缝深，灌浆修补。
 3.返工处理
 堤坝填筑压实、桥梁预应力张拉、住宅误用水泥、基础
 混凝土强度达不到。
 
 4.限制使用:修补后无法保证使用安全要求，又无法返工。
 5.不作处理
 (1)工业建筑物放线定位偏差，干缩微裂; (2)轻微麻面、楼面平整度偏差; (3)检测单位鉴定合格; (4)原设计单位核算，仍能满足。
 
 6. 某工程的混凝土结构出现较深裂缝，但经分析判 定其不影响结构的安全和使用，正确的处理方法是 ( )。
 A.表面密封   B.嵌缝密封
 C.灌浆修补   D.限制使用
 【答案】C
 7.下列工程质量问题中，可以不做处理的情况有 ( )。
 A.混凝土结构出现宽度不大于0.3mm的裂缝 B.混凝土现浇楼面的平整度偏差达到8mm C.某一处结构构件截面尺寸不足，但进行复核
 验算后能满足设计要求 D.混凝土结构表面出现蜂窝、麻面 E.某基础的混凝土28d强度不到规定的30%
 【答案】BC
 */
#pragma mark ******************************** 1Z204060 数理统计方法在工程质量管理中的应用

/*
 
 */
#pragma mark 1Z204061 分层法的应用

/*
 
 一、基本原理——分门别类 分层调查的统计数据表1Z204061，个体不合格率
 最大的，对质量影响最大。
 二、实际应用
 应用分层法的关键:调查分析的类别和层次划分。
 根据管理需要和统计目的，取得原始数据。
 
 1.由于工程质量形成的影响因素多，所以对工程质量状况 的调查和质量问题的分析必须分门别类地进行，以便准确 地找出问题及其原因。这是( )的基本思想。
 A.因果分析法 B.排列图法 C.分层法 D.直方图法
 【答案】C
 */
#pragma mark 1Z204062 因果分析图法的应用

/*
 
 一、基本原理
 也称质量特性要因分析法。对每个质量特性或问题，
 逐层深入排查，确定最主要原因。
 二、应用注意事项
 (1)一个特性或问题一张图。 (2)采用QC小组，集思广益。 (3)可以邀请小组以外人员参与，广泛听取意见。 (4)层层深入，排出所有可能原因。 (5)采用投票或其他方式，选择1至5项最主要原因。
 2.关于因果分析图法应用的说法，正确的有( )。 A.一张分析图可以解决多个质量问题 B.常采用QC小组活动的方式进行，有利于集思广益 C.因果分析图法专业性很强，QC小组以外的人员不
 能参加 D.通过因果分析图可以了解统计数据的分布特征，
 从而掌握质量能力状态 E.分析时要充分发表意见，层层深入，排出所有可
 能原因
 【答案】BE
 */
#pragma mark  1Z204063 排列图法的应用

/*

 通过抽样检查或检验试验得到关于质量问题、
 偏差、缺陷、不合格、问题原因分析的统计数据，
 进行状况描述。
 特点:直观、主次分明。
 将不合格点频数由大到小排序，计算出累计
 频数和累计频率。
 
 ABC分类管理法:(累计频率)
 0% ~80% ， A类问题，主要问题，重点管理;
 80%~90% ， B类问题，次要问题，次重点管 理;
 90%~100%，C类问题，一般问题，常规管理。
 
 3.在质量管理过程，通过抽样检查或检验试验所得到的 质量问题、偏差、不合格等统计数据，以及造成质量问 题的原因分析统计数据，均可采用( )进行状况描述。   A.分层法     B.因果分析图法
 C.排列图法   D.直方图法 【答案】C
 4.工程质量管理常用数据统计方法中，排列图方法 可用于(  )的数据状况描述。   A.质量偏差   B.质量稳定程度
 C.质量缺陷   D.造成质量问题原因
 E.质量受控情况 【答案】ACD
 5.通过抽样检查或检验试验得到的关于质量问题等 的排列图如图所示，( )主要问题，需要进行 重点管理。
 A.表面平整度、截面尺寸 B.平面水平度
 C.垂直度、标高 D.其他 【答案】A
 
 */
#pragma mark 1Z204064 直方图法的应用

/*
 
 一、主要用途
 1.了解统计数据分布特征(集中、离散)，掌握 质量能力状态。
 2.分析生产过程质量是否处于正常、稳定和受控 状态以及质量水平是否保持在公差允许范围内。
 
 二、直方图的观察分析 1.形状观察分析
 (1)直方图的分布形状及区间宽窄由质量 特性统计数据的平均值和标准偏差决定。
 
 (2)正常直方图呈正态分布，中间高、两边低、 对称。反映质量处于正常、稳定状态。
 (3)异常直方图呈偏态分布，常见的有折齿型、 缓坡型、孤岛型、双峰型、峭壁型。
 
 2.位置观察分析
 (1)将直方图分布位置与质量控制标准的上下限范围 进行比较分析。
 图1Z204064-3 直方图与质量标准上下限
 
 (2)图(a)，正常稳定受控，经济合理; (3)图(b)，偏下限，易出现不合格; (4)图(c)，临界状态，易出现不合格; (5)图(d)，居中，且边界与上下界限有较大距离，
 质量能力偏大，不经济; (6)图(e)(f)，超出上下界限，质量不合格。
 6.在质量管理中，直方图法的主要用途有( )。 A.掌握质量能力状态 B.确定质量问题的主要原因 C.分门别类分析质量问题 D.分析生产过程的状态 E.分析质量水平的范围
 【答案】ADE
 7. 直方图的分布形状及分布区间宽窄，取决于质量特征统计 数据的(  )。
 A.样本数据和分布情况 B.控制标准和分布状态 C.平均值和标准偏差 D.分布位置恶化控制标准上下限
 【答案】C
 8. 在直方图的位置观察分析中，若质量特性数据的分布 居中，边界在质量标准的上下界限内，且有较大距离时， 说明该生产过程( )。
 A.质量能力不足
 B.易出现质量不合格 C.存在质量不合格 D.质量能力偏大
 【答案】D
 */
#pragma mark  ******************************** 1Z204070 建设工程项目质量的政府监督

/*

 */
#pragma mark  1Z204071 政府对工程项目质量的监督职能

/*

 一、政府质量监督的性质与职权
 性质:行政执法行为。对工程实体质量和建设、
 勘察、设计、施工、监理(简称工程质量责任主体)
 及质检单位的质量行为实施监督。
 职权:(1)要求被检查单位提供资料; (2)进入施工现场检查;
 (3)发现问题，责令改正。
 
 二、政府质量监督机构
 质量监督，由建设行政主管部门、建设工程质量
 监督机构具体实施，对工程质量承担监督责任。
 监督人员应当具备的条件:
 (1)监督人员占监督机构总人数的75%以上;
 (2)具有工程类专业大专以上学历或工程类执 业注册资格;
 (3)具有三年以上工程质量管理或设计、施工、 监理等工作经历。
 
 */
#pragma mark 1Z204072 政府对工程项目质量监督的内容

/*
 
 一、质量监督的内容
 1. 执行法律法规、强制性标准情况; 2. 抽查实体质量;
 3. 抽查质量行为;
 4. 抽查材料、构配件质量;
 5. 监督竣工验收; 6. 处理质量事故; 7. 分析质量状况; 8. 处罚违法违规。
 二、质量监督程序 1.受理
 开工前，建设单位申报。
 3.对实体质量和质量行为进行抽查、抽测
 (1)实体质量。检测重点:涉及结构安全和重 要使用功能的项目，如基础和主体。
 (2)质量行为。检查内容:1质量保证体系; 2资质和资格;3建设行政手续;4施工组织设计、 监理规划等文件及审批和执行情况;5执行法律法 规和强制性标准情况;6质量检查记录。
 
 4.监督竣工验收   重点监督:组织形式、程序。 5.形成质量监督报告   基本内容:——1概况4情况1评价1意见
 项目概况;质量行为情况;实体质量情况;问题 整改情况;竣工验收情况;质量评价(包括节能和环 保评价);缺陷处理意见。
 6.建立质量监督档案
 按单位工程建立，经监督机构负责人签字后归档。
 
 1. 政府对建设工程项目质量监督的主要内容包括( )。 A. 监督工程参与各方的质量行为
 B. 监督评定施工企业的资质
 C. 组织工程质量事故的调查处理
 D. 监督检查工程实体的施工质量
 E. 监督审核质量验收标准
 【答案】ACD
 2. 工程质量监督申报手续应在工程项目( 督机构办理。
 A. 开工前，由建设单位 B. 验收前，由建设单位 C. 开工前，由施工单位 D. 验收前，由施工单位
 【答案】A
 )向工程质量监
 3. 施工过程中工程质量监督机构对各方主体质量行为检查 的内容主要包括( )。
 A. 有关人员的资质或资格 B. 质量保证体系的运行
 C. 施工组织设计文件及审批 D. 质量管理组织架构
 E. 质量责任制的落实情况
 【答案】ABC
 4. 监督工程竣工验收的重点是( )。
 A. 对竣工验收的组织形式、程序等是否符合有关
 规定进行监督
 B. 对竣工过程所涉及的施工管理资料进行监督 C. 对竣工验收过程中所有的关于可能发生质量问
 题的部位进行监督
 D. 监督项目各参与人员的行为
 【答案】A

 */
#pragma mark - ****************************************************************** 1Z205000 职业健康安全与环境管理 14
/*

 */
#pragma mark ******************************** 1Z205010 职业健康安全管理体系与环境管理体系

/*
 
 */
#pragma mark 1Z205011 职业健康安全与环境管理体系标准

/*
 
 一、两种体系标准的比较 1. 相同点
 (1)主体相同
 都是组织管理体系的一部分，主体都是组织。
 (2)目标一致
 改进管理绩效;增强满意程度;减小风险降低 成本;提高信誉和形象。
 (3)原理相同
 预防为主、系统管理、持续改进和PDCA。
 (4)不规定绩效标准
 
 2. 不同点 (1)满足的对象不同
 安全体系——员工和相关方
 环境体系——公众和社会 (2)侧重点不同
 安全体系——危险源辨识，风险评价、控制; 环境体系——环境因素分析
 
 1.职业健康安全和环境管理体系标准均强调( )原理。 A.管理为主，系统规划，持续改进和PDCA B.管理为主，系统协调，持续改进和PDCA C.预防为主，系统管理，持续改进和PDCA D.预防为主，系统规划，持续改进和PDCA
 【答案】C
 2. 关于职业健康安全管理体系和环境管理体系标准比较的 说法，正确的是( )。
 A. 管理原理不同 B. 管理对象相同 C. 管理目标不同 D. 管理重点不同
 【答案】D
 二、两种管理体系的结构、模式和要素比较
 (一)安全管理体系
 1. 总体结构
 范围、规范性引用文件、术语和定义、安全要求
 2. 运行模式
 安全方针、策划、实施运行、检查纠正、管理评
 审，持续改进。
 即PDCA，动态循环、螺旋上升的模式。
 
 3. 要素比较
 (1)核心要素(10个):安全方针;危险源辨识、 风险评价控制;法律法规;目标方案;职责权限;运行 控制;测量监视;合规性评价;内部审核;管理评审。
 (2)辅助性要素(7个):能力、培训和意识;沟 通、参与和协商;文件;文件控制;应急准备和响应; 事件调查、不符合、纠正措施和预防措施;记录控制。
 
 五大要素:1 3 7 5 1 核心要素:1 3 2 3 1
 
 (二)环境管理体系
 1. 总体结构
 范围、规范性引用文件、术语和定义、组织所处环
 境、领导作用、策划、支持、运行、绩效评价、改进。
 2. 运行模式
 策划、支持和运行、绩效评价、改进。 即PDCA，动态循环、螺旋上升的模式。
 
 3.根据《职业健康安全管理体系规范》(GB/T28001 —2011)，属于辅助性要素的是(  )。
 A.法规和其他要求 B.运行控制
 C.培训、意识和能力 D.管理评审
 【答案】C
 4.下列不属于环境管理体系总体结构内容的是( )。 A.领导作用 B.绩效评价 C.培训、意识和能力 D.支持和运行
 【答案】C
 三、安全与环境管理的目的
 1.安全管理的目的
 防止和减少安全事故、保护生产者健康安全、保障
 人民群众生命财产免受损失;控制影响工作场所内的各
 类人员健康安全的条件和因素;避免因管理不当对人员
 健康和安全造成危害。
 2.环境管理的目的
 保护生态环境，使社会经济发展与人类生存环境相
 协调。
 对于建设工程，指保护和改善施工现场环境。
 5. 建设工程职业健康安全管理的目的是使( )。 A.环境能够服务于人类经济社会的发展 B.生产因素中的不安全行为和状态尽可能减少或
 消除，且不引发事故， C.社会经济的发展与人类生存环境相协调 D.以保证生产活动中人员的健康和安全 E.节约资源和避免资源的浪费
 【答案】BD
 */
#pragma mark  1Z205012 职业健康安全与环境管理的特点和要求

/*

 一、职业健康安全与环境管理的要求 1.决策阶段
 建设单位办理安全与环保审批手续，进行环境影响评
 价和安全预评价。
 2.设计阶段
 设计单位进行安全环保设施设计，对防范安全事故提
 出指导意见，对新结构、新材料、新工艺、特殊结构的工
 程，提出预防安全事故的措施建议。
 在总概算中，明确安全环保设施费、安全施工和环保
 措施费。
 设计单位、注册建筑师对设计负责。
 
 3.施工阶段
 建设单位在开工批准之日起15日内，将安全施工措 施备案;在拆除工程施工15日前，将拆除方案备案。
 企业法定代表人是企业安全生产第一负责人，项目
 经理是项目安全生产第一负责人。
 实行总包的，总包对安全生产负总责并自行完成主
 体施工。分包接受总包安全管理。分包不服从导致安全
 事故，由分包承担主要责任，总包就分包工程承担连带
 责任。
 4.试运行阶段
 项目竣工后，建设单位向环保部门申请，对环保 设施进行竣工验收，环保部门30日内完成验收。
 需要试生产的项目，应在投入试生产之日起3个 月内向环保部门申请对配套环保设施进行竣工验收。
 
 6. 在建设工程项目决策阶段，建设单位职业健康安全 与环境管理的任务包括(  )。
 A.提出安全生产事故防范的指导意见 B.办理有关安全的各种审批手续 C.提出保障施工作业人员安全和预防安全生产事
 故的措施建议 D.办理有关环境保护的各项审批手续 E.将保证安全施工的措施报有关管理部门备案
 【答案】BD
 */
#pragma mark  1Z205013 职业健康安全管理体系 与环境管理体系的建立和运行

/*

 一、体系文件的编写 体系文件包括管理手册、程序文件、作业文件。 管理手册是纲领性文件。 程序文件按4W1H编写。 作业文件包括作业指导书(操作规程)、管理规
 定、监测活动准则及程序文件引用的表格。
 
 7. 作业文件是职业健康安全与环境管理体系文件的组成 之一，其内容包括(  )。
 A.管理手册、管理规定、监测活动准则及程序文件
 B.操作规程、管理规定、监测活动准则及程序文件 引用的表格
 C.操作规程、管理规定、监测活动准则及管理手册
 D.操作规程、管理规定、监测活动准则及程序文件
 【答案】B
 二、两种管理体系的运行和维持 1.运行
 体系运行实施的重点:培训意识和能力，信息 交流，文件管理，执行控制程序，监测，不符合、 纠正和预防措施，记录。
 2.维持
 (1)内部审核
 内部审核是组织对其自身的管理体系进行的审
 核，是管理体系自我保证和自我监督的一种机制。
 
 (2)管理评审
 由最高管理者组织。
 (3)合规性评价
 分为公司级和项目组级两个层次。
 项目组级，由项目经理组织，超过半年，不少于
 一次。
 公司级，由管理者代表组织，每年一次。
 8. 关于职业健康安全与环境管理系统内部审核的说法， 正确的是( )。
 A.内部审核是对相关的法律的执行情况进行评价 B.内部审核是管理体系自我保证和自我监督的一种机制 C.内部审核是最高管理者对管理体系的系统评价 D.内部审核是管理体系接受政府监督的一种机制
 【答案】B
 */
#pragma mark ******************************** 1Z205020 建设工程安全生产管理

/*
 
 */
#pragma mark 1Z205021 安全生产管理制度

/*
 
 1. 安全生产责任制度
 是最基本的安全制度，是所有安全制度的核心。
 主要内容:各类人员的安全责任;检查考核办法; 具体指标要求(总分包的安全责任);安全操作规程;安 全人员:1万m2以下1人，1~5万m2不少于2人，5万m2 以上不少于3人。
 2. 安全生产许可证制度
 有效期3年。期满前3个月办理延期手续。
 
 4. 安全生产教育培训制度
 包括管理人员、特种作业人员和企业员工的安全教育。
 (1)特种作业人员 应具备的条件:
 1)年满18周岁;
 2)体检合格;
 3)初中及以上文化; 4)必要的安全技术知识与技能。 取得《特种作业证》后，可上岗。跨省区市作业人员，
 可在户籍所在地或从业所在地参加培训。
 6. 特种作业人员持证上岗制度
 特种作业证有效期6年，全国有效，每3年复审1次， 连续从事10年以上，每6年复审1次。
 离岗6个月以上，重新实际操作考试，合格后上岗。
 
 (2)企业员工的安全教育 1)新员工三级安全教育——企业、项目、班组。 2)改变工艺和变换岗位安全教育—— 离岗一年以上重新上岗，必须进行安全技术培训
 和教育。
 3)经常性安全教育—— 安全思想、安全态度教育最重要。 形式——班前班后会、安全活动日、安全生产会、
 事故现场会、张贴安全生产招贴画、宣传标语及标志。
 
 5. 安全措施计划制度 具体包括:
 1)安全技术措施:......装置 2)职业卫生措施:防......、通风、照明、取暖、降温 3)辅助用房及设施:......室、厕所 4)安全宣传教育措施:图书、展览、制度、研究、实
 验、安全操作方法训练设施。
 安全措施计划编制步骤:工作活动分类→危险源识别
 →风险确定→风险评价→制定安全技术措施计划→评价安全
 技术措施计划的充分性。
 
 7. 专项施工方案专家论证制度 专项施工方案，经施工单位技术负责人、总监
 签字后实施。
 包括:基坑支护与降水工程;土方开挖工程;
 模板工程;起重吊装工程;脚手架工程;拆除、爆
 破工程。
 上述工程中，涉及深基坑、地下暗挖、高大模
 板工程的专项施工方案，还应组织专家论证。
 9. 施工起重机械使用登记制度
 施工单位应当自施工起重机械和整体提升脚手架、
 模板等自升式架设设施验收合格之日起三十日内，向
 建设部门或其他有关部门登记。
 登记提交的资料:
 生产方面:如设计文件、制造质量证明书、检验
 证书、使用说明书、安装证明等。(文件、证、书)
 使用方面:如机械和设施的管理制度和措施、使
 用情况、作业人员情况等。(制度、措施、情况)
 
 10. 安全检查制度
 (1)安全检查目的
 清除隐患、防止事故、改善劳动条件。
 (2)安全检查内容
 查思想、查管理、查隐患、查整改、查伤亡事故处理
 (3)安全检查重点
 检查“三违”和安全责任制的落实。 (4)安全隐患处理程序
 处理程序:登记-整改-复查-销案
 12.“三同时”制度 安全生产设施、劳动卫生设施、防治污染设施，必须
 与主体工程同时设计、同时施工、同时投产和使用。
 安全设施投资应纳入项目概算。
 13. 安全预评价制度
 项目前期，对危险性、危害性进行预测性评价。
 开展安全预评价，是贯彻“安全第一，预防为主”的 重要手段，是企业安全管理工作基础。
 14. 意外伤害保险制度
 工伤保险属于强制性保险，意外伤害险并非强制性保
 险，是否投保由施工企业自主决定。
 1. 关于安全生产管理制度，下列说法正确的是 ( )。 A.安全生产责任制是所有安全生产管理制度的核心，
 施工现场应配备专兼职安全人员 B.涉及深基坑、地下暗挖、爆破工程的专项施工方案，
 施工单位应当组织专家进行论证审查 C.安全检查的内容包括查思想、查制度、查管理、查
 隐患、查整改、查伤亡事故处理 D.生产经营单位新建工程项目的安全措施必须与主体
 工程同时设计、同时施工、同时验收 E.安全检查的重点是检查三违和安全责任制的落实
 【答案】ACE
 2. 根据《建设工程安全生产管理条例》，下列施工起重 机械进行登记时提交的资料中，属于机械使用有关情况 的是( )。
 A. 制造质量证明书
 B. 检验证书
 C. 使用说明书
 D. 起重机械的管理制度
 【答案】D
 3. 关于安全生产管理制度的说法，正确的有( )。   A. 企业取得安全生产许可证，应当具备的条件之 一是依法参加工伤保险，为从业人员缴纳保险费   B. 新员工上岗前的三级安全教育，对建设工程来 说，具体指进企业、进项目、进班组三级
 C. 对高大模板工程的专项施工方案，施工单位应 当组织专家进行论证、审查
 D. 按照“三同时”制度要求，安全设施投资应当 纳入建设工程概算
 E. 特种作业人员离开特种作业岗位1年后，应当重 新进行培训，经培训合格后方可上岗作业 【答案】ABCD
 */
#pragma mark 1Z205022 安全生产管理预警体系的建立和运行

/*
 
 一、预警体系的四大要素
 四要素:外部环境、内部管理不良、信息管理和事故
 预警系统。
 外部环境:自然环境、政策法规、技术变化。
 内部管理不良:质量、设备、人的行为活动管理。
 二、预警体系的两大功能 1.预警分析
 包括:监测、信息管理、指标体系构建和评价。 3)预警方法:指标、因素、综合预警，误警和漏警。
 
 (2)预警评价
 级别
 I 级预警 II级预警 III级预警 IV级预警
 状态 信号标准
 特别严重 红 严重 橙 上升 黄 正常 蓝
 2.预控对策——组织准备、日常监控和事故危机管理。
 3.两者关系 (1)内容不同
 预警分析:隐患辨识，前提和基础。
 预控对策:纠错、治错，目标。 (2)对象不同
 预警分析:正常的安全管理过程。
 预控对策:已被确认的事故现象。
 三、预警体系的运行(排序)
 预警分析:完成监测、识别、诊断与评价的功能;
 预控对策:完成纠错治错的功能。
 
 4. 预警体系功能的实现主要依赖于( 用的发挥。
 A.预警监测 B.预警分析 C.预控对策 D.预警评价 E.预警信息管理
 【答案】BC
 )两大子系统作
 5. 确定预警级别和预警信号标准，属于安全生产管理 预警分析中( )的工作内容。
 A.预警监测 B.预警信息管理 C.预警评价 D.预警评价指标体系的构建
 【答案】 C
 */
#pragma mark 1Z205023 施工安全技术措施和安全技术交底

/*
 
 一、安全技术措施 1.安全控制目标
 (1)减少消除人、设备、材料的不安全状态; (2)改善生产环境、保护自然环境。
 2.安全控制程序
 (1)确定安全目标 (2)编制安全技术措施计划 --P (3)落实和实施 --D (4)验证 --C
 (5)持续改进 --A
 
 3.安全技术措施的要求
 (1)必须开工前制定——与施组设计一同编制
 (2)全面性——大中型、重点工程要编制施工安全 技术措施和专项工程施工安全技术措施
 (3)针对性——针对每项工程的特点制定 (4)力求全面具体可靠——考虑周全 (5)必须包括应急预案 (6)可行性和可操作性 (7)必须包含施工总平面图
 
 二、安全技术交底 1.主要内容
 (1)本项目的作业特点和危险点; (2)针对危险点的具体预防措施; (3)应注意的安全事项; (4)相应的安全操作规程和标准; (5)发生事故后应采取的避难和急救措施。
 2.要求
 (1)逐级，纵向延伸到班组全体作业人员;
 (5)对于涉及“四新”项目或技术含量高、技术难度 大的单项技术设计，必须经过两阶段技术交底，即初步设 计技术交底和施工图设计技术交底;
 (7)书面交底; (8)签字(归档)。
 安全技术交底是安全管理人员自我保护的手段。
 6. 关于安全技术措施要求和内容的说法，正确的是( )。 A.可随工程进展需要时编制 B.应在安全技术措施中抄录制度性规定 C.小规模工程的安全技术措施中可不包含施工总平面图 D.结构复杂的重点工程应编制专项工程施工安全技术措施
 【答案】D
 7. 对于( )必须经过两阶段技术交底，即初步设计技术交 底和实施性施工图设计技术交底。
 A.涉及“六定”项目 B.涉及“四新”项目 C.技术含量高的单项技术设计 D.技术难度大的单项技术设计 E.工作量大的单选工程
 【答案】BCD
 */
#pragma mark 1Z205024 安全生产检查监督的类型和内容

/*
 
 1.安全检查的目的
 清除隐患、防止事故、改善劳动条件、提高安全生
 产意识。
 安全检查由项目经理组织。
 2.安全生产检查监督的主要内容 (1)查思想——认识程度，重视程度，处理态度 (2)查制度——......制度、安全操作规程 (3)查管理——是否有效，是否落实 (4)查隐患 (5)查整改 (6)查事故处理
 8. 施工安全生产规章制度一般应包括的内容( )。 A.生产安全事故报告和调查处理制度 B.各种安全技术操作规程 C.事故直接隐患与间接隐患并治 D.防火、防爆、防雷、防静电制度 E.安全标志管理制度
 【答案】ABDE
 */
#pragma mark 1Z205025 安全隐患的处理

/*
 
 一、安全隐患的内容
 包括:人的不安全因素、物的不安全状态和管
 理的不安全因素三方面。
 要求会区分，找语句的重心!
 特例:(二)物的不安全状态 1(3)物的放置方法的缺陷
 
 二、安全隐患治理原则
 1. 冗余安全度治理原则
 多道防线。如，道路上一个坑，设防护栏、警示 牌、照明、红灯。(井盖)
 2. 单项隐患综合治理原则
 人机料法环，多角度。如，触电事故，对人进行
 安全教育、设漏电开关、线路改造、严禁乱接乱拉。
 3~6:直接隐患间接隐患并治、预防减灾并重、重点 治理、动态治理原则
 9. 下列安全隐患的不安全因素中，属于“物的不安全 状态”的有( )。
 A. 个人防护用品缺陷
 B. 物体存放不当
 C. 未正确使用个人防护用品
 D. 对易燃易爆等危险品处理不当
 【答案】A
 10. 某工程施工期间，安全人员发现作业区内有一处电 缆井盖遗失，随即在现场设置护栏及警示牌，并设照明 及夜间警示红灯。这是建设安全事故隐患处理中(  ) 原则的体现。
 A. 动态治理
 B. 单项隐患综合治理
 C. 冗余安全度治理
 D. 直接隐患与间接隐患并治
 【答案】C
 */
#pragma mark ******************************** 1Z205030 建设工程生产安全事故应急预案和事故处理

/*
 
 */
#pragma mark 1Z205031 生产安全事故应急预案的内容

/*
 一、应急预案体系的构成
 规模小、危险少，综合、专项应急预案可合并编写。
 综合应急预案:从总体上阐述方针、政策......的综合 性文件。
 专项应急预案:针对具体事故类别(如基坑开挖、脚
 手架拆除)的计划或方案。
 现场处置方案:针对具体装置、场所、设施、岗位的
 措施。应急演练。
 
 1. 建设工程安全生产事故应急预案中，针对深基坑开 挖可能发生的事故、相关危险源和应急保障而制定的 计划属于( )。
 A.综合应急预案 B.现场处置方案
 C.专项应急预案 D.现场应急预案
 【答案】C
 */
#pragma mark 1Z205032 生产安全事故应急预案的管理

/*
 
 
 应急预案管理包括评审、备案、实施和奖惩。
 1.评审
 地方各级安监部门组织，可以召开听证会。
 参加人员:政府人员和安全管理专家。
 评审人员与预案单位有利害关系的，应当回避。
 
 2.备案
 地方各级安监部门，报同级人民政府和上级安监部门;
 其他负有安监职责的部门(如建设部门)，抄送同级安监 部门。
 3.实施
 应急预案演练，综合、专项应急预案，每年至少一次; 现场处置方案，每半年至少一次。
 4.奖惩
 未备案，警告、三万元以下罚款。
 未制定或未采取措施，停产停业整顿，行政处罚。
 
 2. 以下安全事故应急预案管理的说法，正确的是( )。 A.参建单位的安全生产及应急管理方面的专家，均可
 受邀参加应急预案评审 B.应急预案应报同级人民政府和上一级安全生产监督
 管理部门备案 C.施工单位安全事故应急预案未按有关规定备案的，
 县级以上安全生产监督管理部门给予警告，并处以5万元 以下的罚款
 D.施工单位应每半年至少组织1次现场处置方案演练
 【答案】D
 3. 生产经营单位应急预案未按照有关规定备案的，由 县级以上( )给予警告，并处罚款。
 A. 建设主管部门
 B. 安全生产监督管理部门   C. 建设工程质量监督机构   D. 人民政府
 【答案】D
 */
#pragma mark 1Z205033 职业健康安全事故的分类和处理

/*
 
 一、职业健康安全事故的分类 1.按发生原因分
 物体打击:不包括因爆炸引起的物体打击
 机械伤害:不包括车辆、起重设备引起的伤害 2.按严重程度分
 (1)轻伤，1至105个工作日; (2)重伤，105工作日以上(含)的失能伤害; (3)死亡，重大伤亡，死亡1~2人;
 特大伤亡，死亡3人以上(含3人)。
 3.按人员伤亡或直接经济损失分
 (313\151\151，往严重的靠)
 事故 等级
 伤亡人数(人)
 直接经济损失 (万元)
 死亡(或)
 重伤(或)
 特大
 R≥30
 R≥100
 M≥10000
 重大
 10≤R< 30
 50≤R<100
 5000≤M< 10000
 较大
 3≤R<10
 10≤R<50
 1000≤M<5000
 一般
 R<3
 R<10
 M<1000
 
 4. 根据《生产安全事故报告和调查处理条例》，下列安全 事故中，属于重大事故的是( )。
 A.3人死亡，10人重伤，直接经济损失2000万元 B.12人死亡，直接经济损失360万元 C.36人死亡，50人重伤，直接经济损失6000万元 D.2人死亡，100人重伤，直接经济损失1.2亿元
 【答案】B
 二、建设工程安全事故的处理 (一)事故处理原则(“四不放过”原则)
 1.事故原因未查清不放过 2.事故责任人未受到处理不放过 3.事故责任人和周围群众没有受到教育不放过 4.事故没有制定切实可行的整改措施不放过
 
 (二)安全事故处理措施 1.上报事故
 现场人员立即向施工单位负责人报告;施工单位 负责人1小时内报告。情况紧急，现场人员可以直接向 县级安监部门和负有安监职责的部门报告。部门每级上 报时间不超过2小时。必要时，可以越级。
 1)特大、重大，逐级上报至国务院安监部门和 负有安监职责的部门;
 2)较大，逐级上报至省......; 3)一般，逐级上报至设区的市......。
 
 2.调查事故
 特大事故由国务院或国务院授权有关部门调查。
 重大、较大、一般事故分别由省、市、县人民政
 府负责调查。可直接，也可授权或委托。
 未造成伤亡的一般事故，县人民政府也可委托事
 故发生单位组织调查。
 一般
 较大
 重大
 特大
 上报(部门)
 市
 省
 国
 国
 调查(政府)
 县
 市
 省
 国
 
 3.提交和批复事故调查报告 提交:事故调查组60日内提交事故调查报告;
 特殊情况，可延长，但延长期限最长不超过60日。
 事故调查报告内容:(比P205少一条)
 批复:重大、较大、一般事故，15日内批复; 特大事故，30日内批复;特殊情况，可延长，但延 长时间最长不超过30日。
 5. 建设工程安全事故处理的原则有( )。 A. 事故单位未受到处理不放过
 B. 事故原因未查清不放过
 C. 事故责任人未受到处理不放过
 D. 事故未落实整改措施不放过
 E. 事故有关人员未受到教育不放
 【答案】BC
 6. 某工程安全事故造成了 960 万元的直接经济损失，没有 人员伤亡，关于该事故调查的说法，正确的是( )。
 A. 应由事故发生地省人民政府直接组织事故调查组调查 B. 必须由事故发生地县人民政府直接组织事故调查组调查 C. 应由事故发生地设区的市人民政府委托有关部门组织事
 故调查组调查
 D. 可由事故发生地县人民政府委托事故发生单位组织事故
 调查组调查
 【答案】D
 7. 根据《生产安全事故报告和调查处理条例》(国务院令 第493号)，事故调查报告的内容主要有( )。
 A. 事故发生单位概况
 B. 事故发生经过和事故救援情况
 C. 事故造成的人员伤亡和直接经济损失 D. 事故责任者的处理结果
 E. 事故发生的原因和事故性质
 【答案】ABCE
 8. 发生建设工程重大安全事故时，负责事故调查的人民政府 应当自收到事故调查报告起(  )日内作出批复。
 A. 30 B. 15
 C. 45 D. 60
 【答案】B
 */
#pragma mark ******************************** 1Z205040 建设工程施工现场职业健康安全 与环境管理的要求

/*
 
 */
#pragma mark 1Z205041 施工现场文明施工的要求

/*
 
 文明施工是指保持良好的作业环境、卫生环境和工作秩序。
 一、现场文明施工的措施
 (一)加强文明施工管理
 项目经理为现场文明施工第一责任人。
 安全三检:自检、互检、交接检。
 
 (二)落实各项管理措施 1.施工平面布置
 施工总平面图是现场文明施工的依据。
 2.现场围挡、标牌 (1)围挡高度:四周连续，市区、市容景观路段
 不低于2.5m，其他不低于1.8m。 (2)“五牌一图”:工程概况牌、管理人员名单
 及监督电话牌、消防保卫(防火责任)牌、安全生产牌、
 文明施工牌和施工现场总平面图。
 3.施工场地
 (1)施工现场应积极推行硬地坪施工，主干道必须 硬化，其他道路应硬化。
 (4)严禁泥浆、污水、废水外流或未经允许排入河 道，严禁堵塞下水道和排水河道。
 5.现场生活设施
 (1)施工现场作业区与办公生活区必须明显划分。
 6.现场消防、防火管理
 (1)现场建立消防管理制度，建立消防领导小组， 落实消防责任制和责任人员。
 (2)易燃易爆物品堆放间、油漆间、木工间、总配 电室等消防防火重点部位要设置灭火器和消防沙箱。
 
 1.关于现场文明施工管理的说法，正确的有( )。
 A. 沿工地四周连续设置围挡，市区主要道路和其他涉及
 市容景观路段的工地围挡的高度不得低于1.8m
 B. 施工现场必须实行封闭管理，设置进出口大门，制定
 门卫制度，严格执行外来人员进场登记制度
 C. 项目经理是施工现场文明施工的第一责任人
 D. 施工现场设置排水系统，泥浆、污水、废水有组织地
 排入下水道和排水河道
 E. 现场建立消防领导小组，落实消防责任制和责任人员
 【答案】BCE
 */
#pragma mark 1Z205042 施工现场环境保护的要求

/*
  一、施工现场环保的要求
 9.对环境造成重大影响、应编制环境影响报告书的， 严重影响居民生活环境质量的，存在重大意见分歧的工 程项目，可以举行听证会。
 10.防治污染的设施，必须与主体工程同时设计、 同时施工、同时投产使用。必须经原环保部门验收合格， 方可投产使用。
 
 二、施工现场环保的措施
 (一)大气污染防治措施
 2.高大建筑物要使用封闭式容器或永久性垃圾道处 理高空废弃物。
 6.除设有符合规定的装置外，禁止在施工现场焚烧 油毡、橡胶、塑料等废弃物品其他产生有毒、有害烟尘 和恶臭气体的物质。
 8.工地茶炉应尽量采用电热水器。 9.大城市市区的建设工程不容许搅拌混凝土。
 (二)水污染防治措施
 1.禁止将有毒有害废弃物作土方回填。
 2.搅拌站废水，水磨石污水，必须经沉淀池沉淀 合格后再排放。
 3.现场存放油料，必须对库房地面进行防渗处理。 4.施工现场100人以上的临时食堂，要设隔油池。 5.工地临时厕所、化粪池应采取防渗漏措施。
 (三)噪声污染的控制措施
 建筑施工场界噪声排放限值[dB]
 1. 声源控制(2个)
 (1)防止噪声污染最根本的措施。 (2)采用低噪声设备。 (3)安装消声器。
 昼间
 夜间
 70
 55
 
 2.传播途径控制(4个)
 (1)吸声:利用吸声材料。 (2)隔声:应用隔声结构。 (3)消声:利用消声器阻止传播。 (4)减振降噪:降低机械振动减小噪声。
 3.接收者防护(2个)
 使用耳塞、耳罩等防护用品。
 4.严控人为噪声
 (2)人口稠密区，一般晚10点到次日早6点停止 强噪声作业。特殊情况，施工单位会同建设单位找当 地居委会协调，安民告示，求得谅解。
 
 (四)固体废物的处理
 基本思想:资源化、减量化、无害化，全过程控制。
 处理方法:
 1. 回收利用
 2. 减量化处理——分选、破碎、压实、脱水
 3. 焚烧——不适合再利用且不宜直接填埋
 4. 稳定和固化——利用水泥、沥青等胶结材料包裹 5. 填埋——无害化、减量化处理后填埋
 
 2.下列施工现场环境保护措施中，属于空气污染防治 措施的有( )。
 A. 指定专人定期清扫施工现场道路 B. 化学药品库内存放
 C. 施工现场不得甩打模板
 D. 工地茶炉采用电热水器
 E. 使用封闭式容器处理高空废弃物
 【答案】ADE
 3. 关于施工过程中水污染预防措施的说法，正确的有 ( )。
 A. 禁止将有毒有害废弃物作土方回填
 B. 施工现场搅拌站废水经沉淀池沉淀合格后也不 能用于工地洒水降尘
 C. 施工现场80人以上的临时食堂，要设隔油池。   D. 现场存放油料，必须对库房地面进行防渗处理
 E. 化学用品、外加剂等要妥善保管，库内存放
 【答案】ADE
 4.改变振动源与其他刚性结构的连接方式以减振降噪 的做法，属于噪声控制技术中的( )。
 A. 声源控制 B. 接受者防护
 C. 传播途径控制 D. 人为噪声控制
 【答案】C
 5.在空气压缩机的进出风管适当位置安装消声器的做 法，属于施工噪声控制技术中的( )。
 A. 声源控制 B. 减振降噪控制
 C. 传播途径控制 D. 接受者防护
 【答案】A
 6.建设工程施工工地上，对于不适合再利用，且不宜 直接予以填埋处置的废物，可采取( )的处理方法。
 A. 减量化处置 B. 焚烧
 C. 稳定固化 D. 消纳分解
 【答案】B
 */
#pragma mark 1Z205043 施工现场职业健康安全卫生的要求

/*
 
 1.现场宿舍
 (1)宿舍室内净高不小于2.4m，通道宽度不小于 0.9m，每间宿舍不超过16人。
 (2)宿舍必须设置可开启式窗户，宿舍床铺不超 过2层，严禁通铺。
 
 2.现场食堂
 (6)食堂门扇下方应设不低于0.2m的防鼠挡板。 灶台瓷砖高度不小于1.5m。粮食存放台距墙和地面 大于0.2m。
 3.现场厕所
 (1)蹲位隔板高度不低于0.9m。 (2)高层建筑超过8层后，每隔四层设临时厕所。
 4.其他临时设施
 (3)生活区设开水炉、电热水器或保温桶。 (5)传染病、中毒，必须2小时内报告。
 
 7. 关于施工现场宿舍设置的说法，正确的是( )。   A. 室内净高2.5m
 B. 室内通道宽度0.8m
 C. 每间宿舍居住18人
 D. 严禁使用通铺，床铺不超过3层
 【答案】A
 8. 关于建设工程现场职业健康安全卫生措施的说法， 正确的有( )。
 A. 办公区和生活区应设半封闭式垃圾容器 B. 施工现场宿舍必须设置可开启式窗户
 C. 现场食堂炊事人员必须持身体健康证上岗 D. 厕所应设专人负责清扫、清毒
 E. 施工区必须配备开水炉
 【答案】BCD
 
 
 */
#pragma mark - ****************************************************************** 1Z206000 项目合同管理  25
/*
 */
#pragma mark  ******************************** 1Z206010 建设工程施工招标与投标

/*
 
 */
#pragma mark 1Z206011 施工招标的内容

/*
 
 O、招标应具备的条件:
  招标人已经依法成立;
  初步设计及概算已经批准;
  招标范围、方式和组织形式已经核准;  有资金或资金来源已经落实;
  有招标所需的设计图纸及技术资料。
 
 一、招投标项目的确定
 宜采用招标方式的项目:
 (1)大型、公用等关系社会公共利益、公众安全 的;
 (2)全部或部分使用国有资金的; (3)使用国际组织或外国政府资金的。
 二、招标方式的确定 1. 公开招标
 优点——有较大的选择范围。
 缺点——资格审查和评标的工作量大、耗时长、 费用高，可能因资格预审把关不严导致鱼目混珠。
 公开招标，招标人不得以不合理的条件限制或排
 斥潜在的投标人。
 
 2.邀请招标
 下列情形之一，可以邀请招标: (1)技术复杂、特殊要求，或受自然环境限制，
 (且)只有少量潜在投标人可供选择; (2)拟公开招标的费用占合同金额比例过大;
 应当向三个以上法人或组织发投标邀请书。
 
 三、自行招标与委托招标
 可自行办理，也可委托招标代理机构办理。
 自行办理，应具有编制招标文件和组织评标的能力。
 不具备自行招标能力，必须委托。招标代理机构分为
 甲、乙两级。乙级只能承担工程投资额(不含征地费、大 市政配套费与拆迁补偿费)1亿元以下的代理业务。
 招标代理机构可以跨省、区、市承担代理业务。
 四、招标信息的发布与修正 1.发布
 资格预审公告和招标公告应在指定媒介发布，
 不得收取费用。
 招标人或招标代理机构应至少在一家指定媒介
 发布招标公告。
 自招标文件或者资格预审文件出售之日起至停 止出售之日止，最短不得少于5日。
 发售资格预审文件，不得以营利为目的;设计
 文件可酌收押金，退还设计文件，退还押金;招标
 文件售出，不予退还;招标人不得擅自终止招标。
 2.修正
 时限——投标截止日至少15日前; 形式——书面; 全面——必须直接通知所有招标文件收受人; 性质——招标文件的有效组成部分。
 五、资格预审
 通过预审的申请人少于3个的，重新资格预审。
 六、标前会议
 会议纪要，应以书面形式发给每一个投标人，对问题
 的解答不需要说明问题来源。
 会议纪要、答复函件形成补充文件，与招标文件具有
 同等法律效力。补充文件与招标文件内容不一致，以补充
 文件为准。
 
 七、评标 初步评审——符合性审查，重点审查投标书是否
 实质上响应了招标文件要求，不响应为废标。细微偏
 差不能作为废标，处理方法:大小写不一致，大写为
 准;单价与总价不一致，单价为准;正本副本不一致，
 正本为准。
 详细评审——核心，实质性审查，包括技术评审 和商务评审。
 评标结束后，评标委员会推荐中标候选人1-3人， 并标明排列顺序。
 
 1. 根据我国现行招标投标的有关规定，下列说法正确的 是(  )。
 A. 招标人必须委托招标代理机构代为办理招标事宜 B. 工程招标代理机构的资格分为甲、乙两级
 C. 乙级工程招标代理机构只能承担工程投资额
 10000万以下的工程招标代理业务
 D. 乙级工程招标代理机构不可以跨省、自治区、直
 辖市承担业务
 【答案】B
 2. 根据《施工招标办法》，工程项目招标信息发布时， 正确的有( )。
 A. 指定媒介可以酌情收取费用
 B. 招标人应至少在两家指定的媒介发布招标公告 C. 招标人可以对招标文件所附的设计文件向投标人
 收取一定费用
 D. 招标文件售出后不予退还
 E. 自招标文件出售之日起至停止出售之日止，最短
 不得少于5日
 【答案】DE
 3. 根据《招标投标法》，招标人对已发出的招标文件进行 必要的澄清或者修改的，应当在招标文件要求提交投标文 件截止时间至少(  )日前书面通知。
 A. 7 B. 14 C. 21 D. 15
 【答案】D
 */
#pragma mark 1Z206012 施工投标的内容

/*
 
 投标程序(步骤):
 1.研究招标文件 2.进行各项调研 3.复核工程量 4.选择施工方案 5.投标计算 6.确定投标策略 7.正式投标
 1. 研究招标文件 研究重点:投标者须知、合同条款、设计图纸、
 工程范围、工程量表。
 重点注意:投标人须知(招标工程的内容和范围、
 投标文件的组成、重要时间安排)。
 3. 复核工程量
 对单价合同，实测与图纸相差较大，要求澄清。
 对总价合同，如果业主对争议工程量不予更正，
 投标时要附上声明。
 4. 选择施工方案
 由投标人的技术负责人主持制定。
 7. 正式投标
 注意投标截止日期——超过该日期，无效投标 注意投标文件完备性——应当实质响应 注意标书标准——签章、密封。企业公章、企业
 法定代表人名章(或项目经理授权委托书原件)。
 4. 投标人须知是招标人向投标人传递的基础信息文件， 投标人应特别注意其中的(  )。
 A. 招标工程的范围和详细内容 B. 招标人的职责权利
 C. 施工技术说明
 D. 投标文件的组成
 E. 重要的时间安排
 【答案】ADE
 5. 在建设工程施工投标过程中，施工方案应由投标人的( ) 主持指定。
 A. 项目经理
 B. 法人代表
 C. 技术负责人
 D. 分管投标的负责人
 【答案】C
 */
#pragma mark 1Z206013 合同的谈判与签约

/*
 
 一、合同订立的程序 要约邀请——发布招标公告 要约——提交投标文件 承诺——发出中标通知书
 二、合同谈判的主要内容
 1. 谈判双方达成一致的内容，以“合同补遗”、“会议 纪要”的方式，构成合同的一部分。
 2. 工期较长，容易货币贬值、通货膨胀，价格调整条 款可以比较公正的解决承包人的风险损失。
 合同计价方式以及价格调整方式共同确定了合同的实
 际价格。
 3. 合同付款分四个阶段:预付款、进度款、最终付款、 退还保留金。
 4. 承包人应力争以维修保函代替保留金。
 维修保函对承包人有利，可提前取回现金，且保函有
 时效，期满自动作废。
 对业主无风险，真正发生维修费用，可凭保函向银行
 索回款项。
 三、合同补遗与签订
 谈判结果一般以《合同补遗》，或《合同谈判纪要》
 的形式，形成书面文件。
 合同必须遵守法律，对于违反法律的条款，即使双方
 达成协议并签了字，也不受法律保障。
 谈判结束后，形成完整的合同文本草案，经双方代表
 认可后形成正式文件。
 6. 建设工程合同的订立程序中，属于要约的是( )。 A. 招标人通过媒体发布招标公告
 B. 向符合条件的投标人发出招标文件
 C. 投标人根据招标文件内容在规定的期限内向招标
 人提交投标文件
 D. 招标人通过评标确定中标人，发出中标通知书
 【答案】C
 7. ( )共同确定了工程承包合同的实际价格，直接影响着 承包人的经济利益。
 A. 货币贬值
 B. 合同计价方式 C. 价格调整方式 D. 通货膨胀
 E. 单价合同
 【答案】BC
 8. 对于合同谈判中工期和维修期的说法，正确的有( )。   A. 对于具有较多单项工程的建设工程项目，可在合同 中明确允许分部位或分批提交业主验收
 B. 由于工程变更原因对工期产生不利影响时，应给予 承包人要求合理延长工期的权利
 C. 承包人只应承担由于材料和施工方法及操作工艺等 不符合合同规定而产生的缺陷
 D. 承包人不能用维修保函来代替业主扣留的保留金   E. 业主和承包人应当根据项目情况、施工环境因素等 商定适当的开工时间
 【答案】ABC
 9. 关于建设工程施工合同谈判与签约的说法，正确是 (  )。
 A. 在合同谈判阶段形成的所有文件都是合同文件的 组成部分
 B. 建设工程施工合同由合同双方达成协议并签字后， 即受法律保护
 C. 双方在合同谈判结束后，即形成正式的合同文件
 D. 在合同谈判中，双方可以对技术要求进行进一步 讨论和确认
 【答案】D
 */
#pragma mark  ******************************** 1Z206020 建设工程合同的内容

/*
 
 勘察合同、设计合同、施工承包合同属于建设工程合同;
 工程监理合同、咨询合同等属于委托合同。
 */
#pragma mark 1Z206021 施工承包合同的内容

/*
 
 一、文件组成及解释顺序 1.施工合同示范文本组成:
 (1)协议书; (2)通用条款; (3)专用条款。
 2.优先顺序
 签署日期在后的、内容重要的排前面。 (1)合同协议书; (2)中标通知书(如果有); (3)投标函及其附录(如果有); (4)专用合同条款及其附件; (5)通用合同条款; (6)技术标准和要求;
 (7)图纸; (8)已标价工程量清单或预算书;
 1. 根据合同通用条款规定的文件解释优先顺序，下列文件中 具有最优先解释权的是(  )。
 A. 规范标准 B. 中标通知书 C. 协议书
 D. 设计文件
 【答案】C
 二、发包方的责任与义务 ——场地、图纸、办证、协调、交通、交底、验收、付款
 (1)图纸的提供和交底
 至迟开工前14天向承包提供图纸。
 (2)对化石、文物的保护
 增加的费用和(或)延误的工期由发包承担。
 (6)许可或批准
 办理用地规划，工程规划，施工，水、电、路、占等
 许可。
 
 (7)提供施工现场
 最迟开工7天前向承包移交施工现场。
 (9)提供基础资料
 向承包提供地下管线，气象和水文观测，地质勘察资 料，并对资料的真实性、准确性和完整性负责。 (10)支付担保
 发包要求承包提供履约担保的，发包应向承包提供支
 付担保。
 
 2. 根据《建设工程施工合同(示范文本)》(GF- 2013-0201)，属于发包人工作的有( )。
 A. 保证承包人施工人员的安全和健康
 B. 保证向承包人提供正常施工所需的进入施工现场 的交通条件
 C. 依据有关法律办理建设工程施工许可证
 D. 向承包人提供施工现场的地质勘查资料
 E. 负责对指定分包的管理，并对分包行为负责
 【答案】BCD
 3. 根据《建设工程施工合同(示范文本)》(GF- 2013-0201)，发包人责任和义务有( )
 A. 办理建设工程施工许可证 B. 办理建设工程规划许可证 C. 办理工伤保险
 D. 提供场外交通条件
 E. 负责施工场地周边的环境保护
 【答案】ABD
 三、承包人的一般义务 ——质量、安全、文明、环保、工期、保修、保险、
 工资、归档
 (2)完成工程，承担保修义务;
 (3)采取施工安全和环保措施，办理工伤保险，确 保工程及人员、材料、设备和设施安全;
 (4)编制施工组织设计和施工措施计划; (6)负责施工场地及周边环境与生态保护; (9)编制竣工资料，完成竣工资料立卷归档。
 
 4. 承包人在履行合同过程中应遵守法律和工程建设标准 规范，并履行以下义务( )。
 A. 办理法律规定应由承包人办理的许可和批准
 B. 按法律规定和合同约定采取施工安全和环保措施 C. 负责施工场地及其周边环境与生态的保护工作 D. 按照法律规定和合同约定编制施工资料
 E. 约定采取施工安全措施，确保工程及其人员、材
 料、设备和设施的安全
 【答案】ABCE
 四、进度、质量、费用控制的内容 1.进度控制
 (1)进度计划修订
 发包、监理对进度计划的确认，不减轻或免除承包
 的责任和义务。
 (2)开工通知
 监理应在开工日期7天前向承包发开工通知。
 因发包原因造成监理未能在开工日期90天内发开工 通知的，承包有权提出价格调整要求，或者解除合同。
 
 (3)工期延误
 1)发包人原因——发包承担费用、工期、利润。 2)承包人原因
 承包人支付逾期竣工违约金，不免除继续完成义务。
 (4)暂停施工
 1)发包人原因——发包承担费用、工期、利润。 2)承包人原因
 承包人承担费用和工期，监理复工指示后84天内仍未 复工，视为无法履行合同。
 
 3)紧急情况暂停施工 紧急情况暂停施工，监理人应在接到通知后24小时内
 发出指示，逾期未发出指示，视为同意。
 (5)提前竣工
 发包要求承包人提前竣工的，发包通过监理向承包下
 达提前竣工指示，承包应提交提前竣工建议书，包括实施
 的方案、缩短的时间和增加的价格。
 
 (6)实际竣工日期
 1验收合格:提交竣工验收申请报告之日。
 2发包原因，42天内未完成竣工验收，或完成竣工 验收不签发工程接收证书:提交竣工验收申请报告之日。
 3未竣工验收，发包擅自使用:转移占有工程之日。
 
 2.质量控制
 (2)隐蔽工程检查 1)检查程序
 承包人自检合格，共同检查前48小时书面通知监理。
 监理人不能按时进行检查，检查前24小时提交书面延 期要求，但延期不能超过48小时。
 2)重新检查
 发包人或监理人对质量有疑问的，可要求重新检查，
 承包人应遵照执行。
 经检查，质量符合要求，发包承担费用、工期、利
 润;质量不符合要求，承包承担费用、工期。
 3)承包人私自覆盖
 无论是否合格，费用和(或)工期均由承包人承担。
 
 (3)缺陷责任与保修 1)缺陷责任期
 自实际竣工日期起计算，最长不超过24个月。
 单位工程先于全部工程验收，单位工程缺陷责任期
 自单位工程验收合格之日起算。
 发包原因导致无法竣工验收的，自提交竣工验收申
 请报告之日起算。
 发包擅自使用，自转移占有之日起算。
 
 2)保修责任
 保修期从竣工验收合格之日起算，不低于最低保修
 年限。
 3.费用控制 (1)预付款
 预付款至迟开工7天前支付。逾期超过7天，催告， 收到通知后7天仍未支付，暂停施工。
 承包人在发包人支付预付款7天前提供预付款担保。
 
 (2)进度款(7+7+14)
 1)承包人每月25日报送上月20日到当月19日的工 程量报告，并附进度付款申请单。
 2)监理人收到后，7天内完成审查并报送发包人， 发包人7天内完成审批并签发进度款支付证书。
 3)发包人进度款支付证书签发后14天内完成支付。
 5. 某工程竣工验收阶段，承包人于6月1日向工程师递交了竣工 验收报告;发包人于6月15日组织生产设备启动试车检验;6月 18日试车完毕后发包人、承包人、工程师和设计代表在试车记 录上签字确认质量合格;工程师于6月20日签发工程移交证书。 则承包人的实际竣工日期应为(  )。
 A. 6月1日 B. 6月15日
 C. 6月18日 D. 6月20日
 【答案】A
 6. 在施工过程中，工程师发现曾检验“合格”的工程部位仍存 在施工质量问题，则修复该部位工程质量缺陷时，应(  )。
 A. 由发包人承担费用，工期给予顺延 B. 由承包人承担费用，工期给予顺延 C. 由承包人承担费用，工期不给予顺延 D. 由发包人承担费用，工期不给予顺延
 【答案】C
 7. 根据《建设工程施工合同(示范文本)》(GF-2013-0201), 工程缺陷责任期自( )起计算。
 A. 合同签订之日
 B. 竣工验收合格之日
 C. 实际竣工日期
 D. 颁发工程接收证书之日
 【答案】C
 */
#pragma mark 1Z206022 物资采购合同的内容

/*
 
 一、建筑材料采购合同 1.约定质量标准的原则
 (1)国家标准; (2)部颁标准; (3)企业标准; (4)合同约定。
 2.包装
 包装物一般应由供货方提供，不得收取包装费。
 
 3.验收
 (1)驻厂验收
 (2)提运验收
 (3)接运验收 (4)入库验收:广泛采用正式的验收方式。
 4.交货期限
 (1)供货方负责送货，以收货戳记日期为准; (2)采购方提货，按合同规定通知的提货日期为准; (3)委托运输，以承运单位签发的日期为准。
 
 5.价格
 (1)有国家定价，按国家定价; (2)由国家定价但尚无定价，报请物价主管部门; (3)不属于国家定价，双方协商。
 6.违约责任
 多交货部分、不符合合同规定的产品，代为保管期
 间实际支出的保管费由供货方承担。
 
 二、设备采购合同的主要内容
 采用固定总价合同，包括税费、运杂费、保险费。
 价款支付分三次: (1)制造前，10%预付款; (2)货物送达交货地点，80%; (3)剩余10%作为设备保证金。
 8. 关于具体采购交货日期的说法，正确的是( )。
 A. 凡委托运输部门送货的，以供货方发运产品时承运单 位签发的日期为准
 B. 供货方负责送货的，以供货方按合同规定通知的提货 日期为准
 C. 采购方提货的，以采购方收货戳记的日期为准   D. 凡委托运输单位代运的产品，以向承运单位提出申请 的日期为准
 【答案】A
 9. 设备采购合同通常采用( 行调整。
 A. 固定总价合同 B. 固定单价合同 C. 成本加酬金合同 D. 变动总价合同
 【答案】A
 )，在合同交货期内价格不进
 */
#pragma mark 1Z206023 施工专业分包合同的内容

/*
 
 一、承包人责任义务——类似承包合同的发包人 ——场地、图纸、办证、协调、交通、交底、验收、付款 ——提供总包合同(价格内容除外)供分包查阅。
 二、专业分包人责任义务——类似承包合同的承包人 ——质量、安全、文明、环保、工期、保修、保险、工资、
 归档
 
 2.分包人与发包人的关系
 分包不得与发包或工程师发生直接工作联系，不得直 接致函发包或工程师，不得直接接受发包或工程师指令。 3.分包工程范围内，承包人随时可以发指令。 4.分包人的工作
 (2)完成规定的设计内容，承包人承担费用。 (3)向承包提供进度计划及进度统计报表; (4)向承包提交施工组织设计。 (5)按规定办理交通、噪声、环保、安全文明等手续，
 承包人承担费用; (7)竣工交付前，负责成品保护。
 
 三、合同价款及支付
 2.分包合同价款与总包合同相应部分无任何连带关系。
 3(5)承包人应在收到分包竣工结算报告及结算资料 后28天内支付结算价款。
 四、禁止转包或再分包
 1.专业分包不得将工程转包，也不得再分包。 2.专业分包可以将劳务作业再分包。
 
 10. 按照《建设工程施工专业分包合同》，承包人的责任有 ( )。
 A. 保证施工期间分包工程施工所需的通道畅通 B. 组织分包工程的图纸会审和施工技术交底
 C. 直接接受业主或监理工程师的指令
 D. 按约定时间向承包人提交详细的施工组织设计 E. 负责已完工程的成品保护工作
 【答案】AB
 11. 根据《建设工程施工专业分包合同》(GF-2003 -0213)，下列说法错误的是( )。
 A. 发包人向分包人提供具备施工条件的施工场地 B. 分包人不可直接致函发包人或工程师
 C. 就分包范围内的有关工作，承包人随时可以向
 分包人发出指令
 D. 承包人应提供总包合同供分包查阅
 E. 按照合同约定，分包人完成规定的设计内容并
 承担由此发生的费用
 【答案】ADE
 */
#pragma mark  1Z206024 施工劳务分包合同的内容

/*

 一、承包人的主要义务——除了干活外的全部事情 1.组建项目管理班子。 2.向分包提供场地、道路、资料、临时设施。 3.负责编制施工组织设计，组织编制年季月施工计划、
 物资需用量计划表。 4.负责测量定位、沉降观测、技术交底，组织图纸会
 审，档案资料收集整理及交工验收。 5.按时提供图纸。
 6.向分包支付报酬。 7.负责与各单位联系协调。
 
 二、劳务分包人的主要义务——只会干活 2(1)科学安排作业计划。 2(2-3)加强安全教育、现场管理。
 三、保险 原则:自己的人、自己的设备，自己办保险 4.劳务分包必须为从事危险作业的职工办理意外
 伤害保险，并为施工场地内自有人员和施工机械设备
 办理保险，支付保险费。
 
 四、劳务报酬最终支付
 1.全部工作完成，经承包人认可后14天内，劳务 分包人向承包人递交完整的结算资料。
 2.承包人14天内核实，确认后14天内向劳务分包 人支付劳务报酬尾款。
 五、禁止转包或再分包
 劳务分包不得将劳务作业转包或再分包。(专业 分包可以将劳务作业再分包，P297)
 12. 根据《建设工程施工劳务分包合同(示范文本)》(GF- 2003-02414)，属于承包人工作的有( )。
 A. 负责编制施工组织设计
 B. 科学安排工作计划
 C. 组织编制年、季、月施工计划
 D. 负责工程测量定位
 E. 负责与监理、设计及有关部门联系
 【答案】ACDE
 13. 根据《建设工程施工劳务分包合同(示范文本)》 (GF-2003-0214)，从事危险作业职工的意外伤害保险 应由( )办理。
 A. 发包人
 B. 施工承包人 C. 专业分包人 D. 劳务分包人
 【答案】D
 */
#pragma mark  1Z206025 项目总承包合同的内容

/*

 1.项目总承包的责任义务
 (1)完成设计、采购、施工、竣工试验; (2)自费修复各种缺陷; (3)编制项目进度计划; (4)开工15日前向发包人提交施工组织设计; (5)开工20日前，通知发包人办理开工批准、施
 工许可证、质量监督等许可; (6)提前10日，通知发包人办理临时用地、临时
 水电路许可等有关手续; (7)提供新发现的障碍资料。
 
 2.发包人的权利义务
 (1)负责办理项目审批、备案手续，取得用地使用权， 完成拆迁补偿，提供立项文件。
 (2)履行合同约定的价格调整、付款、结算义务。 (3)有权提建议、修改、变更，赔偿，发暂停通知。 (4)提供基础资料、已有障碍资料。 (5)办理开工批准、施工许可证、质量监督等许可; (6)联系协调处理文物、古树、化石、坟墓，承担相关
 费用，工期顺延; (7)20日内确认安全环保等管理计划。
 
 14. 根据《建设项目工程总承包合同示范文本(试行)》 (GF-2011-0216)，发包人的义务是( )。
 A. 组织竣工试验
 B. 提交临时占地资料
 C. 负责办理项目备案手续 D. 提供设计审查所需的资料
 【答案】C
 */
#pragma mark  1Z206026 工程监理合同的内容

/*

 一、监理工作内容(与P75-76结合学)
 1. 编制监理规划、监理实施细则;
 4. 审查施工组织设计是否符合强制性标准; 13. 审核、签发或出具工程款支付证书;
 14. 在巡视、旁站和平行检验;
 17. 验收隐蔽工程、分部分项工程;
 19. 编写工程质量评估报告;
 20. 参加工程竣工验收，签署竣工验收意见。
 二、监理机构人员规定
 更换总监，提前7天向委托人书面报告;
 更换其他监理，通知委托人。
 (P61 更换项目经理:14天，14+28天)
 三、监理人的职责
 紧急情况，为确保安全，监理人应在发出指令后24 小时内书面报告委托人。(P61，项目经理48小时)
 
 */
#pragma mark   ******************************** 1Z206030 合同计价方式

/*

 */
#pragma mark  1Z206031 单价合同的运用

/*

 适合工程量一时不能明确的工程。
 实际支付的工程款=实际完成的工程量*合同单价
 单价优先。有明显错误，业主有权先修改再评标。
 总价单价不一致，以单价为准调整总价。
 业主和承包商都不存在工程量方面的风险。
 
 类型
  固定单价合同
 适用于工期较短、工程量变化幅度不会太大的项目。
  变动单价合同 适用的三种情况:实际工程量发生较大变化、通货
 膨胀达到一定水平、国家政策发生变化。
 1. 某按单价合同计价的招标工程，在评标过程中，发现 某投标人的总价与单价的计算结果不一致，究其原因是 投标人在计算时，将混凝土单价300元/m3误作为30元 /m3的结果。对此，业主有权(  )。
 A. 以总价为准调整单价
 B. 要求投标者重新提报混凝土单价 C. 以单价为准调整总价
 D. 将该投标文件作废标处理
 【答案】C
 2. 当建设工程施工承包合同的计价方式采用变动单价时， 合同中可以约定合同单价调整的情况有( )。
 A. 工程量发生比较大的变化
 B. 承包商自身成本发生比较大的变化 C. 业主资金不到位
 D. 通货膨胀达到一定水平
 E. 国家相关政策发生变化
 【答案】ADE
 */
#pragma mark 1Z206032 总价合同的运用

/*
 
 一、总价合同的含义
 也称总价包干合同，当施工内容和有关条件不变
 时，价款总额不变。
 二、固定总价合同
 承包商承担了全部的工程量和价格的风险。
 价格风险:价算错，漏报，物价、人工费上涨;
 工作量风险:量算错，工程范围不确定，工程变
 更，设计深度不够。
 
 固定总价合同价格调整的情况:重大工程变更、
 累计工程变更超过一定幅度、其他特殊条件。
 适用范围:
 (1)量小、期短; (2)设计详细，图纸完整; (3)工程结构和技术简单，风险小; (4)投标期相对宽裕。 (5)施工期限一年左右的项目。
 
 三、变动总价合同——可调总价合同 适用的四种情况:通货膨胀、设计变更、工程量
 变化、工程条件变化。
 建设周期一年半以上的项目，应考虑下列因素引
 起的价格变化: (1)劳务工资、材料费上涨; (2)运输费、燃料费、电力等价格变化; (3)外汇汇率不稳定; (4)国家立法改变引起工程费用上涨。
 四、总价合同特点
 (1) 可以较早确定或者预测工程成本;
 (2) 业主风险小，承包人风险大;
 (3) 易于迅速确定最低报价的投标人;
 (4) 进度上能极大地调动承包人的积极性;
 (5) 发包单位能更容易、更有把握对项目进行控制; (6) 必须完整明确规定承包人的工作;
 (7) 必须将设计和施工的变化控制在最小限度内。
 
 3. 在下列合同形式中，承包人承担风险最大的合同类型 是( )。
 A. 固定总价合同
 B. 固定单价合同
 C. 成本加固定费用合同 D. 最大成本加费用合同
 【答案】A
 4. 投标人在投标以固定总价合同的计价形式发包 的建设工程项目时，需要认真地考虑( )等价 格风险对报价的影响。
 A. 工程量计算错误 B. 漏报项目 C. 设计误差 D. 工程变更 E. 人工费上涨
 【答案】BE
 5. 在变动总价合同中，一般由于( )所引起的费用变化 可以进行调整。
 A. 一周内停电6h
 B. 设计变更
 C. 工程量误差
 D. 由于通货膨胀等原因而使所使用的工、料成本增加 E. 其他工程条件变化所引起的费用变化
 【答案】BDE
 */
#pragma mark 1Z206033 成本加酬金合同的运用

/*
 一、含义——成本补偿合同
 承包商不承担任何价格或工程量变化的风险。
 二、特点和适用条件 1.适用条件(应用)
 (1)工程特别复杂，工程技术、结构方案不能预先确 定，或尽管可以确定但不能竞争性招标，如研究开发项 目;
 (2)时间特别紧迫，如抢险救灾工程; (3)施工总管、CM、项目管理合同、咨询服务合同。
 
 2.对业主的优点
 (1)分段施工缩短工期; (2)减少承包商对立情绪; (3)利用承包商的技术专家，弥补设计不足; (4)根据自身力量和需要，较深入地介入和控制施工
 和管理; (5)约束成本不超过限值，转移一部分风险。
 3.对承包商的特点 优点:风险低，利润比较有保证 缺点:合同不确定性大
 三、形式 (1)成本加固定费用合同——成本估计不准，可能变
 化不大。 (2)成本加固定比例费用合同——很难描述工程范围，
 或工期紧迫，无法按常规编制招标文件招标。 (3)成本加奖金合同——准备不充分，仅能制定一个 估算指标。规定底点和顶点，最大罚款不超过最高酬金。
 (4)最大成本加费用合同——设计深度达到可以报总 价，包括管理费、风险费、利润。在非代理型(风险型)CM 模式中应用。
 6. 关于成本加酬金合同适用条件的说法，正确的有( )。 A. 采用这种合同承包商不承担任何价格变化和工程量变
 化的风险(特点)
 B. 这种合同适用于时间紧迫的抢险救灾工程
 C. 这种合同适用于工程设计详细，图纸完整、清楚
 D. 这种合同适用于技术简单，结构方案容易确定的工程 E. 特别复杂，工程技术、结构方案不能预先确定的工程
 【答案】BE
 7. 对业主而言，成本加酬金合同的优点有( )。 A. 可以通过分段施工缩短工期
 B. 可以转移全部的风险，对业主投资控制有利 C. 业主可以根据自身力量和需要，较深入地介
 入和控制工程施工和管理
 D. 风险低，利润比较有保证
 E. 可以利用承包商的施工技术专家，帮助改进
 或弥补设计的不足
 【答案】ACE
 8. 成本加酬金合同主要形式有( )。 A. 工程成本总价合同
 B. 成本加固定费用合同
 C. 成本加固定比例费用合同
 D. 成本加奖金合同
 E. 最小成本加费用合同
 【答案】BCD
 9. 在工程成本总价基础上加固定酬金，包括了各项管理费、风 险费和利润，而且在非代理型CM模式中常采用的合同方式为 ( )。
 A. 成本加固定费用合同
 B. 成本加固定比例费用合同 C. 成本加奖金合同
 D. 最大成本加费用合同
 【答案】D
 */
#pragma mark  ******************************** 1Z206040 建设工程施工合同风险管理、 工程保险和工程担保

/*
 
 */
#pragma mark 1Z206041 施工合同风险管理

/*
 
 1.工程合同风险的分类
 按原因分:合同工程风险(客观、非主观故意导致)、
 合同信用风险(主观故意导致)。
 按阶段分:合同订立风险、合同履约风险。
 2.工程合同风险产生的原因——合同的不完全性 个人有限理性、环境不确定性、信息不对称、交易
 成本(成本高于收益)、机会主义行为(损人利己)
 
 3.施工合同风险的类型 (1)环境风险(政治、经济、法律、自然环境) (2)成员资信能力风险(业主、承包、分包、供货、
 政府、周边居民) (3)管理风险(环境调查预测，合同条款、工程范
 围标准，投标策略，设计方案计划措施，实施过程)
 4.工程合同风险分配原则
 (1)业主对风险的分配起主导作用; (2)效率原则、公平原则。
 
 1.工程合同风险产生的原因包括( )。 A. 合同的不确定性
 B. 交易成本的存在
 C. 业主拖欠工程款
 D. 机会主义行为的存在
 E. 条件的不对称
 【答案】ABD
 2. 下列施工合同风险中，属于管理风险的是(  )。 A. 业主改变设计方案
 B. 对环境调查和预测的风险
 C. 自然环境的变化
 D. 合同所依据环境的变化
 E. 合同条款不严密
 【答案】BE
 */
#pragma mark  1Z206042 工程保险的内容

/*

 一、保险概述 1.保险标的
 保险保障的目标和实体。
 2.保险金额
 保额，保险人承担赔偿或给付保险金责任的最高限额。
 3.保险费
 保费，投保人支付给保险人的价金。
 4.保险责任
 分为基本责任和特约责任。
 保险合同内都有除外责任条款，除外责任属于免赔责任，
 比较一致的有以下几项:
 (1)投保人故意行为所造成的损失; (2)因被保险人不忠实履行约定义务所造成的损失; (3)战争或军事行为所造成的损失; (4)保险责任范围以外，其他原因所造成的损失。
 三、工程保险种类 1.工程一切险
 包括建筑工程一切险、安装工程一切险，以双方名 义投标。国内由项目法人办理，国外由承包人办理。 2.第三者责任险
 指施工原因导致项目法人和承包人以外的第三人受
 到财产损失或人身伤害的赔偿。
 被保险人是项目法人和承包人，一般附加在工程一
 切险中。
 工地财产损失、职工伤亡，不属于第三者责任险，
 而属于工程一切险和人身意外伤害险。
 
 3.人身意外伤害险 4.承包人设备保险 5.执业责任险 6.CIP保险——一揽子保险
 包括:劳工赔偿、雇主责任险、一般责任险、建筑
 工程一切险、安装工程一切险。
 优点:最优价格、最佳保障;有效风险管理;降低
 赔付率、降低保险费率;避免诉讼，便于索赔。
 3. 各类保险合同由于标的的差异，除外责任比较一致的有 ( )。
 A. 责任不尽相同
 B. 投保人故意行为所造成的损失
 C. 因被保险人不忠实履行约定义务所造成的损失 D. 战争或军事行为所造成的损失
 E. 项目法人和承包人以外的第三人受到的财产损失
 【答案】BCD
 4. 按照国际惯例以及国内合同范本的要求，施工合同 的通用条款对于易发生重大风险事件的投保范围作了 明确规定，投保范围包括( )。
 A. 工程一切险 B. 第三者责任险 C. 人身意外伤害险 D. 承包人设备保险 E. 交通意外险
 【答案】ABCD
 5. 由业主或承包商统一购买“一揽子保险”，保障范围覆 盖业主、承包商及所有分包商，内容包括( )。
 A. 职工寿险 B. 劳工赔偿
 C. 雇主责任险 D. 执业责任险 E. 建筑工程一切险
 【答案】BCE
 */
#pragma mark 1Z206043 工程担保的内容

/*
 
 一、担保方式
 保证:保证人履行债务或承担责任; 抵押:不转移对所拥有财产(动产、不动产)的占有; 质押:将质押物(动产、权利)移交债权人占有; 留置:债权人按(保管、运输、加工)合同约定占有债
 务人的动产;
 定金:给付方不履行，无权要求返还;收受方不履行，
 双倍返还。
 工程担保中大量采用保证担保。
 
 种类
 含义
 形式
 比例\特点
 作用
 投标 担保
 投标 向招标
 保函、担 保、保证金
 2%,80万,30天; 2%; 2%,10万
 保证中标签合同
 ，筛选投保人
 履约 担保
 投标 向招标
 保函、担
 保、保证金
 、保留金
 10%
 促使承包商履行 合同约定
 预付 款担
 保
 承包 向发包
 保函、担 保、抵押
 =预付款 逐月减少
 保证偿还发包人 的预付款
 支付 担保
 发包 向承包
 保函、担 保、保证金
 20%-25% 分段滚动
 确保工程款支付
 到位，解决拖欠
 
 履约担保的重点语句:
 1.履约担保是最重要、担保金额最大的工程担保。 2.履约担保有效期从开工到竣工交付或保修期满。 3.保修担保，可采用保留金方式。 4.建筑行业倾向于采用有条件保函。 5.由担保公司或保险公司开具履约担保书。 6.履约保证金大小取决于招标项目的类型与规模。
 在投标须知中，规定使用哪种形式的履约担保。 7.发包人要求承包人提供履约担保的，发包人应当
 向承包人提供支付担保。
 6. 下列工程担保中，以保护承包人合法权益为目的 的是( )。
 A. 投标担保 B. 支付担保 C. 履约担保 D. 预付款担保
 【答案】B
 7. 关于履约担保的说法，正确的有( )。
 A. 建筑业倾向于采用无条件银行保函作为履约担保 B. 由商业银行或保险公司开具履约担保书
 C. 履约担保有效期自开工至竣工交付或保修期满之日 D. 发包人要求承包人提供支付担保的，发包人应当为
 承包人提供履约担保
 E. 在投标须知中，发包人要规定履约担保的形式
 【答案】CE
 8. 我国投标担保可以采用的担保方式有( )。 A. 银行保函 B. 抵押
 C. 担保公司担保书 D. 保留金
 E. 履约保证金
 【答案】AC
 */
#pragma mark  ******************************** 1Z206050 建设工程施工合同实施

/*
 
 */
#pragma mark 1Z206051 施工合同分析的任务

/*
 
 一、合同分析的含义
 由企业合同管理部门或项目合同管理人员负责。
 二、合同分析的作用
 1.分析漏洞，解释争议 2.分析风险，制定对策 3.任务分解、落实
 
 三、合同分析的内容
 2. 承包人的主要任务
 (1)总任务，即合同标的。 (2)工作范围。由工程量清单、图纸、工程说明、
 技术规范定义。
 (3)工程变更。
 1 补偿范围，百分比越大，承包人风险越大。 2 索赔有效期，时间越短，对承包人越不利。
 
 3. 发包人的责任——合作责任 (1)业主雇用工程师并委托其履行部分合同责任; (2)对平行的各承包人和供应商之间的责任界限作
 出划分，争议裁决、工作协调; (3)及时作出承包人履行合同所必需的决策，如下
 达指令，履行批准、认可、答复、检查、验收手续; (4)提供施工条件，如资料、图纸、场地、道路; (5)及时支付工程款，及时接收已完工程。
 4. 合同价格 重点分析:计价方法、计量程序、价格调整和拖欠
 工程款责任。
 7. 验收、移交和保修
 在合同分析中，应对重要的验收要求、时间、程序
 和法律后果作说明。
 竣工验收合格即办理移交。
 移交表示:
 (1)业主认可并接收工程，承包人施工任务完结; (2)工程所有权转让; (3)承包人照管责任结束和业主照管责任开始; (4)保修责任开始; (5)合同规定的工程款支付条款有效。
 
 1. 合同分析的目的和作用表现在( )等方面。 A. 根据合同要求制订投标策略
 B. 分析合同中的漏洞，解释有争议部分
 C. 分析合同风险，制订风险管理对策
 D. 分解合同任务，并落实到具体的部门、人员 E. 总结合同执行情况，完善竣工验收报告
 【答案】BCD
 2. 在合同分析中，应明确工程变更的补偿范围，工程 变更补偿范围通常以合同金额一定的百分比表示，百 分比越大，则( )。
 A. 合同金额越高 B. 承包商利润越高
 C. 承包商风险越大 D. 对承包商补偿越多
 【答案】C
 3. 在施工合同分析中，发包人的合作责任有( )。   A. 施工现场的管理，给发包人的管理人员提供生 活和工作条件
 B. 及时提供设计资料，图纸，施工场地等   C. 按合同规定及时支付工程款
 D. 对平行的各承包人和供应商之间的责任界限做 出划分
 E. 及时作出承包人履行合同所必需的决策
 【答案】BCDE
 */
#pragma mark 1Z206052 施工合同交底的任务

/*
 
 “合同交底”，即合同管理人员向各层次管理者或者 说向项目管理人员和各个工程小组交底。
 项目经理或合同管理人员将责任分解落实到工作小
 组、人员或分包单位。
 合同交底的目的和任务:
 (1)内容达成一致理解;
 (2)责任分解落实到人; (3-9)明确质量、工期、成本、逻辑、责任、后果、
 义务。
 
 4. 在施工合同实施中，“项目经理将各种任务的责任分解， 并落实到具体人员”这一活动属于( )的内容。
 A. 合同交底 B. 合同分析
 C. 合同跟踪 D. 合同实施阶段
 【答案】A
 */
#pragma mark 1Z206053 施工合同实施的控制

/*
 
 一、施工合同跟踪 1.含义
 1)承包单位职能部门对合同执行者跟踪、监督和检查;
 2)合同执行者本身对执行情况跟踪、检查与对比。
 2.依据
 合同、计划文件、实际工程文件、现场情况
 3.对象
 1)承包的任务; 2)工程小组或分包的工作; 3)业主和工程师的工作。
 
 二、合同实施的偏差分析 1.原因分析
 可采用鱼刺图、因果关系分析图(表)、成本量差、 价差、效率差分析等方法。
 2.责任分析
 责任分析必须以合同为依据
 3.趋势分析
 最终工程状况(工期延误、成本超支...)、最终经济效 益、承包商后果(被罚款、清算、起诉...)
 
 5. 施工合同签订后，承包人应对施工合同进行跟踪，跟踪 的对象包括( )等。
 A. 业主的工作 B. 工程师的工作 C. 设计人的工作 D. 承包人的工作 E. 工程分包人的工作
 【答案】ABDE
 6. 合同实施偏差分析的内容不包括以下( )方面。 A. 产生偏差的原因分析
 B. 合同实施偏差的责任分析
 C. 合同实施趋势分析
 D. 合同实施偏差的处理结果
 【答案】D
 三、工程变更管理 1.变更范围
 (1)增加或减少任何工作，或追加额外的工作; (2)取消任何工作，但转由他人实施的工作除外; (3)改变任何工作的质量标准或其他特性; (4)改变工程的标高、基线、位置和尺寸; (5)改变工程的时间安排或实施顺序。
 
 2.变更程序 (1)提出
 ——业主、承包、设计(仅此三方) (2)批准
 承包商提出，工程师审查并批准;
 设计方提出，业主审查并批准;
 业主方提出，通过工程师发出。
 (3)执行
 根据工程惯例，除非工程师明显超越合同权限，
 承包人应无条件地执行工程变更的指示。
 
 3.责任分析
 (1)业主、政府、环境、不可抗力、原设计错误等 导致的设计修改，由业主承担责任。
 (2)施工过程、施工方案出现错误、疏忽导致设计 修改，由承包人承担责任。
 (3)施工方案变更要经工程师批准。
 7. 根据工程实施的实际情况，可以提出工程变更的 单位有( )。
 A. 承包商 B. 供应商 C. 业主方 D. 造价部门 E. 设计方
 【答案】ACE
 */
#pragma mark 1Z206054 施工分包管理的方法

/*
 
 1.分包管理的责任主体
 第一责任主体是施工总包或施工总管。 2.分包管理的内容——三控三管+人员管理
 对业主指定的分包支付工程款，一定要在收到业主 的工程款之后才能支付，并应扣除管理费、配合费和质量 保证金。
 3.分包管理的方法
 建立工程例会制度，及时反映和处理分包单位出现
 的各种问题。
 
 8. 对施工分包单位进行管理的说法，不正确的有( )。
 A. 对业主指定分包进行管理的第一责任主体是业主
 B. 总承包单位要积极为分包工程的施工创造条件，协调
 好各分包单位之间的关系
 C. 对业主指定的分包，一定要在收到业主的工程款之
 后才能支付工程款
 D. 总承包单位建立工地例会制度，及时处理分包单位
 施工过程中出现的问题
 【答案】A
 */
#pragma mark  1Z206055 施工合同履行过程中的诚信自律

/*

 诚信行为记录在诚信信息平台统一公布。 良好行为记录:公布期限一般为3年。 不良行为记录:资质、承揽业务(不正当手段承揽、
 串标、骗标、不按合同履行义务、转包、违法分包)、 工程质量、工程安全、拖欠工程款或工人工资。公布时 间为行政处罚决定作出后7日内，公布期限一般为6个月 至3年。
 不良行为记录整改确有实效的，提出申请，经批准， 可缩短公布期限，但最短不得少于3个月。
 
 9. 根据《建筑市场诚信行为信息管理办法》，不良行为记录 信息公布期限一般为( )。
 A. 1年~3年 B. 6个月~3年 C. 3个月~3年 D. 3年以上
 【答案】B
 10. 根据《全国建筑市场各方主体不良行为记录认定标准》， 施工企业承揽业务中的不良行为包括( )。
 A. 允许其他单位或个人以本单位名义承揽工程
 B. 未按照节能设计进行施工
 C. 以他人名义投标或者以其他方式弄虚作假，骗取中标 D. 不按照与招标人订立的合同履行义务，情节严重
 E. 将承包的工程转包或者违法分包
 【答案】CDE
 */
#pragma mark  ******************************** 1Z206060 建设工程索赔

/*
 
 */
#pragma mark 1Z206061 索赔的依据

/*
 
 一、索赔的分类
 2. 按目的和要求分
 (1)工期索赔
 (2)费用索赔
 3. 按事件性质分
 (5)不可预见。一个有经验的承包商通常不能预见 的外界障碍或条件，导致承包人损失，由发包人承担。
 (6)不可抗力。工期“顺延”，费用各自承担。
 
 二、索赔成立的前提条件
 1. 事件已造成承包人成本额外支出，或直接工期损失; 2. 不属于承包人的行为或风险责任;
 3. 承包人按合同规定的程序、时间提交索赔意向通知和
 索赔报告。
 以上三个条件必须同时具备，缺一不可。
 三、索赔的依据
 合同文件(最主要，协中投专通标准图纸清单预算书)、
 法律法规、工程建设惯例
 
 1. 在施工期间，承包商可能遇到不能预见的地下岩石，导致 工期拖延，这类风险应由( )承担。
 A. 发包人 B. 承包人
 C. 发包人和承包人共同 D. 监理工程师
 【答案】A
 2. 关于建设工程索赔成立的条件，下列说法中正确的是 ( )。
 A. 导致索赔的事件必须是对方的过错，索赔才能成立
 B. 只要对方有过错，不管是否造成损失，索赔都可以 成立
 C. 只要索赔事件的事实存在，在合同有效期内任何时 候提出索赔都可以成立
 D. 不按合同规定的程序提交索赔报告，索赔不能成立
 【答案】D
 3. 下列工程资料中，可以作为承包人向业主索赔依据的是 ( )。
 A. 承包人与分包人签订的分包合同
 B. 承包人安全交底会议纪要
 C. 承包人技术交底纪要
 D. 合同履行中发包人和承包人洽商形成的协议
 【答案】D
 */
#pragma mark  1Z206062 索赔的方法

/*

 一、索赔程序
 发生索赔事件，或发现索赔机会，28天内提出索赔 意向通知。(索赔的第一步)
 发出索赔意向通知后，28天内提交索赔文件和有关 资料(索赔报告)。
 干扰事件影响持续时间长，合理时间间隔(一般为 28天)，提交中间索赔报告;
 干扰事件影响结束后28天，提交最终索赔报告。
 
 二、索赔文件的主要内容
 (1)总述 (2)论证，关键部分 (3)计算
 (4)证据
 四-六、索赔文件的核查
 索赔文件由工程师审核，发包人审查。
 工程师提出的初步处理意见，发承包一方或双方不
 接受，三方进行协商。
 七、反索赔的基本内容
 包括两方面:一是防止对方提出索赔，
 二是反击或反驳对方的索赔要求。
 索赔、反索赔都是双向的。P335
 八、对索赔报告的反击或反驳要点
 1.时限性; 2.真实性; 3.原因、责任; 4.理由;
 5.证据; 6.索赔值审核——审核重点:计算方法、取费、
 有无重复计算、计算结果是否准确。
 
 4. 工程施工过程中发生索赔事件以后，承包人首先要 做的工作是( )。
 A. 向监理工程师提出索赔证据 B. 提交索赔报告
 C. 提出索赔意向通知
 D. 与业主就索赔事项进行谈判
 【答案】C
 5. 关于建设工程反索赔的说法，正确的有( )。 A. 反索赔是双向的
 B. 工程师对索赔文件的审核是反索赔的工作内容之一 C. 审核索赔报告的时限性是反索赔的要点之一
 D. 调查分析并确定索赔事件的原因和责任，是反索赔
 的工作内容之一
 E. 反索赔工作就是反击或反驳对方的索赔要求
 【答案】ACD
 */
#pragma mark  1Z206063 索赔费用的计算

/*

 一、索赔费用的组成 1.人工费。非承包商责任工程延期，窝工费。 2.材料费。实际用量超过计划用量;客观原因导致
 材料价格大幅上涨;非承包商责任工程延期导致材料价
 格上涨和超期储存费。
 3.施工机械使用费。窝工费的计算，租赁，按租金 和调进调出费;自有，按台班折旧费。
 
 7. 总部(企业)管理费
 (3)以工程延期的总天数为基础，计算步骤:
 对某一工程提取的管理费=同期内公司的总管理费 ×(该工程的合同额/同期内公司的总合同额)
 该工程的每日管理费=该工程向总部上缴的管理费/ 合同实施天数
 索赔的总部管理费=该工程的每日管理费×工程延期 的天数
 8.利润
 工程范围变更、文件缺陷、技术错误、业主未能提供
 现场，可列入利润。
 工程暂停不能索赔利润。
 利润计算与原报价单中利润百分率保持一致。
 二、索赔费用的计算方法 1.实际费用法
 最常用。以实际开支为根据。
 
 6. 按照国际惯例，承包商可索赔的材料费包括( )。 A. 由于索赔事项导致材料实际用量超过计划用量而
 增加的材料费
 B. 由于客观原因造成材料价格大幅度上涨而增加的
 材料费
 C. 由于承包商管理不善，造成材料损坏失效引起的
 损失费
 D. 承包商使用不合格材料引起的损失费
 E. 由于非承包商责任造成工期延误而导致的材料价
 格上涨和超期储存费
 【答案】ABE
 7. 某工程因发包人原因造成承包人自有施工机械窝工10天， 该机械市场租赁费为1200元/天，进出场费2000元，台班费 400元/台班，其中台班折旧费160元/台班; 计划每天工作 1台班，共使用40天，则承包人索赔成立的费用是( )元 。
 A. 1600 B. 4000
 C. 12000 D. 12500
 【答案】A
 8. 某国际工程合同额为5000万元人民币，合同实施天数为 300天;由国内某承包商总承包施工，该承包商同期内公司 的总合同额为5亿人民币，同期内公司的总管理费为1500万 元;因业主修改设计，承包商要求工期延期30天。该工程项 目部在施工索赔中总部管理费的索赔额是( )万元。
 A. 50 B. 15
 C. 12 D. 10
 【答案】B 【解析】该工程向总部上缴的管理费=1500×5000/50000
 =150万 索赔的总部管理费=30×150/300=15万
 
 */
#pragma mark 1Z206064 工期索赔的计算

/*
 
 一、工期延误的分类 1.按结果分——可索赔延误、不可索赔延误。 2.按线路分——关键线路延误、非关键线路延误。
 关键线路，非承包商原因，可索赔。
 非关键线路，取决于总时差大小和延误时间长短。
 如果延误时间少于总时差，业主一般不会给予工期
 顺延，但可能给予费用补偿;
 如果延误时间大于总时差，非关键线路工作转化为
 关键工作，成为可索赔延误。
 
 3.按关联性划分 (1)单一延误——某一延误事件从发生到终止，没
 有其他延误事件发生。——可不可赔，看谁责任。 (2)共同延误——两个或两个以上延误事件从发生
 到终止的时间完全相同。 ——延误事件全是业主的，可赔; ——延误事件全是承包商的，不可赔; ——延误事件业主和承包商都有，可赔变成不可赔。
 (3)交叉延误——当两个或两个以上延误事件从发 生到终止只有部分时间重合。——不重合部分，参照单一 延误;重合部分，参照共同延误。
 
 三、工期索赔的计算方法 1. 直接法
 干扰事件直接发生在关键线路上。
 2. 比例分析法
 某工程的工程量由2800m3增加到3500m3，原定工期 是40天。
 工期索赔值=原工期×新增工程量/原工程量=40× (3500-2800)/2800=10天
 如果工程量增减10%为承包商应承担的风险，则: 工期索赔值=40×(3500-2800×110%)/2800=6天
 某工程合同价1200万元，总工期24个月，施工过程中 业主增加额外工程200万元。
 工期索赔值=原合同工期×附加或新增工程造价/原合 同总价=24×200/1200=4个月。
 3. 网络分析法——标号法
 9. 关于工期索赔，下列说法正确的是( )。 A. 单一延误是可索赔延误
 B. 共同延误是不可索赔延误
 C. 交叉延误可能是可索赔延误
 D. 非关键线路延误是不可索赔延误
 【答案】C
 10. 某土方工程合同约定，合同工期为60天，工程量增 减超过15%时，承包商可提出变更，实施中因业主提供 的地质资料不实，导致工程量3200m3增加到4800m3， 则承包商可索赔工期( )天。
 A. 30 B. 21 C. 16.5 D. 0
 【答案】B 【解析】工期索赔值=原工期×新增工程量/原工程量
 =60×(4800-3200 ×1.15)/3200=21
 
 */
#pragma mark  ******************************** 1Z206070 国际建设工程施工承包合同

/*
 
 
 */
#pragma mark 1Z206071 国际常用的施工承包合同条件

/*
 
 1. FIDIC系列 (1)《施工合同条件》，新红皮书
 由发包人或工程师设计的房屋建筑工程和土木工程。
 单价合同，某些子项包干。
 业主委派工程师:管理合同，监督进度、质量，签发
 支付、接收和履约证书，处理合同管理中的有关事项 。
 
 (2)《永久设备和设计—建造合同条件》，新黄皮书。 由承包商做绝大部分设计。 总价合同，法律、物价变化，价格可调。 工程师管理模式与《施工合同条件》类似。
 (3)《EPC交钥匙项目合同条件》，银皮书。
 承包商负责所有设计、采购和建造。
 固定总价合同，某些特定风险才调价。
 没有工程师，由业主或业主代表取代。
 
 (4)《简明合同格式》 适用于投资额较低、不需要分包或投资额较高、但
 工作内容简单、重复，或建设周期短。
 采用单价合同、总价合同或其他方式。
 2. 英国JCT
 适用于施工总包、DB、MC模式。属于总价合同。
 JCT98的适用条件:
 (5)执行速度较慢;
 (8)违约、质量缺陷由承包商承担，工期延误由业 主、承包商共同承担。
 
 3. 美国AIA
 分为A、B、C、D、F、G、INT系列。 A201，即施工合同通用条件，是AIA的核心文件。 主要用于私营的房屋建筑工程。 AIA中建筑师类似于红皮书中的工程师。但更强调
 建筑师维护业主的一面。
 建筑师的权力:检查权、支付确认权、文件审批权、
 编制变更指令权。
 1. 关于FIDIC《施工合同条件》的说法，正确的有( )。 A. 该合同主要用于发包人设计的或咨询工程师设计的
 房屋建筑工程和土木工程的施工项目
 B. 一般情况下，单价可随各类物价的波动而调整
 C. 合同计价方式属于单价合同，不包含任何包干价格 D. 由业主委派工程师管理合同
 E. 由业主监督工程进度、质量，签发支付证书、接受
 证书和履约证书，处理合同中的有关事项
 【答案】ABD
 2. 关于 FIDIC《永久设备和设计—建造合同条件》内容的说 法，正确的是( )。
 A. 业主委派工程师管理合同
 B. 承包商仅需负责提供设备和建造工作
 C. 合同计价采用单价合同方式，某些子项采用包干价格
 D. 合同计价采用总价合同方式，合同价格不能调整
 【答案】A
 3. FIDIC系列合同条件中，采用固定总价方式计价、只有 在出现某些特定风险时才能调整价格的合同是( )。
 A. 施工合同条件
 B. EPC交钥匙项目合同条件
 C. 永久设备和设计一建造合同条件 D. 简明合同格式
 【答案】B
 4. 美国建筑师学会 (AIA) 的合同条件主要用于( )工程。 A. 铁路和公路
 B. 私营的房屋建筑 C. 石油化工
 D. 大型基础设施
 【答案】B
 
 */
#pragma mark 1Z206072 施工承包合同争议的解决方式

/*
 
 1.协商
 最常见、最有效、最基本、首选。
 3.仲裁
 我国，实行一裁终局制。
 国际上，合同中约定是否一裁终局。
 特点:效率高、周期短、费用少、保密性、专业化。
 
 4. DAB(争端裁决委员会)方式——FIDIC中采用
 (1)DAB的任命
 由一人、三人或五人组成，有三种方式: 1)常任争端裁决委员会，在施工前任命; 2)特聘争端裁决委员会，发生争端时任命，一名
 或三名，发出最终决定时期满; 3)由工程师兼任。
 (2)DAB的报酬
 业主和承包商各支付一半。
 
 (3)DAB的优点
 1)可以在项目开始时就介入; 2)公正性、中立性，具有丰富施工经验; 3)周期短;
 4)费用低; 5)发包和承包自己选择，意见容易接受; 6)不强制，不终局。(28天内，仍可仲裁诉讼)
 
 5. 关于国际工程施工承包合同争议解决的说法，正确的 是( )。
 A. 国际工程施工承包合同中，仲裁实行一裁终局制
 B. 国际工程施工承包合同中，应首选诉讼作为解决争 议的方式
 C. 国际工程施工承包合同争议解决最有效方式是协商 D. FIDIC合同中，DAB提出的裁决是强制性的
 【答案】C
 6. 在国际工程承包合同中，采用DAB(争端裁决委员会) 方式解决争端的优点有( )。
 A. DAB委员由行政主管部门指派，裁决具有公正性、 中立性
 B. DAB委员可以在项目开始时就介入，了解项目管 理情况及存在的问题
 C. DAB的裁决具有终局性，避免二次纠纷 D. DAB的费用较低
 E. DAB解决纠纷的周期较短
 【答案】BDE
 
 */
#pragma mark - ****************************************************************** 1Z207000 项目信息管理 3
/*

 
 */
#pragma mark  ******************************** 1Z207010 建设工程项目信息管理的目的和任务

/*
 
 
 */
#pragma mark 1Z207011 项目信息管理的目的

/*
 
 我国建设工程项目管理中当前最薄弱的工作领域
 是信息管理。
 项目信息管理的目的旨在通过有效的项目信息传
 输的组织和控制为项目建设增值服务。
 
 1. 项目信息管理的目是通过对项目信息传输的 有效组织和控制，为项目的( )提供服务。
 A. 技术更新 B. 档案管理
 C. 信息管理 D. 建设增值
 【答案】D
 */
#pragma mark 1Z207012 项目信息管理的任务

/*
 1. 信息管理手册
 项目参建的各方都应编制各自的信息管理手册。
 信息管理手册的主要内容:(12条)
 任务、分工、分类、编码、模型、流程、工作
 平台使用规定、报表、报告、档案管理、保密制度。
 2. 信息管理部门的工作任务
 (1)编制信息管理手册，并进行必要的修改和补充; (2)协调和组织各工作部门的信息处理工作; (3)工作平台的建立和运行维护; (4)协同组织收集、处理信息和形成报表和报告; (5)档案管理。
 3. 信息工作流程
 (2)为形成各类报表和报告，收集、录入、审核、 加工、传输、发布信息。
 4. 基于互联网的信息处理平台
 信息管理的核心手段:基于互联网的信息处理平台。
 2. 关于信息管理手册内容的说法，正确的有(  )。 A. 信息管理部门负责编制信息管理手册
 B. 应编制项目参与各方通用的信息管理手册
 C. 信息管理手册中应包含工程档案管理制度
 D. 信息管理的任务分工表是信息管理手册的主要内容
 E. 信息管理手册应随项目进展而做必要的修改和补充
 【答案】ACDE
 3. 下列工作任务中，不属于信息管理部门的是( )。   A. 负责编制行业信息管理规范
 B. 负责信息处理工作平台的建立和运行维护   C. 负责工程档案管理
 D. 负责协调各部门的信息处理工作 【答案】A
 */
#pragma mark  ******************************** 1Z207020 建设工程项目信息的分类、 编码和处理方法

/*
 
 */
#pragma mark  1Z207021 项目信息的分类

/*

 1.信息分类:
 (1)按工作对象分;
 (2)按工作过程分;
 (3)按工作任务分; (4)按内容属性分，如组织、管理、经济、
 技术、法规类信息
 
 
 1.下列建设项目信息中，属于经济类信息的是( )。
 A. 编码信息 B. 质量控制信息
 C. 工作量控制信息 D. 设计技术信息
 【答案】C
 */
#pragma mark 1Z207022 项目信息编码的方法

/*
 
 一、各种用途的信息编码 (1)项目结构编码，依据项目结构图。 (2)组织结构编码，依据组织结构图。 (4)项目实施的工作项编码，应覆盖项目实施的
 工作任务目录的全部内容。
 (5)项目投资项编码(业主方)/成本项编码 (施工方)，并不是分部分项工程编码，应综合考虑 概算、预算、标底、合同价和工程款支付等因素，建 立统一的编码，服务于投资目标的动态控制。
 
 (6)项目进度项编码，应综合考虑不同层次、 不同深度和不同用途的进度计划工作项的需要，建 立统一的编码，服务于进度目标的动态控制。
 (8)合同编码，应参考项目的合同结构、分 类，应反映合同类型、项目结构和合同签订时间。
 (10)工程档案编码，应根据档案规定、项目 特点和实施单位需求等建立。
 需要进行编码组合。
 
 2.关于项目信息编码，下列说法正确的是(  )。 A. 项目的投资项编码，应按概预算定额确定的
 分部分项工程编码进行编码
 B. 项目实施的工作项编码，是对施工过程的编
 码，应覆盖项目施工全过程
 C. 项目管理组织结构编码，应依据项目管理的
 组织结构图，对每一工作部门进行编码
 D. 项目的进度项编码，应根据不同层次、不同
 深度的进度计划工作项的需要分别建立不同的编码
 【答案】C
 */
#pragma mark  ********************************  1Z207030 建设工程管理信息化 及建设工程项目管理信息系统的功能

/*
 
 */
#pragma mark  1Z207031 工程管理信息化

/*

 一、含义
 《国家信息化发展战略纲要》，是规范和指导
 未来10年国家信息化发展的纲领性文件。 二、意义
 工程管理信息化有利于提高项目的经济效益和
 社会效益，以达到为项目建设增值的目的。
 信息技术在工程管理中开发应用的意义:
 1)“存储相对集中”，有利于检索查询、版本统 一、文档管理;
 2)“程序化”，有利于提高准确性、效率; 3)“数字化和电子化”，抗干扰、保真和保密; 4)“便捷”、“透明”、“扁平”，有利于信息
 交流、协同工作。
 
 三、项目信息门户 项目信息门户PIP，是信息化的重要标志。 项目管理信息系统PMIS，用于项目的目标控制。 管理信息系统MIS，用于企业的人、财、物、产、
 供、销管理。
 
 1. 类型:PSWS模式，专用门户;ASP模式， 公用门户(国际主流)。
 2. 实施条件:(1)组织件;(2)教育件; (3)软件;(4)硬件。组织件最重要。
 3. 运行周期:全寿命期。
 4. 核心功能:信息交流、文档管理，共同工作。 5. 主持者 :业主方、工程顾问公司
 
 1. 规范和指导未来10年国家信息化发展的纲领性 文件是( )。
 A. 建筑信息模型
 B. 国家信息化发展战略纲要
 C. 信息管理手册
 D. 2006-2020年国家信息化发展战略
 【答案】B 【解析】《纲要》是对《2006-2020年国家信息 化发展战略》的调整和发展。
 2. 建设工程的项目信息门户是基于互联网技术的 重要管理工具。可以作为一个建设工程服务的项 目信息门户主持者的是( )。
 A. 建设行政主管部门 B. 设计单位
 C. 业主委托的工程顾问公司 D. 施工单位
 【答案】C
 */
#pragma mark 1Z207032 工程项目管理信息系统的功能

/*
 一、项目管理信息系统的内涵 与P361结合学习
 项目管理信息系统是项目进展的跟踪控制系统，
 也是信息流的跟踪系统。
 项目管理信息系统可以在局域网或基于互联网的
 信息平台上运行。
 
 二、项目管理信息系统的功能——关键词 (1)投资控制——项目估算、概算、预算、标
 底、合同价、投资使用计划、实际投资、投入、投资
 (2)成本控制——投标估算、成本
 (3)进度控制——网络计划、关键工作、关键 线路、横道图、资源需求量、进度
 (4)合同管理——合同查询、分析、起草
 
 3. 建设工程项目管理信息系统(PMIS)是利用计算机辅 助进行项目管理的信息系统，它( )。
 A. 主要用于项目的人、财、物的管理 B. 主要用于企业的产、供、销的管理 C. 是项目进展的跟踪和控制系统
 D. 是项目信息门户(PIP)的一种方式
 【答案】C
 4. 项目管理信息系统中，进度控制的功能有( )。 A. 编制资源需求量计划
 B. 根据工程进展进行施工成本预测
 C. 进度计划执行情况的比较分析
 D. 项目估算的数据计算
 E. 确定关键工作和关键路线
 【答案】ACE
 5. 工程项目管理信息系统中，合同管理子系统的功能 有( )。
 A. 合同基本数据查询
 B. 合同执行情况统计分析
 C. 合同通用条件的编写    D. 合同结构的选择    E. 合同辅助起草 【答案】ABE
 
 */
