#pragma mark - 1K400000 市政公用工程管理与实务
#pragma mark - ****************************************************************** 第一部分 1K410000 市政公用工程技术  (选择+案例) 63
/*
 
 材料特性
 
 施工技术
 
 质量检查与验收
 
 */
#pragma mark  ****************************************** 1K411000 1、城镇道路工程 11
#pragma mark  ***************************** 1K411010 城镇道路工程结构与材料 【选择题】
#pragma mark  ******************* 1K411011城镇道路分类与分级

 
#pragma mark  ********* 一、城镇道路分类
 
#pragma mark  ********* 二、城镇道路分级
 
#pragma mark  ********* 三、城镇道路路面分类

#pragma mark  ******************* 1K411012沥青路面结构组成特点
#pragma mark  ********* 一、结构组成
#pragma mark  ********* 二、结构层与性能要求
#pragma mark  ********* 二. 沥青路面性能要求

#pragma mark  ******************* 1K411013水泥混凝土路面构造特点
#pragma mark  ********* 一、构造特点
#pragma mark  ********* 二. 基层
#pragma mark  ********* 二、主要原材料选择

#pragma mark  ******************* 1K411014沥青混合料组成与材料
#pragma mark  ********* 一、结构组成与分类
#pragma mark  ********* 一. 结构组成
#pragma mark  ********* 三、热拌沥青混合料主要类型(适用)
#pragma mark  *********

#pragma mark  ******************* 1K411015 沥青路面材料的再生应用

#pragma mark  ******************* 1K411016不同形式挡土墙的结构特点
#pragma mark  ********* 一、常见挡土墙的结构形式及特点

#pragma mark  *******************
#pragma mark  *********


#pragma mark  ***************************** 1K411020 城镇道路路基施工

#pragma mark  ******************* 1K411021 城镇道路路基施工技术
#pragma mark  *********

#pragma mark  ******************* 1K411022 城镇道路路基压实作业要点 【案例题】
#pragma mark  *********

#pragma mark  ******************* 1K411023 岩土分类与不良土质处理方法 【出题可能性不大】
#pragma mark  *********

#pragma mark  ******************* 1K411024 水对城镇道路路基的危害 【出题可能性不大】
#pragma mark  *********

#pragma mark  ***************************** 1K411030 城镇道路基层施工

#pragma mark  ******************* 1K411031 不同无机结合料稳定基层特性
#pragma mark  *********

#pragma mark  ******************* 1K411032 城镇道路基层施工技术【案例】
#pragma mark  *********

#pragma mark  ******************* 1K411033 土工合成材料的应用 【选择题】
#pragma mark  *********

#pragma mark  ***************************** 1K411040 城镇道路面层施工

#pragma mark  ******************* 1K411041 沥青混合料面层施工技术
#pragma mark  *********

#pragma mark  ******************* 1K411042 改性沥青混合料面层施工技术
#pragma mark  *********

#pragma mark  ******************* 1K411043 水泥混凝土路面施工技术
#pragma mark  *********

#pragma mark  ******************* 1K411044 城镇道路大修维护技术要点 【已考过 非重点】
#pragma mark  *********

 /*
  
  
 */
#pragma mark  *******************  1K411045 路面改造施工技术
#pragma mark

#pragma mark

#pragma mark  ****************************************** 1K412000 2、城市桥梁工程 17

#pragma mark  ***************************** 1K412010 城市桥梁结构形式及通用施工技术

#pragma mark  *******************  1K412011 城市桥梁结构组成与类型
#pragma mark  *******************  1K412012 模板、支架和拱架的设计、制作、安装与拆除
#pragma mark  *******************  1K412013 钢筋施工技术
#pragma mark  *******************  1K412014 混凝土施工技术
#pragma mark  *******************  1K412015 预应力混凝土施工技术
#pragma mark  *******************  1K412016 桥面防水系统施工技术
#pragma mark  *******************  1K412017 桥梁支座、伸缩装置安装技术
#pragma mark  *******************  1K412018 桥梁维护与改造施工技术

#pragma mark  ***************************** 1K412020 城市桥梁下部结构施工

#pragma mark  *******************  1K412021 各类围堰施工要求
#pragma mark  *******************  1K412022 桩基础施工方法与设备选择
#pragma mark  *******************  1K412023 墩台、盖梁施工技术

#pragma mark  ***************************** 1K412030 城市桥梁上部结构施工

#pragma mark  *******************  1K412031 装配式梁(板)施工技术
#pragma mark  *******************  1K412032 现浇预应力(钢筋)混凝土连续梁施工技术
#pragma mark  *******************  1K412033 钢梁制作与安装要求
#pragma mark  *******************  1K412034 钢混凝土结合梁施工技术
#pragma mark  *******************  1K412035 钢筋(管)混凝土拱桥施工技术
#pragma mark  *******************  1K412036 斜拉桥施工技术

#pragma mark  ***************************** 1K412040 管涵和箱涵施工

#pragma mark  *******************  1K412041 管涵施工技术
#pragma mark  *******************  1K412042 箱涵顶进施工技术

#pragma mark  ****************************************** lK413000 3、城市轨道交通工程 7
#pragma mark  ***************************** 1K413010 城市轨道交通工程结构与特点
#pragma mark  *******************  1K413011 地铁车站结构与施工方法
#pragma mark  *******************  1K413012 地铁区间隧道结构与施工方法
#pragma mark  *******************  1K413013 轻轨交通高架桥梁结构
#pragma mark  *******************  1K413014 城市轨道交通的轨道结构

#pragma mark  ***************************** 1K413020 明挖基坑施工
#pragma mark  *******************  1K413021 地下水控制
#pragma mark  *******************  1K413022 深基坑支护结构与边坡防护
#pragma mark  *******************  1K413023 基坑(槽)土方开挖及基坑变形控制
#pragma mark  *******************  1K413024 地基加固处理方法

#pragma mark  ***************************** 1K413030 盾构法施工
#pragma mark  *******************  1K413031 盾构机选型要点
#pragma mark  *******************  1K413032 盾构施工条件与现场布置
#pragma mark  *******************  1K413033 盾构施工阶段划分及始发与接收施工技术
#pragma mark  *******************  1K413034 盾构掘进技术
#pragma mark  *******************  1K413035 盾构法施工地层变形控制措施

#pragma mark  ***************************** 1K413040 喷锚暗挖(矿山)法施工
#pragma mark  ******************* 1K413041 喷锚暗挖法的掘进方式选择
#pragma mark  ******************* 1K413042 工作井施工技术
#pragma mark  ******************* 1K413043 超前预支护及预加固施工技术
#pragma mark  ******************* 1K413044 喷锚支护施工技术
#pragma mark  ******************* 1K413045 衬砌及防水施工要求
#pragma mark  ******************* 1K413046 喷锚暗挖法辅助工法施工技术要点

#pragma mark  ****************************************** 1K414000 4、城市给水排水工程(厂站) 13
#pragma mark  ***************************** 1K414010 给水排水场站工程结构与特点
#pragma mark  ******************* 1K414011 厂站工程结构与施工方法
#pragma mark  ******************* 1K414012 给水与污水处理工艺流程
#pragma mark  ******************* 1K414013 给水与污水处理厂试运行

#pragma mark  ***************************** 1K414020 给水排水场站工程施工
#pragma mark  *******************  1K414021 现浇(预应力)混凝土水池施工技术
#pragma mark  *******************  1K414022 装配式预应力混凝土水池施工技术
#pragma mark  *******************  1K414023 构筑物满水试验的规定
#pragma mark  *******************  1K414024 沉井施工技术
#pragma mark  *******************  1K414025 水池施工中的抗浮措施

#pragma mark  ****************************************** lK415000 5、城市管道工程(给排水、热力、燃气) 9
#pragma mark  ***************************** 1K415010 城市给水排水管道工程施工
#pragma mark  *******************  1K415011 城市排水体制选择
#pragma mark  *******************  1K415012 开槽管道施工技术
#pragma mark  *******************  1K415013 不开槽管道施工技术
#pragma mark  *******************  1K415014 管道功能性试验
#pragma mark  *******************  1K415015 砌筑沟道施工技术
#pragma mark  *******************  1K415016 给水排水管网维护与修复技术

#pragma mark  ***************************** 1K415020 城市供热管道工程施工
#pragma mark  *******************  1K415021 供热管道的分类
#pragma mark  *******************  1K415022 供热管道施工与安装要求
#pragma mark  *******************  1K415023 供热管网附件及供热站设施安装要点
#pragma mark  *******************  1K415024 供热管道功能性试验的规定

#pragma mark  ***************************** 1K415030 城市燃气管道工程施工
#pragma mark  *******************  1K415031 燃气管道的分类
#pragma mark  *******************  1K415032 燃气管道施工与安装要求
#pragma mark  *******************  1K415033 燃气管网附属设备安装要点
#pragma mark  *******************  1K415034 燃气管道功能性试验的规定

#pragma mark  ***************************** 1K415040 城市综合管廊
#pragma mark  *******************  1K415041 综合管廊工程结构类型和特点
#pragma mark  *******************  1K415042 综合管廊工程施工方法选择
#pragma mark  *******************  1K415043 综合管廊工程施工技术

#pragma mark  ****************************************** 1K416000 6、生活垃圾填埋处理工程 4
#pragma mark  ***************************** 1K416010 生活垃圾填埋处理工程施工
#pragma mark  *******************  1K416011 生活垃圾填埋场填埋区结构特点
#pragma mark  *******************  1K416012 生活垃圾填埋场填埋区防渗层施工技术
#pragma mark  *******************  1K416013 生活垃圾填埋场填埋区导排系统施工技术
#pragma mark  *******************  1K416014 垃圾填埋与环境保护技术


#pragma mark  ****************************************** 1K417000 施工测量与监控测量
#pragma mark  ***************************** 1K417010 施工测量
#pragma mark  *******************  1K417011 施工测量主要内容与常用仪器
#pragma mark  *******************  1K417012 场区控制测量
#pragma mark  *******************  1K417013 竣工图编绘与实测

#pragma mark  ***************************** 1K417020 监控测量
#pragma mark  *******************  1K417021 监控量测主要工作
#pragma mark  *******************  1K417022 监控量测方法
#pragma mark  *******************  1K417023 监控量测报告

#pragma mark - ****************************************************************** 第二部分 1K420000  市政公用工程项目施工管理(案例+选择) 38
组织、进度、质量、安全、
招标投标 、造价、合同管理、成本、健康环保管理、竣工验收与备案管理
#pragma mark  ****************************************** 1K420010 市政公用工程施工招标投标管理
#pragma mark  *******************  1K420011 招标投标管理
#pragma mark  *******************  1K420012 招标条件与程序
#pragma mark  *******************  1K420013 投标条件与程序

#pragma mark  ****************************************** 1K420020 市政公用工程造价管理
#pragma mark  *******************  1K420021 设计概算的应用
#pragma mark  *******************  1K420022 施工图预算的应用
#pragma mark  *******************  1K420023 工程量清单计价的应用

#pragma mark  ****************************************** 1K420030 市政公用工程合同管理
#pragma mark  *******************  1K420031 合同履约与管理要求
#pragma mark  *******************  1K420032 工程索赔的应用
#pragma mark  *******************  420033 施工合同风险防范措施

#pragma mark  ****************************************** 1K420040 市政公用工程施工成本管理
#pragma mark  *******************  420041 施工成本管理的应用
#pragma mark  *******************  420042 施工成本目标控制
#pragma mark  *******************  420043 施工成本核算与分析

#pragma mark  ****************************************** 1K420050 市政公用工程施工组织设计
#pragma mark  *******************  420051 施工组织设计编制的注意事项
#pragma mark  *******************  420052 施工方案确定的依据
#pragma mark  *******************  420053 专项施工方案编制与论证的要求
#pragma mark  *******************  420054 交通导行方案设计的要点

#pragma mark  ****************************************** 1K420060 市政公用工程施工现场管理
#pragma mark  *******************  420061 施工现场布置与管理的要点
#pragma mark  *******************  420062 环境保护管理的要点
#pragma mark  *******************  420063 劳务管理的有关要点

#pragma mark  ****************************************** 1K420070 市政公用工程施工进度管理
#pragma mark  *******************  420071 施工进度计划编制方法的应用
#pragma mark  *******************  420072 施工进度计划调控措施
#pragma mark  *******************  420073 施工进度报告的注意事项

#pragma mark  ****************************************** 1K420080 市政公用工工程施工质量管理
#pragma mark  *******************  420081 质量计划编制注意事项
#pragma mark  *******************  420082 质量计划实施要点
#pragma mark  *******************  420083 施工准备阶段质量管理措施
#pragma mark  *******************  420084 施工质量控制要点

#pragma mark  ****************************************** 1K420090 城镇道路工程质量检查与检验
#pragma mark  *******************  420091 无机结合料稳定基层施工质量检查与验收
#pragma mark  *******************  420092 沥青混合料面层施工质量检查与验收
#pragma mark  *******************  420093 水泥混凝土面层施工质量检查与验收
#pragma mark  *******************  420094 冬、雨期施工质量保证措施 【案例题】
#pragma mark  *******************  420095 压实度的检测方法与评定标准

#pragma mark  ****************************************** 1K420100 城市桥梁工程质量检查与检验
#pragma mark  *******************  420101 钻孔灌注桩施工质量事故预防措施
#pragma mark  *******************  420102 大体积混凝土浇筑施工质量检查与验收
#pragma mark  *******************  420103 预应力张拉施工质量事故预防措施
#pragma mark  *******************  420104 钢管混凝土浇筑施工质量检查与验收
#pragma mark  *******************  420105 箱梁混凝土浇筑施工质量检查与验收

#pragma mark  ****************************************** 1K420110 城市轨道交通工程质量检查与检验
#pragma mark  *******************  420111 地铁车站工程施工质量检查与验收
#pragma mark  *******************  420112 喷锚支护施工质量检查与验收
#pragma mark  *******************  420113 盾构法隧道施工质量检查与验收

#pragma mark  ****************************************** 1K420120 城市给水排水场站工程质量检查与检验
#pragma mark  *******************  420121 给水排水混凝土构筑物防渗漏措施
#pragma mark  *******************  420122 城市给水工程滤池与滤板施工质量检查与验收

#pragma mark  ****************************************** 1K420130 城市管道工程质量检查与检验
#pragma mark  *******************  420131 城市给水、排水管道施工质量检查与验收
#pragma mark  *******************  420132 城市燃气、供热管道施工质量检查与验收
#pragma mark  *******************  420133 柔性管道回填施工质量检查与验收
#pragma mark  *******************  420134 城市管廊施工质量检查与验收
#pragma mark  *******************  420135 城市非开挖管道施工质量检查与验收

#pragma mark  ****************************************** 1K420140 市政公用工程施工安全管理
#pragma mark  *******************  420141 施工安全风险识别与预防措施
#pragma mark  *******************  420142 施工安全保证计划编制和安全管理要点
#pragma mark  *******************  420143 施工安全检查的方法和内容

#pragma mark  ****************************************** 1K420150 明挖基坑施工安全事故预防
#pragma mark  *******************  420151 防止基坑坍塌、淹埋的安全措施
#pragma mark  *******************  420152 开挖过程中地下管线的安全保护措施

#pragma mark  ****************************************** 1K420160 城市桥梁工程施工安全事故预防
#pragma mark  *******************  420161 桩基施工安全措施
#pragma mark  *******************  420162 模板、支架和拱架施工安全措施
#pragma mark  *******************  420163 箱涵顶进施工安全措施
#pragma mark  *******************  420164 旧桥拆除施工安全措施

#pragma mark  ****************************************** 1K420170 隧道工程和非开挖管道施工安全事故预防
#pragma mark  *******************  420171 盾构法施工安全措施
#pragma mark  *******************  420172 暗挖法施工安全措施
#pragma mark  *******************  420173 非开挖管道施工安全措施

#pragma mark  ****************************************** 1K420180 市政公用工程职业健康安全与环境管理
#pragma mark  *******************  420181 职业健康安全管理体系的要求
#pragma mark  *******************  420182 环境管理体系的要求

#pragma mark  ****************************************** 1K420190 市政公用工程竣工验收与备案
#pragma mark  *******************  420191 工程竣工验收要求
#pragma mark  *******************  420192 工程档案编制要求
#pragma mark  *******************  420193 工程竣工备案的有关规定
#pragma mark  *******************  420194 城市建设档案管理与报送的有关规定

#pragma mark - ****************************************************************** 第三部分 1K430000 市政公用工程项目相关法规与标准(案例) 4

#pragma mark  ****************************************** 1K431000 相关法律法规
#pragma mark  ***************************** 1K431010 城市道路管理的有关规定
#pragma mark  *******************  431011 道路与其他市政公用设施建设应遵循的原则
#pragma mark  *******************  431012 占用或挖掘城市道路的管理规定

#pragma mark  ****************************************** 1K432000 相关技术标准
#pragma mark  ***************************** 1K432010 城镇道路工程施工与质量验收的有关规定
#pragma mark  *******************  432011 城镇道路工程施工过程技术管理的规定
#pragma mark  *******************  432012 城镇道路工程施工开放交通的规定

#pragma mark  ***************************** 1K432020 城市桥梁工程施工与质量验收的有关规定
#pragma mark  *******************  432021 城市桥梁工程施工过程质量控制的规定
#pragma mark  *******************  432022 斜拉桥施工、悬索桥的索鞍、索夹与吊索施工有关规定

#pragma mark  ***************************** 1K432030 地下铁道工程施工及验收的有关规定
#pragma mark  *******************  432031 喷锚暗挖法隧道施工的规定
#pragma mark  *******************  432032 盾构法隧道掘进速度控制的规定

#pragma mark  ***************************** 1K432040 给水排水构筑物施工及验收的有关规定
#pragma mark  *******************  432041 给水排水构筑物工程所用材料、产品的规定
#pragma mark  *******************  432042 水池气密性试验的要求

#pragma mark  ***************************** 1K432050 给水排水管道工程施工及验收的有关规定
#pragma mark  *******************  432051 给水排水管道工程施工质量控制的规定
#pragma mark  *******************  432052 给水排水管道沟槽回填的要求
#pragma mark  *******************  432053 给水排水管道内外防腐蚀技术要求

#pragma mark  ***************************** 1K432060 城镇燃气输配工程施工及验收的有关规定
#pragma mark  *******************  432071 钢管焊接人员应具备的条件
#pragma mark  *******************  432072 聚乙烯燃气管道连接的要求

#pragma mark  ***************************** 1K432070 道路工程施工与质量验收的有关规定
#pragma mark  ***************************** 1K432080 城市综合管廊工程的有关规定
#pragma mark  *******************  432081 城市综合管廊的相关规定
#pragma mark  *******************  432082 城市综合管廊施工要求

#pragma mark  ***************************** 1K432090 工程测量及监控量测的有关规定
#pragma mark  *******************  432091 工程测量主要技术的有关规定
#pragma mark  *******************  432092 监控量测主要技术的有关规定



