/*
 通过对“成本支出率”的分析，可以看出资金收入中用于成本支出的比重
 
 */
#pragma mark - ****************************************************************** 1Z201000 项目的组织与管理(概论) 28
/*
 */
 #pragma mark  ******************************** 1Z201010 建设工程管理的内涵和任务      1

/*
 */
 #pragma mark ******************************** 1Z201020 建设工程项目管理的目标和任务    3

/*
复习重点、难点、高频考点梳理
 1.建设工程管理的内涵
 2.建设工程管理的任务
 3.区分工程管理和项目管理
 
 复习重点、难点、高频考点梳理
 1.建设工程项目管理的内涵
 2.项目管理的类型
 3.项目参与方管理的目标和任务
 
 【两个管理的核心任务和两个阶段的主要任务】
 
 
 1.工程管理与项目管理的区别
 
     (1)时间范畴不同 P3
 
         工程管理:全寿命期 (P1 包括三个子阶段：决策、实施、使用阶段);
 
         项目管理:实施阶段(P3 包括五个子阶段：设计准备、设计、施工、 动用前准备和保修。)
 
        实施项目管理必须有明确的三大目标：费用、进度、质量目标
 
         注意与P121的区别(有物资采购， 无保修)。
                 项目的实施阶段：设计准备、设计、施工、动用前准备、保修
                 业主进度的实施阶段：设计准备、设计、施工、物资采购、动用前准备
 
         建设工程项目全寿命周期示意图（工程管理）
             1.项目决策阶段
                     决策阶段
                             1.编制项目建议书
                             2.编制可行性研究报告
             2.项目实施阶段（项目管理）
                     1.设计准备阶段
                             1.编制设计任务书
                     2.设计阶段
                             1.初步设计
                             2.技术设计
                             3.施工图设计
                     3.施工阶段
                             施工
                     4.动用前准备阶段
                             竣工验收
                     5.保修阶段
                             动用开始阶段 到 保修期结束
             3.项目使用阶段
                     从动用开始
                     保修阶段（和实施阶段是重复的）
                     报废
 
 
     (2)核心任务不同
 
         工程管理核心任务:为工程的建设和使用增值。 P3
         项目管理核心任务:项目的费用、进度、质量目标控制。 P4
 
         工程管理是一种增值服务：
                工程建设增值
                         确保工程【建设安全】
                         提高【工程质量】
                         有利于【投资（成本）控制】
                         有利于【进度控制】
                工程使用（运行）增值
                         确保工程使用安全
                         有利于【环保】
                         有利于【节能】
                         满足最终用户的使用功能
                         有利于降低工程运营成本
                         有利于工程维护
 
     (3)内涵不同
 
         工程管理:不仅涉及【全过程的管理】，还涉及【项目参与各方的管理】。P1-2
 
         建设工程管理指的是开发管理、 项目管理和设施管理

 
         工程管理
                 涉及建设工程项目的全过程的管理
                         项目前期策划与管理 DM（决策管理 开发管理）
                         项目实施期项目管理 PM（项目管理）
                         项目使用期设施管理 FM（使用管理 设施管理）
                 涉及参与建设工程项目的各个单位对工程的管理
                         业主方（投资方、开发方）
                         设计方
                         施工方
                         供货方
                         物业方（项目使用期的管理方）
 
         项目管理:自项目开始至项目完成，通过项目策划 和项目控制，以使项目的费用、进度和质量目标得以实现。P3
                 (1)“自项目开始至项目完成”指的是项目的实施阶段;(易误解为全寿命期)
                 (2)“项目策划”指的是【实施阶段】目标控制前的一系列筹划和准备工作;(易误解为决策阶段的主要任务)
                 (3)“费用目标”对业主而言是投资目标，对施工方而言是成本目标。
 
 2.项目立项是项目决策的标志。 P1
 
 3.决策阶段的主要任务:确定项目的定义。 P1
     定义什么?
     组织、地点、任务、原则、资金、三大目标（费用、进度、质量）。
 
 4.实施阶段的主要任务:通过管理使目标实现。 P3
 
 【两个管理的核心任务  两个阶段的主要任务】
 
 5.1Z201021—1Z201023 项目管理“五方”
 */
#pragma mark 1Z201021—1Z201023 项目管理“五方”

/*
 
 类型                     利益                       目标                                  阶段                         任务
 业主方 (核心)       服务于自己的利益                项目投资、进度、质量                      实施阶段全过程                三控三管一协调 (投资)
 设计方             服务于项目整体和自己的利益      设计成本、进度、质量；项目投资            主要在设计阶段，也涉及其他阶段     三控三管一协调 (成本+投资)
 供货方             整体、 本身                     供货的成本、进度、 质量                   主要在施工阶段，也涉及其他阶段     三控三管一协调 (成本)
项目总包方 DB\EPC    整体、 本身                  安全管理；项目的投资；总包成本、进度、质量         实施阶段全过程             三控三管一协调 (投资+成本)
 施工方             整体、 本身                 安全管理、项目成本、进度、质量             主要在施工阶段，无设计准备阶段        三控三管一协调 (成本)
 
 【项目总包和施工总包】
 
 三控三管一协调 ：成本控制、进度控制、质量控制、安全管理、合同管理、信息管理、协调
 
 对一个建设工程项目而言，业主方的项目管理往往是项目管理的核心
 
 施工方成本目标由施工企业根据其自身生产和经营情况自行确定（属于自身的内部目标，由自己决定）
 
 
 项目管理五方？
 业主方是总组织者、总集成者、核心
 建设项目总承包（项目总包）企业受业主委托,按照合同约定对工程项目的勘察、设计、采购、施工、试运行(竣工验收)等实行全过程或若干阶段的承包
 
 只服务于自己利益的是？ 业主方
 
 涉及到项目投资目标的三方？  业主方、设计方、项目总包方
 涉及到项目安全管理目标的两方？  项目总包方、施工方
 
 涉及实施阶段全过程的是？业主方、项目总包方
 不涉及设计准备阶段的是？施工方
 
 
 6.业主的进度目标:项目动用目标、或项目交付使用目标，【不是竣工】
 
        质量目标:涉及施工、设计、材料、设备、环境质量，满足技术规范技术标准、业主要求。
 
 7.五方主体的项目管理，各项任务中，安全管理最重要（因为涉及到人身安全）。
 
 
 8.工程总承包项目管理的主要内容 P15
 
     (1)任命项目经理，组建项目部，编制项目计划; —人
 
     (2)实施【设计】，【采购】，施工，试运行管理;—过程【只能在项目实施阶段  故不包括勘察 和决策阶段】
 
     (3)进行【项目范围】管理。—职能管理
         范围管理:范围计划编制、定义、验证、变更控制。
 
 9.按照国际惯例，自行分包、指定分包，不论与总包、总管或业主签合同，签合同前，必须得到总包、总管认可， 因此，均由总包或总管进行管理，且总包、总管对其工期、 质量目标负责。
 
 10.【施工方的项目管理，不能认为只是施工企业对项目的管理】。施工企业委托的项目管理【咨询公司对项目的管理】， 也属于施工方项目管理的范畴。
 
 
 */
#pragma mark ********************************  1Z201030 建设工程项目的组织  3

/*
 
 复习重点、难点、高频考点梳理
 1.目标与组织的关系
 2.组织论相关内容(构建知识树体系)
 
 
 本节考法:
 1.基本概念;
 2.四图四关系四方框;
 3.三种典型组织结构;
 4.两个分工表;
 5.三种工作流程组织;
 6.两层合同关系
 
 
 一、基本概念
 
     影响目标实现的因素:组织、人、方法、工具。
 
             影响一个系统目标实现的主要因素除了组织以外，还有另外两种因素:1)人的因素;2)方法与工具。
 
     目标决定组织，组织是目标实现的决定性因素。
 
     控制项目目标的主要措施:组织、管理、经济和技术措施，其中，组织措施最重要。
 
 二、组织论和组织工具
 
      组织论
             组织结构模式（相对静态关系）
                     职能组织结构
                     线性组织结构
                     矩阵组织结构
             组织分工（相对静态关系）
                     工作任务分工
                     管理职能分工
             工作流程组织（动态关系）
                     管理工作流程组织
                     信息处理工作流程组织
                     物质流程组织

 
 组织结构模式反映各部门或人员之间的【指令关系】。
 
 组织分工反映一个组织系统中各子系统或各元素之间的【工作任务分工和管理职能分工】
 
 工作流程组织反映各工作之间的【逻辑关系】。【动态关系】
 组织结构模式和组织分工是【相对静态关系】
 
 为了编制项目管理任务分工表，首先应对项目实施的各阶段的费用(投资或成本)控制、进度控 制、质量控制、合同管理、信息管理和组织与协调等【管理任务进行详细分解】。在任务详细分解的基础上进行任务的【详细分工】，然后再【编制表格】。【分解---人员分工---编制表格】
 
 管理职能分工表反映各工作部门 (各工作岗位)对【各项工作任务的项目管理职能分工】。
 工作任务分工表用以反映项目各工作任务由哪个部门(人员)负责、配合或参与
 
 组织工具是组织论的应用手段，包括:(四图两表)
 (1)项目结构图;
 (2)组织结构图(项目管理组织结构图);
 (3)工作任务分工表;
 (4)管理职能分工表;
 (5)工作流程图;
 (6)合同结构图。
 
 */
#pragma mark 1Z201031 项目结构分析在项目管理中的应用

/*
 
 项目结构图(WBS):是一个【组织】工具，通过树状图， 逐层分解，【反映所有工作任务】。
 
 同一项目可有不同的分解方法，分解应与整个工程实施部署相结合，并与合同结构相结合。
 
 项目结构分解没有统一模式，
 但应参考以下原则:
     (1)考虑部署;
     (2)考虑组成;
     (3)有利于发包，有利于实施，结合合同结构;
     (4)有利于目标控制;
     (5)结合组织结构。
     2考虑2结合3有利于
 
 【项目结构的编码依据是项目结构图】。
 【项目结构图和项目结构编码是其他编码的基础】。
 
 其他编码指:投资、进度、质量、合同、信息、安全等编码(即三控三管编码)。
 
 编码依据？编码基础？
 ...编码的基础是？
 
 */
#pragma mark 1Z201032 组织结构在项目管理中的应用

/*
  一、基本的组织结构模式——四图
         项目结构图
         组织结构图
         合同结构图
         工作流程图
 
     四图四关系四方框(P18—P23—P35)
 
 
     【组织工具】    表达的含义       矩形框内容       矩形框连接
 
     项目结构图      任务关系         任务              直线
     组织结构图      指令关系        工作部门          单向箭线
     合同结构图      合同关系        参与单位          双向箭线
     工作流程图      逻辑关系      工作和工作执行者      单向箭线
 
 二、基本的组织结构模式——三种典型组织结构
 
     职能组织结构
     线性组织结构
     矩阵组织结构
 
     三种典型组织结构的比较
        类型          指令源                   特点                        应用                      弊端
     职能组织结构        多         一个上级多个下级 一个下级多个上级      企业、学校、 事业单位     严重影响机制运行、目标实现
     线性组织结构        一              一个下级只有一个上级            国际上常用 不适特大系统         指令路径过长
     矩阵组织结构        二                纵向、横向两个指令               适合大系统
 
     矩阵制矛盾怎么解决?（三种方式）
     (a)最高指挥者协调、决策; （纵横向都是虚线）
     (b)以纵向为主;（纵向是实线，横向是虚线）
     (c)以横向为主（横向是实线，纵向是虚线）
 
 国际上常用的是线性组织结构
 适合大系统的是矩阵组织结构
 

 */
#pragma mark  1Z201033 工作任务分工在项目管理中的应用

/*

 各方都应编各自的项目管理工作任务分工表。
 项目管理工作任务分工表是组织设计文件的一部分。
 
 
 编制任务分工表的程序:任务分解，明确任务，编制工作任务分工表。
 
 明确谁的任务?【项目经理、主管工作部门或主管人员】【不是企业的人、也不是各部门的】
 
 编制任务分工表的程序：
     首先应对项目实施的各阶段的费用控制、进度控制、质量控制、合同管理、信息管理和组织与协调等管理任务进行详细分解，在项目管理任务分解的基础上定义项目经理和费用控制、进度控制、质量控制、合同管理、信息管理和组织与协调等主管工作部门或主管人员的工作任务，从而编制工作任务分工表。
 
     简单来讲就是先进行项目管理任务的详细分解，再明确项目管理工作部门的工作任务，再编制工作任务分工表。
 
 任务分工表的目的:应明确各项工作任务由哪个部门(或个人)负责、配合或参与。
 
 项目进展过程中，视必要对任务分工表进行调整。
 
 随着工程进展，任务分工表还将不断深化和细化。
 每一个任务，【至少】一个主办工作部门。
 运营部和物业开发部参与整个项目实施过程，不是在竣工前才介入。
 

 */
#pragma mark  1Z201034 管理职能分工在项目管理中的应用

/*

 管理职能的五个环节：
 
 管理是由多个【工作环节】组成的有限循环过程
 1.提出问题
 2.筹划-----提出多个方案 进行比较分析【只有一个方案时  没有筹划  属于决策】
 3.决策-----从多方案中选择一个
 4.执行-----执行决策
 5.检查-----决策是否执行 -决策执行效果
 如发现新的问题 则提出问题 按上述流程走
 
 
 管理环节就是管理职能。
 不同职能可由不同部门承担。
 各方都应编各自的管理职能分工表。
 
 管理职能分工表反映项目经理、各工作部门、各工作岗位的职能分工。
 
 管理职能分工表也可用于企业管理（管理职能分工表既可用于企业管理，也可用于项目管理 ）。
 
 由差到好：
 岗位责任描述书  我国常采用
 管理职能分工表  发达国家常采用
 管理职能分工描述书
 
 管理职工分工表不足以说明问题时，可以辅以管理职能分工描述书
 
 
 */
#pragma mark  1Z201035 工作流程组织在项目管理中的应用

/*
 
 三种工作流程组织:
 
     (1)管理流程组织:投资（成本）、进度、合同、付款和设计变更; 【只记忆这个即可  5个 付款、设计变更、投、进、合】
 
     (2)信息流程组织:报告、数据;
     (3)物质流程组织:设计、采购、施工。
 
 工作流程组织的任务:定义工作的流程。
 工作流程图应视需要逐层细化。
 各方，都有各自的工作流程组织任务。
 
 工作流程图:
 反映一个组织系统中各项工作之间的逻辑关系(动态关系)，是一个组织工具。
 
 矩形框表示工作，(单向)箭线表示工作之间的逻辑关系，菱形框表示判别条件。
 两个矩形框分别表示工作和工作执行者。
 

 */
#pragma mark 1Z201036  合同结构在项目管理中的应用

/*
 
 合同结构图反映业主方和各参与方之间，以及项目各参与方相互之间的合同关系。
 
 合同结构图可以清晰地了解一个项目有哪些或将有哪些合同，以及项目各参与方的合同组织关系。
 
 */
#pragma mark********************************  1Z201040 建设工程项目策划 1

/*
 
 复习重点、难点、高频考点梳理
 1.项目决策阶段策划的工作内容
 2.项目实施阶段策划的工作内容
 
 
 项目策划旨在为项目建设决策和实施增值。 【工程管理的核心任务为工程的建设和使用增值】
 
 项目策划是专家知识、信息的组织和集成，实质是知识管理的过程，是开放性的工作过程。【不是知识集合  不是封闭性的过程】
 
 实施阶段策划的内容涉及的范围和深度，没有统一规定。
 
                            项目策划的主要任务和基本内容
 
                        主要任务                基本内容
 
 决策阶段策划     定义开发或建设的任务和意义。  1.项目环境和条件调查分析;
                                         2.项目定义和目标论证;
                                         3-7.组织、管理、经济、技术、合同策划。
                                         关键词:实施期(运营期)......【总体】......
 
 实施阶段策划      确定如何开发或建设。        1.项目【实施】的环境和条件调查分析;
                                         2.项目目标的分析和【再论证】;
                                         3-8.项目【实施】的组织、管理、经济、技术、合同、风险策划。
                                         关键词:再，实施的
 
 决策策划，第二步，“定义和论证”的内容: (3)项目总投资的规划和论证; (4)建设周期的规划和论证。
 实施策划，第二步，“分析再论证”的内容: (1、3)......论证;(2、4)......规划;(5-7) 项目功能分解，建筑面积分配，确定项目质量目标。
 
 【决策阶段的内容：总体方案
 实施阶段的内容：再、实施】
 【决策阶段定义和论证的内容：规划和论证一起写
 实施阶段分析再论证的内容：规划、论证分开写、功能、面积、质量】
 
 实施阶段策划的主要内容包括：
 （1）项目实施的环境和条件的调查与分析；
 （2）项目目标的分析和再认证；
 （3）项目实施的组织策划；
 （4）项目实施的管理策划；
 （5）项目实施的合同策划；
 （6）项目实施的经济策划；
 （7）项目实施的技术策划；
 （8）项目实施的风险策划等
 
 
 项目实施的管理策划包括(1)项目实施各阶段项目管理的工作内容;(2)项目风险管理与工程保险方案。
 

 */
#pragma mark ********************************   1Z201050 建设工程项目采购的模式 4

/*

 复习重点、难点、高频考点梳理
 
 1.建设项目工程总承包的内涵
 2.施工总承包模式的特点
 3.施工总承包管理模式的特点
 4.施工总承包和施工总承包管理模式的比较
 
 */
#pragma mark 1Z201051  项目管理委托的模式

/*

 
 国际上，项目管理咨询公司的服务性质属于工程咨询(工程顾问)服务。
 
 国际上，业主方项目管理的模式: (1)自管;(2)托管;(3)共管(以咨询公司为主)。
 
 */
#pragma mark 1Z201052 设计任务委托的模式

/*

 
 国际上，【建筑师事务所】起主导作用。 【不是其他的事务所】
 
 选择设计单位的方式:
 我国，设计招标;国际上，设计竞赛。
 
 设计任务的委托模式: (1)设计总包;(2)设计平行。
 
 */
#pragma mark 1Z201053 项目总承包的模式

/*
 
 一、项目总承包的内涵及分类
 
     项目总包受业主委托，对项目的【勘察、设计、采购、施工、试运行】等实行全过程或若干阶段的承包。
 
    不得肢解发包，即违法分包
 
     项目总包的两种主要方式: (1)设计施工总包(DB); (2)设计采购施工总包(EPC)。
     均对工程的质量、安全、工期、造价全面负责。
 
     项目总包的基本出发点:借鉴工业生产的经验，实现生产过程的【组织集成化】，以克服由于设计施工分离导致的投资增加，以及设计施工不协调而影响进度的弊病。
 
     项目总包的主要意义:不在于总价包干和“交钥匙”。
             核心目的:为项目建设增值。
             计价方式:多数采用变动总价合同。
 
     项目总承包:
             业主负责项目总进度计划的编制、控制和协调
             总承包模式，质量好坏由总承包管理水平决定  不取决于业主
             施工总承包模式下，业主只对施工总承包单位进行组织协调管理
 
 
 二、项目总包从招标至确定合同价的基本工作程序
 
     (1)【业主编制项目建设纲要或设计纲要，它是项目总包编制设计建议书的依据】。
     (2)项目总包编制设计建议书和报价文件。
     (3)设计评审。
     (4)合同洽谈，包括确定合同价。
 
     项目总包招标多数采用【项目功能描述方式，而不采用项目构造描述方式】，因为招标时还没有设计文件。
 
 三、项目总包的工作程序 (对应P15)
 
     (1)启动:任命项目经理，组建项目部;
     (2)初始:编制项目计划;
     (3)设计;
     (4)采购;
     (5)施工:施工准备、施工，竣工试验、竣工决算，移交资料、移交管理权;
     (6)试运行;
     (7)合同收尾:取得目标考核证书、取得履约证书， 办理决算、办理债权债务;(证书)
     (8)项目管理收尾:项目资料归档、项目总结、 项目人员考核、解散项目部。(项目)
 
 */
#pragma mark 1Z201054 施工任务委托的模式 考2个题

/*
  一、三种承发包模式的特点比较——对业主而言
      模式         投资                 进度          质量          合同          组织协调
      平行       早控不利             好 (短)      他控 (好)      量大， 不好      量大，不好
     施工总包  不利于早期投资控制      不好 (长)      依赖总包       唯一， 好        唯一，好
     施工总管  对业主节约投资有利        好 (短)      他控 (好)     量大， 不好    总管负责， 大大减轻
 
 【注意投资控制和节约投资】
 
 【投资：是否在早期控制（确定）投资额
  进度：是否可以边设计边施工
  质量：下道工序会检查上道工序】
 
     1. 施工总包的最大缺点:建设周期较长。
     2. 工程实践中，“费率招标”（没设计完就开始招标），开口合同，对业主合同管理和投资控制十分不利。
     3. 一般情况，施工总管不参与具体施工，也想承担施工任务，通过投标获得。
     4. 施工总管的基本出发点:由施工总管负责对所有分包管理及协调，大大减轻业主的工作。
 
 建设项目工程总承包的基本出发点是借鉴工业生产组织的经验，实现建设生产过程的组织集成化，以克服由于设计与施工的分离致使投资增加，以及克服由于设计和施工的不协调而影响建设进度等弊病。
 其核心是通过设计与施工过程的组织集成，促进设计与施工的紧密结合，以达到为项目建设增值的目的。
 多数采用变动总价合同。
 
 二、施工总管与施工总包的模式比较
 
     1.工作程序不同
 
         施工总包:  施工图全部完成，招投标，施工，竣工验收。
         施工总管(平行):  施工图部分完成，招投标，施工， 竣工验收。
 
     2.合同关系不同
 
         施工总包:  业主   总包   分包
         施工总管:  业主     管理
                   业主    分包
                  或 业主   管理  分包
 
     3.对分包单位的选择和认可不同
 
         施工总包:一般情况，分包由总包选择，由业主认可。
         施工总管:一般情况，分包由业主选择，由总管认可。
 
     4.对分包单位的付款不同(与合同一致)
 
         施工总包:总包 分包
         施工总管:业主 分包
                 或施工总管   分包
 
     5.合同价格不同
 
         施工总包:工程款
         施工总管:管理费
 
     6.对分包单位的【管理和服务相同】
 
         既要负责对现场管理协调，也要负责向分包提供相应的服务。
 
         施工总管，不仅要管理和协调，还要对项目目标控制承担责任。
 
 三、施工总管与施工总包相比，【合同价】方面的优点:（三个）
 
         合同总额确定较有依据;
         所有分包通过招标获得，对业主节约投资有利;
         分包合同价对业主透明;(因为分包由业主签合同)
     其他方面的优点:
         只收管理费，不赚差价;
         边设计边施工，缩短建设周期，利于进度控制。
 
 */
#pragma mark 1Z201055 物资采购的模式

/*
 
 国际上，物资采购模式，如:
 (1)业主方自行采购;——甲购
 (2)约定某些物资为指定供货商;——甲招
 (3)承包商采购。——乙购
 
 我国，发包单位不得指定购入材料、构配件和设备或生产厂、供应商。
 【我国，可以指定分包】
 
 
 物资采购管理应遵循下列程序：
 （1）明确采购产品或服务的基本要求、采购分工及有关责任；【首先干的事情】
 （2）进行采购策划，编制采购计划；
 （3）进行市场调查，选择合格的产品供应或服务单位，建立名录；
 （4）采用招标或协商等方式实施评审工作，确定供应或服务单位；
 （5）签订采购合同；
 （6）运输、验证、移交采购产品或服务；
 （7）处置不合格产品或不符合要求的服务；
 （8）采购资料归档。
 
 
 
 */
#pragma mark ********************************   1Z201060 建设工程项目管理规划的内容和编制方法  2

/*
 
 复习重点、难点、高频考点梳理
 
 1.项目管理规划的基本内涵
 2.项目管理规划的编制方法
 
 
 
 一、项目管理规划的内涵
 
     是指导项目管理工作的纲领性文件。
 
     涉及项目整个实施阶段。
 
     属于业主方项目管理范畴。
 
     如果采用项目总包模式，业主也可委托项目总包编制。
 
     其他参与单位，也需要编制，但只涉及一个方面。
 
     项目管理规划 包括【项目管理规划大纲和实施规划】两类。
 
 */
#pragma mark 1Z201061 项目管理规划的内容

/*
 项目管理规划应包括 项目管理规划大纲 和 项目管理实施规划 两类文件
 
 项目管理规划的内容涉及的范围和深度，没有统一的规定，必须动态调整。
 
 规划大纲的内容:项目概况 + ......规划
 实施规划的内容:项目概况 + ......计划 + 既无“规划”也无“计划”。
 
 */
#pragma mark 1Z201062 项目管理规划的编制方法

/*
 
 
 1.项目管理规划大纲由组织管理层或组织委托的项目管理单位编制;
 
 2.项目管理实施规划由项目经理组织编制。
 
 【考试过 理解记忆   同时注意编制依据和编制内容的区分】
                规划大纲                实施规划
 编制依据       (1)可研报告;             (1)项目规划大纲;
              (2)设计文件;              (2)项目条件和环境分析资料;
            (3)招标、合同文件;           (3)工程合同文件;
            (4)市场、环境信息。          (4)同类项目资料。
                                         以项目或工程开头
 
 
 编制程序       (1)明确目标;             (1)了解要求;
             (2)分析条件;              (2)分析条件;
             (3)收集资料;               (3)熟悉文件;
             (4)确定组织;               (4)组织编制;
             (5)明确内容;               (5)报批。
             (6)编制计划;               【注意1 2 3 的顺序】
             (7)报批。
 
 项目管理规划大纲的编制工作程序：
 ①明确项目目标;
 ②分析项目环境和条件
 ③收集项目的有关资料和信息
 ④确定项目管理组织模式、结构和职责
 ⑤明确项目管理内容；
 ⑥编制项目目标计划和资源计划；
 ⑦汇总整理，报送审批。
 
 
 由于设计费仅占建设总投资很小的比率，业主方往往忽视对设计过程的管理，这是项目管理的一个误区。
 应指出，设计阶段的项目管理是建设工程项目管理的一个非常重要的部分，设计的质量直接影响项目实施的投资（或成本）、进度和质量；设计的进度也直接影响工程的进展。
 */
#pragma mark ********************************  1Z201070 施工组织设计的内容和编制方法  3

/*
 
 复习重点、难点、高频考点梳理
 
 1.施工组织设计的基本内容
 2.施工组织设计的分类
 3.施工组织设计的编制和审批
 
 
 
 施工组织设计以施工项目为对象编制，是指导施工的综合性文件。

 */
#pragma mark 1Z201071 施工组织设计的内容

/*
 
 施工组织设计应包括编制依据、工程概况、施工部署、施工进度计划、施工准备与资源配置计划、主要施工方法、施工现场平面布置及主要施工管理计划等基本内容。
 
 施工部署及施工方案包括：
 （1）根据工程情况，结合人力、材料、机械设备、资金、施工方法等条件，全面部署施工任务，合理安排施工顺序，确定主要工程的施工方案；
 （2）对拟建工程可能采用的几个施工方案进行定性、定量的分析，通过技术经济评价，选择最佳方案。
 
 一、施工组织设计的基本内容
     1. 工程概况
     2. 施工部署及施工方案(人材机安排，施工顺序) 确定施工方案 机械分析
     3. 施工进度计划(施工方案在时间上的安排) 资源需求计划
     4. 施工平面图(方案、进度在空间上的安排) 文明施工
     5. 主要技术经济指标
 
         施工机械的分析选择属于施工部署和施工方案
 
         施工进度计划反映了最佳施工方案在时间上的安排;
 
         施工平面图是施工方案及施工进度计划在空间上的全面安排;
 
         技术经济指标用以衡量组织施工的水平，它是对施工组织设计文件的技术经济效益进行【全面评价】
 
 二、施工组织设计的分类及其内容
 
     三种施工组织设计的编制对象:
     1.施工组织总设计——群体工程或特大型项目
     2.单位工程施工组织设计——单位工程
     3.施工方案——分部(分项)或专项工程
 
     三种施工组织设计的主要内容:
     施工组织总设计                        单位工程施工组织设计          施工方案
     1）工程概况                          1）工程概况                 1）工程概况
     2）总体施工部署                       2）施工部署                 2）施工安排
     3）施工总进度计划                     3）施工进度计划              3）施工进度计划
     4）总体施工准备与主要资源配置计划        4）施工准备与资源配置计划      4）施工准备与资源配置计划
     5）主要施工方法                       5）主要施工方案              5）施工方法及工艺要求
     6）施工总平面布置                     6）施工现场平面布置
 
     单无方法，“分”无部署、无平面布置
     都要 工程概况、施工进度计划、施工准备与资源配置计划
 
 */
#pragma mark 1Z201072 施工组织设计的编制方法

/*
 
 一、施工组织设计的编制和审批
 
     (1)不管是什么类型的施工组织设计 都由【项目负责人主持编制】，可分阶段进行。
 
     (2)施工组织总设计由总承包单位技术负责人审批;
 
        单位工程施工组织设计由施工单位技术负责人或 技术负责人授权的技术人员审批;

        施工方案应由项目技术负责人审批;
 
         重点、难点分部(分项)工程和专项工程施工方案由施工单位技术负责人批准。
         (总单分专，单位技术负责人审;施工方案，项目技术负责人审)
 
 
     专项施工方案，经施工单位技术负责人、总监签字后实施（建设单位项目负责人签字）:
     1)基坑支护与降水工程;2)土方开挖工程;3) 模板工程;4)起重吊装工程;5)脚手架工程;6) 拆除爆破工程。
     其中，涉及深基坑、地下暗挖工程、高大模板工程的专项施工方案，还应组织专家论证。
 
     (3)专业承包的分部(分项)工程和专项工程施工方案，由专业承包单位技术负责人或技术负责人授权的技术人员审核;有总包的，由总包项目技术负责人审核。
     (4)规模较大的分、专施工方案，按单位工程施工组织设计进行编、审。
 
 二、施工组织设计的动态管理
 
     1.以下情况之一，应及时修改或补充。
         (1)设计，重大修改，修改;一般性修改，补充 ；细微的不需要调整【不包括更正】
         (2)法律、法规、规范和标准实施、修订和废止
         (3)主要施工方法有重大调整
         (4)主要施工资源配置有重大调整
         (5)施工环境有重大改变
     2.经修改或补充，应重新审批后实施。
 
 */
#pragma mark ********************************  1Z201080 建设工程项目目标的动态控制 3

/*
 
 复习重点、难点、高频考点梳理
 1.动态控制的原理
 2.“组管经济”四大纠偏措施
 3.动态控制在投资控制中的应用(计划值和实际值的比较)
 
 */
#pragma mark 1Z201081 项目目标动态控制的方法及其应用

/*
 
 
 动态控制是项目管理最基本的方法论。
 
 一、动态控制工作程序(【动态控制三大步、实施过程三小步】)
 
     动态控制的工作程序:
 
         1.项目目标动态控制的准备工作:
 
             目标进行分解，确定目标控制的计划值;
 
         2.在项目【实施过程】中对目标进行动态跟踪和控制:
 
             (1)收集项目目标的实际值;
             (2)定期进行项目目标 的计划值和实际值的比较;
             (3)通过项目目标的计划值和实际值的比较，如有偏差，则采取纠偏措施进行 纠偏。
 
    准备工作
            目标分解
            确定计划值
    项目实施过程中动态跟踪与控制
            收集实际值
            比较计划与实际
            采取纠偏措施
                 组织措施
                 管理（合同）措施
                 经济措施
                 技术措施
    目标调整（如有必要进行调整，调整后要重新准备工作）
 

 
 二、纠偏措施关键词汇总(P57\P83\P153\P323\P356)  【考5分】
 
    组织措施        组织、人、部门、分工、流程、会议、责任制、编审调整(进度、工作计划);
                  生产要素优化配置、定额管理、任务单管理、活劳动、物化劳动、施工调度
    管理措施        思想、方法、手段、合同管理、风险分析管理、网络计划、信息技术、承发包(采购)模式
    经济措施        资金、资源、激励、成本风险分析;增减帐、业主签证
    技术措施        设计、施工、换机换料、技术经济分析
    合同措施        合同结构、合同条款、合同索赔(成本、合同两章特有)
 
 
 三、项目目标的动态控制和主动控制
 
    项目目标控制
            项目目标的事前控制------主动控制
                    事前分析可能导致项目目标偏离的各种影响因素
                    针对这些影响因素采取有效的预防措施
            项目目标的过程控制------动态控制
                    定期的进行项目目标的计划值和实际值的比较
                    当发现项目目标偏离时采取纠偏措施
 
 */
#pragma mark 1Z201082-83 动态控制的应用(进度、投资)

/*
 
 1.步骤:三大步三小步
 2.计划值和实际值的比较，两者是相对的，在前的为计划值，在后的为实际值。
 3.比较的性质:定量
 4.比较的成果:【进度跟踪控制报告】
 5.投资目标分解的目的:通过编制项目投资规划，分析论证目标实现的可能性。
 6.投资控制包括设计过程投资控制和施工过程投资控制，【前者更重要】。
 
 计划值和实际值的比较:【注意施工过程和设计过程】
     时间先后顺序:
         投资规划、概算、预算、合同价、工程款支付、决算
     设计过程:(2个——1、1) 概算与投资规划、预算与概算
     施工过程:(8个——2、3、3)
         1)合同价与概算、预算;
         2)工程款支付与概算、预算、合同价;
         3)决算与概算、预算、合同价
 
 
 运用动态控制原理进行建设工程项目投资控制， 首先进行的工作是进行投资目标分解，确定投资控制的计划值
 
 */
#pragma mark ********************************  1Z201090 施工企业项目经理的工作性质、 任务和责任 4

/*
 
 复习重点、难点、高频考点梳理
 
 1.项目经理的基本内容及相关条款概述
 2.项目经理的职责和权限
 3.项目各参与方之间的沟通方法: 1沟通过程的要素; 2沟通过程的分析;3沟通能力;4沟通障碍。
*/
#pragma mark 1Z201091 项目经理的工作性质

/*
 
 大中型项目的项目经理必须由取得建造师注册证书的人员担任，是否担任，由施工企业自主决定。
 项目经理，是施工企业法定代表人在项目上的代表人。
 建造师是专业人士，项目经理是工作岗位。
 
 项目经理的任务包括项目的行政管理和项目管理两个方面
 
 1.项目经理应为合同当事人确认的人选，并在【专用合同条款】中明确项目经理的姓名、职称、证书编号、联系方式、 授权范围。
 
     项目经理应是承包人的正式员工，承包人应向发包人提交项目经理的【劳动合同、缴纳社会保险】的有效证明。
 
 2.紧急情况，项目经理确保安全，48小时内书面报告。
 
 3.承包人更换项目经理，提前14天书面通知，并征得发包人【书面同意】。
 
 4.发包人要求更换项目经理，承包人14天内提书面改进报告。仍要求更换，28天内更换。
 
 5.项目经理应常驻施工现场，且每月在施工现场时间不得少于专用合同条款约定的天数。
 
    项目经理不得同时担任其他项目的项目经理。
    项目经理确需离开施工现场时，应事先通知监理人，并取得发包人的书面同意。
     授权下属履行职责，提前7天书面通知监理，并征得发包人【书面同意】。
 
 
 */
#pragma mark 1Z201092 施工企业项目经理的任务

/*
 
 1.项目经理的职责:4项
     (1)贯彻执行法律、法规、政策、企业制度;
     (2)严格财务制度;
     (3)履行各项条款;
     (4)对施工进行有效控制，确保质量、工期、安全、文明。
 
 2.项目经理的权力:6项
     (1)参与组织项目管理班子;
     (2)受托签署有关合同;
     (3)调配进入工程项目的人力、物资、机械、资金等生产要素;
     (4)参与选择施工作业队伍;
     (5)进行合理经济分配。
 */
#pragma mark 1Z201093 施工企业项目经理的责任

/*
 
 一、项目管理目标责任书
 
     项目管理目标责任书应在项目实施前，由法定代表人或其授权人与项目经理协商制定。
 
     编制依据:
         (1)项目合同文件;
         (2)组织管理制度;
         (3)项目管理规划大纲;(易改为“实施规划”)
         (4)组织经营方针和目标
 
 二、项目经理的职责（必须干的事情）
     (2)主持编制项目管理实施规划;
     (3)对资源进行动态管理;
     (4)建立各种专业管理体系;【包括质量、进度等管理体系】
     (5)进行授权范围内利益分配;
     (6)参与工程竣工验收;【必须参与】
     (7)接受审计;
     (8)协助组织项目的检查、鉴定和评奖申报工作。
 
 三、项目经理的权限（可干可不干）
     (1)参与招标、投标和合同签订;
     (2)参与组建项目经理部;【不是负责组建】
     (3)主持项目经理部工作;【不是必须干的】
     (4)授权范围内资金投入和使用;
     (5)制定内部计酬方法;【利益分配是必须做的】
     (6)参与选择分包人;
     (7)参与选择物资供应单位;
     (8)授权范围内协调内、外部关系;
 
 四、项目经理的责任
 
     项目经理由于主观原因或工作失误，可能承担法律责任和经济责任。
     政府主要追究法律责任，企业主要追究经济责任。
     如果项目经理违法，企业也可以追究法律责任。
 
 */
#pragma mark 1Z201094 项目各参与方之间的沟通方法

/*
 
 一、沟通过程的要素
 
     五要素，即:主体、客体、介体、【环境和渠道】。
 
     沟通主体:主导地位。
     沟通客体:即沟通对象，出发点和落脚点。
     沟通介体:包括沟通内容和沟通方法。
     沟通环境:包括社会整体环境和区域环境。
     沟通渠道:介体从主体到客体的途径。
 
 二、沟通能力和沟通障碍
 
     沟通能力:表达能力、争辩能力、倾听能力和设计能力。
 
     沟通两个要素:思维、表达。 【不是思维、倾听】
 
     沟通两个层面:思维交流、语言交流。
 
     沟通障碍三个方面:发送者(表达、传递、传送、经验、过滤)、接受者(译码、筛选、承受力、【心理】、情绪)和通道(媒介、渠道、干扰)。
 
     沟通障碍两种形式:组织沟通障碍(组织机构过于庞大)、个人沟通障碍(个性，知识、经验，记忆，态度，不信任，畏惧感、心理品质)。
 
 */
#pragma mark 1Z201095 施工企业人力资源管理的任务

/*
 一、相关内涵
 
     1.人力资源管理的目的:调动所有项目参与人的积极性。
 
 二、项目人力资源管理计划
 
     包括:人力资源需求、配置、培训计划。【不包括分析】
 
 三、劳动用工和工资支付管理
 
     1. 农民工是管理的重点对象;
 
     2(1).不得使用零散工;不得容许未与企业签订劳动合同的劳动者在施工现场从事施工活动。
     2(2).【自用工之日起】，订立书面合同;【不是试用期满订立合同】
     3(2).每月核算一次工资;
     3(3).至少每月支付一次工资，每季度结清工资;
     3(4).直接发放给劳动者本人;
     3(6).延期支付工资，最长不超过30日。
 
    劳动合同必须是书面合同
 
     劳动合同应一式三份，双方当事人各持一份，劳动者所在工地保留一份备查
 
    人员发生变更的,应当在变更后7日内,在建筑业企业信息管理系统中作相应变更
 
 */
#pragma mark ********************************  1Z201100 建设工程项目的风险 和风险管理的工作流程 2

/*
 
 复习重点、难点、高频考点梳理
 1.风险等级划分
 2.项目的风险类型
 3.项目风险管理的工作流程
 
 */
#pragma mark 1Z201101 项目的风险类型

/*
 
 
 一、风险和风险量的内涵
 
     风险量:不确定的损失程度和损失发生的概率。
     风险等级=(概率+损失量)/2
 
     记住数字的位置和对应的概率及损失量
     概率   很大       3 （C）          4           5(A)
           中等       2                3           4
           极小       1  (D)           2           3(B)
                   轻度损失(小)     中度损失(中)     重大损失(大)               损失量
 
    根据坐标轴：
     A降低概率 到B
     A降低风险量 到C

     A—5等风险;B、C—3等风险;D—1等风险。
 

 
 二、项目风险类型
 
     1.组织风险
 
         组织、流程、分工、人员
 
     2.经济与管理风险
 
         经济、资金、合同、【防火、防范、安全】
 
         经济与管理风险:(1)工程资金条件的分析;(2)合同风险;(3)事故防范措施和计划;(4)人身安全控制计划等。
 
     3.工程环境风险
 
         自然、地质、水文、气象、【火灾爆炸】
 
     4.技术风险
 
         勘测、设计、施工、物资、机械
 
 */
#pragma mark 1Z201102 项目风险管理的工作流程  1

/*
 
 管理流程               工作内容
 
 识别         1.收集信息;2.确定因素;3.编制报告
 评估         1.分析概率;2.分析损失量;3.确定风险量、 风险等级
 响应         规避、减轻、自留、转移(投保)
 控制         预测、监控、预警
 
 项目风险对策应形成风险管理计划，它包括:
 (1)风险管理目标;
 (2)风险管理范围;
 (3)可使用的风险管理方法、工具以及数据来源;
 (4)风险分类和风险排序要求;
 (5)风险管理的职责和权限;
 (6)风险跟踪的要求;
 (7)相应的资源预算。
 */
#pragma mark ********************************  1Z201110 建设工程监理的工作性质、 工作任务和工作方法 3

/*
 复习重点、难点、高频考点梳理
 1.工程监理的工作特性“公科服独”
 2.《建设工程质量管理条例》《建设工程安全生产管理条例》
 3.工程监理的工作方法(监理规划和监理实施细则)
 
 
 */
#pragma mark  1Z201111 监理的工作性质

/*
 

 工程监理，属于【业主方】项目管理范畴，归为【工程咨询(工程顾问)】服务。
 
 监理工作特点:服务性、科学性、独立性、公平性。
 服务性:不可能......，也不可能......;
 独立性:不依附于监理对象;
 公平性:维护业主合法权益时，不损害承包商合法权益。
 
 工程监理机构将尽一切努力进行项目的目标控制，但它不可能保证项目的目标一定实现;
 工程监理机构拥有从事工程监理工作的专业人士一监理工程师;  但不是从事监理工作的人员均应是注册监理工程师
 监理在组织上和经济上不能依附于监理工作的对象;
 在维护业主的合法权益时，不损害承包商的合法权益
 
 */
#pragma mark 1Z201112 监理的工作任务

/*
 
 一、《建设工程质量管理条例》
 
     1.监理承担监理责任。
     2.未经监理工程师签字，建筑材料、构配件和 设备不得在工程上使用或安装，不得进行下一道工 序施工。
         未经总监签字，建设单位不拨付工程款， 不进行竣工验收。
     3.监理形式:旁站、巡视和平行检验。
 
 二、《建设工程安全生产管理条例》
 
     1.监理单位应当审查施工组织设计中的安全技术措施或者专项施工方案是否符合工程建设强制性标准。
     2.监理单位在实施监理过程中，发现存在安全事故隐患的，应当要求施工单位整改;情况严重的，应当要求施工单位暂时停止施工，并及时报告建设单位。拒不 整改或不停止施工，及时向有关主管部门报告。
 
 三、几个主要阶段监理工作的主要任务
 
     1.施工准备阶段
         1)审查施工组织设计;
         2)参与设计交底;
         3、4) 【检查】制度、机构、人员;
         5)审核分包资质;
         6)检查试验室;
         7)查验测量放线成果;
         8)审查开工条件。
 
     2.施工阶段
 
         (1)质量控制:1)验收隐蔽、分部分项工程，签署分部分项、单位工程质量评定表;3)审查质量证明资料;5)度量衡;6)监督试件抽查。
         (2)进度控制:3)建立进度台帐，核对形象进度。
         (3)投资控制:1)签发支付证书;2)建立支付台 帐;3、4)审查变更、索赔、争议、结算资料。
         (4)安全管理:2)编制监理应急预案;3)【审查】制度、 机构、人员;4)发现隐患，要求整改;情况严重，要求暂 停(总监下令);不改不停，向主管部门报告(举报)。
 
     3.竣工验收阶段
 
         2)审查竣工验收申请，编写质量评估报告;3)组织预验收，参加竣工验收，签署验收意见。
 
 */
#pragma mark  1Z201113 监理的工作方法

/*
  一、监理工作有关规定
 
     监理认为施工不符合【设计要求、技术标准和合同约定】，有权要求建筑施工企业改正。
     监理发现设计不符合【质量标准、合同约定】，报告建设单位要求设计单位改正。
 
 
 二、监理规划和监理实施细则
 
     (一)编制时间、谁编谁审? 【必考】
 
         监理文件名称             编制时间                编制人         审批人
         监理规划       签订监理合同、收到设计文件后          总监      监理单位技术负责人
         监理实施细则           施工开始前                 专业监         总监
 
         工程建设监理规划应在签订委托监理合同及收到设计文件后开始编制，完成后必须经监理单位技术负责人审核批准，并应在召开第一次工地会议前报送业主;
         工程建设监理实施细则应在工程施工开始前编制完成，并必须经总监理工程师批准
 
     (二)编制内容(排除法)【比较记忆】
 
         1.监理规划—— 12条
                 工程概况，工作范围、工作内容、工作目标、工作依据，监理机构组织形式、人员配备计划、人员岗位职责， 工作程序、工作方法及措施、工作制度，监理设施。
         2.监理实施细则—— 4条
 
            (1)专业工程特点
            (2)监理工作流程
            (3)监理工作要点
            (4)监理工作方法及措施
 
         异:专业要流; 同:方法措施
 
     (三)编制依据
 
         1.监理规划(项目...... + 监理大纲、监理合同)
                 1)法律、法规及【项目审批文件】;
                 2)与项目有关的标准、设计和技术资料;
                 3)监理大纲、监理合同及项目合同文件。
         2.实施细则(专业工程...... + 监理规划、施组设计)
                 1)已批准的工程建设监理规划;
                 2)相关专业工程的标准、设计和技术资料;
                 3)施工组织设计。
 
 
 
 */
#pragma mark - ****************************************************************** 1Z202000 项目成本控制 18
/*
 */
#pragma mark  ********************************    1Z202010 施工成本管理的任务与措施 3

/*
     复习重点、难点、高频考点梳理
     1.施工成本管理的任务
     2.施工成本管理的措施
 
 */
#pragma mark  1Z202011 施工成本管理的任务（时间和运行规律）

/*
 
 建设工程项目施工成本管理从投标报价开始，直至保证金返还为止，贯穿于项目实施的全过程。
 
 根据成本运行规律，成本管理责任体系包括公司层的成本管理和项目经理部的成本管理。
 
 公司层的成本管理除生产成本以外，还包括经营管理费用;
 项目经理部对生产成本进行管理。
 
 公司层贯穿于项目投标、实施和结算过程，体现【效益中心】的管理职能;
 项目经理部则着眼于执行公司确定的【施工成本管理】目标，发挥现场【生产成本控制中心】的管理职能。
 
 
 施工成本:施工过程中全部生产费用的总和。
 直接成本:构成工程实体的费用，包括人材机。
 间接成本:组织和管理生产的费用，包括管理人员工资、办公费、差旅费。
 
 施工成本管理是在保证工期和质量的情况下，寻求最大程度的成本节约。
 
 施工成本管理的任务:施工成本预测、施工成本计划、施工成本控制、施工成本核算、施工成本分析、施工成本考核。
 
 (一)施工成本预测
 
         施工前对成本进行估算，是决策与计划的依据。
 
 (二)施工成本计划
 
     以货币形式编制的书面方案，降低成本的指导文件，设立目标成本的依据。
     编制原则:从企业实际出发，与施工方案、进度计划等其他计划相结合，采用先进定额，统一领导分级管理，适度弹性。
 
     三类指标: (1)数量指标—成本额结尾的指标;(2)质量指标—降低率结尾的指标; (3)效益指标—降低额结尾的指标
 
 (三)施工成本控制
 
     贯穿于投标阶段直至保证金返还的全过程。
     分为事先、事中和事后控制。
 
     合同文件和成本计划是成本控制的【目标】，进度报告和工程变更索赔资料是成本控制的【动态资料】。体现了动态跟踪控制的原理。
 
 (四)施工成本核算
 
     核算包括两个环节:一是对施工费用进行归集和分配，计算实际发生额;
                    二是根据核算对象，计算该项目的总成本和单位成本。
 
     核算以单位工程为对象。
 
     项目管理必须实行施工成本核算制，它和项目经理责任制共同构成了项目管理的运行机制。
 
     定期成本核算是竣工工程全面成本核算的基础。
 
     核算是预测、计划、控制、分析和考核的依据。
 
     形象进度、产值统计、实际成本归集三同步。同什么?工程量。
 
     对竣工工程的成本核算，应区分为竣工工程现场成本和完全成本，分别由项目经理部和企业财务部进行核算，目的在于分别考核项目管理绩效和企业经营效益。
 
 (五) 施工成本分析
 
     分析是在核算的基础上，对成本的形成过程和影响成本升降的因素进行分析，以寻求进一步降低成本的途径，包括有利偏差挖掘和不利偏差纠正。
 
     分析贯穿施工成本管理的全过程。
     它是在成本的形成过程中，主要利用施工项目的成本核算资料(成本信息)，与目标成本、预算成本以及类似的施工项目的实际成本等进行比较，了解成本的变动情况。
 
     成本偏差控制:分析是关键，纠偏是核心。
 
 (六)施工成本考核
 
     目的:调动员工积极性。
     以【施工成本降低额和施工成本降低率】作为成本考核的主要指标。
 
     预测是决策的前提。
     计划是决策的具体化。
     核算是最后检验。
     考核是保证和手段。
 
 */
#pragma mark  1Z202012 施工成本管理的措施

/*
  一、施工成本管理的基础工作
    【注意和施工成本管理的6个任务进行区分】
 
     1.最根本最重要的基础工作:建立成本管理责任体系;
     2.统一成本计划的内容格式;
     3.建立施工定额;
     4.建立价格信息的收集网络和询价网点;
     5.建立管理制度;
     6.设计成本核算账册。
 
 二、纠偏措施关键词汇总(P57\P83\P153\P323\P356)
 
 组织措施       组织、人、部门、分工、流程、会议、责任制、编审调整(进度、工作计划);
               生产要素优化配置、定额管理、任务单管理、活劳动、物化劳动、施工调度
 管理措施       思想、方法、手段、合同管理、风险管理、网络计划、【信息技术】、承发包(采购)模式
 经济措施       资金、资源、激励、成本【风险分析】;增减帐、业主签证【经济分析】
 技术措施       设计、施工、换机换料、【技术经济分析】
 合同措施       合同结构、合同条款、合同索赔(成本、合同两章特有)
 

 */
#pragma mark  ********************************    1Z202020 施工成本计划  4

/*
 
 复习重点、难点、高频考点梳理
     1.施工成本计划的类型
     2.“两算”的对比
     3.施工成本计划的编制依据
     4.施工成本计划的编制方法
 */
#pragma mark  1Z202021 施工成本计划的类型

/*

 竞争性成本计划即工程项目投标及签订合同阶段的估算成本计划。这类成本计划是以招标文件中 的合同条件、投标者须知、技术规程、设计图纸或工程量清单等为依据;
 指导性成本计划即选派项目经理 阶段的预算成本计划，是项目经理的责任成本目标。它是以合同标书为依据;
 实施性成本计划即项目施工 准备阶段的施工预算成本计划，它以项目实施方案为依据。
 
 
 类型         阶段           依据         定额
 
 竞争性    投标、签订合同     招标文件   本企业的消耗水平和费用指标
 指导性    选派项目经理       合同价       预算定额
 实施性     施工准备        实施方案       施工定额
 
 施工预算内容:以单位工程为对象。
 预算表格包括 (7个表) :工程量汇总表， 工料分析表，人、材、机量汇总表，施工预算表，“两算”对比表。
 前5表关键词:分层、分段、分部位
 
 施工预算和施工图预算的区别
 1.编制依据不同
        施工预算——施工定额
        施工图预算——预算定额
 2.适用范围不同
        施工预算——施工企业内部  与建设单位无关
        施工图预算——既适用于发包，又适用于承包
 3.发挥作用不同
        施工预算——组织生产
        施工图预算——投标报价
 
“两算”对比的方法:
         1.实物对比法:计算人、材、机的量。
         2.金额对比法:计算人、材、机的费。
 
“两算”对比的内容:
        1.2.3. 总原则:实际比计划少。【施工预算比施工图预算少】
        4.周转材
                脚手架:施工预算按施工方案确定，施工图预算以建筑面积为基数计算。
                模板:施工预算按混凝土与模板接触面积计算， 施工图预算按混凝土体积计算。
 
 */
#pragma mark  1Z202022 施工成本计划的编制依据

/*
 【涉及施工企业的】
 1.投标报价文件;【不是招标控制价文件】
 2.企业定额、施工预算;【不是施工图预算】
 3.施工组织设计或施工方案;
 4-6.人、材、机的价;
 7-8.承包、分包合同
 9.成本核算制度和财务历史资料;
 10.施工成本预测资料;
 11.降低施工成本的措施;
 
 
 */
#pragma mark 1Z202023-25 施工成本计划的编制方法(3种)

/*
 
 编制施工成本计划，以成本预测为基础，关键是确定【目标成本】。
 
 施工成本计划的编制方式有以下几种：
 第一 按施工成本组成编制施工成本计划；
 第二按施工项目组成编制施工成本计划；
 第三，按照施工进度编制施工成本计划。
 
 一、按成本构成编制
 
 【人、材、机、管、利、规、税】
     人工费
     材料费
     施工机械使用费
     企业管理费
         管理人员工资
         办公费
         差旅交通费
         固定资产使用费
         工具用具使用费
         劳动保险和职工福利费
         劳动保护费
         检验试验费
         工会经费
         职工教育经费
         财产保险费
         财务费
         税金
         城市维护建设税、教育费附加以及地方教育附加【原来是税金 现在归到管理费】
     利润
     规费
         社会保险费
         住房公积金
         工程排污费
     增值税
 
 二、按项目组成编制

        分为单项工程施工成本、单位工程施工成本、分部施工成本、分项施工成本
 
         编成本支出计划时，要在【总体层面考虑总预备费】，在【主要分项工程安排不可预见费】。  【主要分项  不是所有分项】
 
 三、按进度编制
 
     按进度编制 对施工成本目标按时间进行分解。
 
     在编制网络计划时，应充分考虑【进度、成本】，对【项目划分】的要求。
 
     两种表示方式:
     (1)在时标网络图上按月编制成本计划直方图;
     (2)时间-成本累积曲线(S曲线)。
 
     S曲线的绘制步骤:
     （1）确定工程项目进度计划编制进度计划的横道图；
     （2）根据每单位时间内完成的实务工程量或投入的人力、物力和财力，计算单位时间（月或旬）的成本，在时标网络图上按时间编制成本支出计划；
     （3）计算计划累计支出的成本额。
     （4）绘制S型曲线。
             (1)确定进度计划，编制横道图
             (2)计算单位时间（月或旬）的成本，在时标网络图上按月编制成本支出计划直方图
             (3)计算累计成本额
             (4)绘制S曲线
 
         S曲线的形状:
             原点出发，
             先凹后凸，不低头。
             越陡，进度越快;
             越缓，进度越慢。
             水平，进度暂停。
         一般而言，所有工作按最迟开始时间开始，利于节约贷款利息，但降低按期竣工保证率。【不是必须的】
 
     每一条 S 形曲线都对应某一特定的工程进度计划。
     因为在进度计划的非关键路线中存在许多有时 差的工序或工作，因而 S 形曲线必然包络在由全部工作都按最早开始时间开始和全部工作都按最迟必须开始时间开始的曲线所组成的“香蕉图”内。
 

 */
#pragma mark  ********************************   1Z202030 施工成本控制 6

/*
 复习重点、难点、高频考点梳理
 1.施工成本控制的依据
 2.施工成本控制的步骤
 3.施工成本控制的方法(过程控制方法、赢得值法)
 */
#pragma mark  1Z202031 施工成本控制的依据

/*
 
 成本控制的依据包括:工程承包合同、施工成本计划、进度报告、工程变更及施工组织设计和分包合同。
 
  1.工程承包合同(预算收入和实际成本)
  2.施工成本计划(包括目标、措施、规划)
  3.进度报告(实际值)
  4.工程变更
  5.施工组织设计
  6.分包合同

 */
#pragma mark  1Z202032  施工成本控制的步骤

/*
 
 要做好施工成本的过程控制，必须制定规范的过程控制程序。
 
 成本过程控制的两类程序:行为控制程序，指标控制程序。
 行为是基础，指标是【重点】。【两者既独立又联系，既补充又制约】。
 
 成本的过程控制中，有两类控制程序，一是管理行为控制程序，二是指标控制程序。
 管理行为控制程序是对成本全过程控制的基础，指标控制程序则是成本进行过程控制的重点。
 两个程序既相对独立又相互联系，既相互补充又相互制约。
 
 1.行为控制程序
 
     (1)建立成本管理体系的评审组织和程序
 
         成本管理体系的建立是企业自身的需要，没有社会组织评审和认证。
 
     (2)建立成本管理体系运行的评审组织和程序
     (3)检查
     (4)纠偏
 
 2.指标控制程序
 
     (1)确定项目及月度成本目标
     (2)收集数据，监测过程
     (3)分析偏差，制定对策
     (4)指标考核行为，行为保证指标
 
 两个程序要相结合。
 

 */
#pragma mark  1Z202033 施工成本控制的方法

/*
 
 一、施工成本过程控制方法【人、材、机、分包费】
 
     (一) 人工费——量价分离，劳务合同
 
        (1)制定先进的企业定额;
        (2)提高技术水平和管理水平;
        (3)加强技术培训和技能培训;
        (4)实行弹性需求的劳务管理制度。
 
     (二) 材料费——量价分离【记忆】
 
          1.材料用量
 
                1.定额控制——【有消耗定额的，限额领料】。
                     1)限额领料的形式
                         1 按分项工程，以施工班组为对象。
                         2 按工程部位，以施工专业队为对象。
                         3 按单位工程，以项目经理部或分包单位为对象。
 
                     2)限额领料的依据
                         1 工程量，图纸是基础;
                         2 施工定额、企业定额，是标准;
                         3 施工组织设计，是非实体性消耗材料的基础;
                         4 变更洽商单，是调整限额量的依据。
 
                 2.指标控制——【无消耗定额的，制定指标 （根据以往的定额 指定 是指标控制）】。
                 3.计量控制——收发计量、投料计量。
                 4.包干控制——小型及零星材料，量折费包干。
 
             材料费用量的控制，主要有定额控制、指标控制、计量控制、包干控制。
             对于部分小型及零星材料（如钢钉、钢丝等）根据工程量计算处所需材料量，将其折算成费用，由作业者包干使用。
             材料用量的控制：在保证符合设计要求和质量标准的前提下，合理使用材料，通过定额控制、指标控制、计量控制、包干控制等手段有效控制物资材料的消耗，具体方法如下。
             （1）定额控制。对于有消耗定额的材料，以消耗定额为依据，实行限额领料制度。
             （2）指标控制。对于没有消耗定额的材料，则实行计划管理和按指标控制的办法。
             （3）计量控制。准确做好材料物资的收发计量检查和投料计量检查。
             （4）包干控制。在材料使用过程中，对部分小型及零星材料（如钢钉、钢丝等）根据工程量计算出所需材料量，将其折算成费用，由作业者包干使用。
 
                指标控制的概念：根据以往项目的实际耗用情况，结合具体施工项目的内容和要求，制定领用材料指标，以控制发料。超过指标的材料，必须经过一定的审批手续方可领用。
            2.材料价格 由【材料采购】部门控制，采用招标和询价等方式。
 
     (三)施工机械使用费的控制
 
             1.台班数量
 
                 (1)充分利用现有机械设备，加强内部调配
                 (2)保证作业时间，安排好工序衔接
                 (3)核定台班产量，实行超产奖励
                 (4)加强租赁
 
             2.台班单价
 
                 (1)加强维修保养
                 (2)加强人员培训
                 (3)加强配件管理
                 (4)做好采购计划，降低材料成本
                 (5)成立领导小组
 
     (四)施工分包费用的控制
 
                 做好分包工程的【询价】、订立平等互利的分包合同、建立稳定的分包关系网络、加强施工【验收】和分包【结算】。
 
 
 二、赢得值(挣值)法 【一定要记忆公式  和 字母公式】
 
        BC 预算费用
        AC 实际费用
        WP 已完工作
        WS 计划工作
 
         参数及指标名称       具体内容
         三个基本参数
                             已完工作预算费用(BCWP) =已完成工作量×预算单价
                             计划工作预算费用(BCWS) =计划工作量×预算单价
                             已完工作实际费用(ACWP) =已完成工作量×实际单价
 
         四个评价指标
                             累积费用偏差(CV)=已完工作预算费用 (BCWP)-已完工作实际费用(ACWP) C=B-A
                             1.CV<0时，表示费用超支
                             2.CV>0时，表示费用节支
 
                             累积进度偏差(SV)=已完工作预算费用 (BCWP)-计划工作预算费用(BCWS)S=P-S
                             1.SV<0时，表示进度延误
                             2.SV>0时，表示进度提前
                 （绝对偏差，仅适用于对同一项目作偏差分析）
 
                             费用绩效指数(CPI)=已完工作预算费 用(BCWP)/已完工作实际费用(ACWP)C=B/A
                             1.CPI<1时，表示费用超支
                             2.CPI>1时，表示费用节支
                             进度绩效指数(SPI)=已完工作预算费用 (BCWP)/计划工作预算费用(BCWS)S=P/S
                             1.SPI<1时，表示进度延误
                             2.SPI>1时，表示进度提前
                     相对偏差，可适用于同一项目和不用项目之间的偏差分析

 赢得值(挣值)法的优点：可以克服进度、费用分开控制的缺点。
 
 在项目的费用、进度综合控制中引入赢得值法，可以克服过去进度、费用分开控制的缺点
 
 可定量的判断进度、费用的执行效果。
 
 三、偏差分析的表达方法
 
     1.横道图法
 
         形象、直观、一目了然，能准确表达费用绝对偏差， 信息量少。一般在较高管理层应用。
 
     2.表格法
 
         最常用
 
         (1)灵活、适用性强。
         (2)信息量大。
         (3)可借助于计算机(定量)。
 
     3.曲线法 对应P110表8(效率、进度、投入) 定性
 
         定量与定性分析结合，反映费用(进度)累计偏差。
 
         CV<0，效率低 SV<0，进度慢
         真上假下，投入超前 真多假少，投入超前
 
     最理想的状态是三条曲线靠得很近、平稳上升，表示项目按预定计划目标进行。
     在实际执行过程中，最理想的状态是已完工作实际费用 (ACWP)、计划工作预算费用(BCWS)、已完工作预算费用(BCWP)三条曲线靠得很近、平稳上升，表示 项目按预定计划目标进行。如果三条曲线离散度不断增加，则可能出现较大的投资偏差。
 
 
 【费用=效率=ACWP-BCWP
  进度=BCWP-BCWS
   投入=ACWP-BCWS】
 
 【理解记忆  记忆字母   】
     序号          图形                       三参数关系             分析（不能同时出现较）         措施（根据效率和进度判断）
     1                           ACWP>BCWS> BCWP  SV<0;CV<0      效率低 进度较慢 投入超前      用效率高的人员更换一批效率低的人员
     2                           BCWP>BCWS >ACWP SV>0;CV>0       效率高 进度较快 投入延后       若偏离不大， 维持现状
     3                           BCWP>ACWP> BCWS SV>0;CV>0       效率较高 进度快 投入超前       （人效率高）抽出部分人员，放慢进度
     4                           ACWP>BCWP >BCWS SV>0;CV<0       效率较低 进度较快 投入超前     (人效率低)抽出部分人员 增加少量骨干人员
     5                           BCWS>ACWP >BCWP SV<0;CV<0       效率较低 进度慢 投入延后       增加高效人员投入
     6                           BCWS>BCWP >ACWP SV<0;CV>0       效率较高 进度较慢 投入延后      迅速增加人员投入
 

 */

#pragma mark  ******************************** 1Z202040 成本核算
#pragma mark  1Z202041 成本核算的原则、依据、范围和程序

/*
 
考点1 :成本核算的原则和范围
 
成本核算应坚持形象进度、产值统计、成本归集同步原则，即三者取值范围一致。同什么?工程量。
 
施工企业在核算成本时,按照成本项目来归集企业在施工生产过程中所发生的应计入成本核算对象的各项费用。
其中,人材机等直接费,直接计入工程成本，间接费期末按确定的方法分配计入有关核算对象的成本。
 */
#pragma mark  ********************************  1Z202040 施工成本分析 5

#pragma mark  1Z202041 施工成本分析的依据
/*
 
 复习重点、难点、高频考点梳理
 1.施工成本分析的依据
 
 
 一、施工成本分析的依据
 
     1.会计核算——主要是价值核算
 
     2.业务核算——范围比会计、统计核算广
 
         会计和统计核算对已经发生的进行核算;
         业务核算，可以对已经发生的，尚未发生或正在发生的进行核算。
 
         特点:对个别经济业务进行单项核算
         目的:迅速取得资料。
 
     3.统计核算——计量尺度比会计核算宽，可以是货币、实物或劳动量。
 
 */

#pragma mark  1Z202041 成本核算的方法

/*
考点2 :成本核算的方法
 
施工项目成本核算方法主要有表格核算法和会计核算法。
 
表格核算法简便易懂，方便操作，实用性好。难以实现严密的审核制度,精度不高，覆盖面较小。
 
会计核算法科学严密,人为控制因素少，核算覆盖面较大。项目财务部一般采用此法。
 
用表格核算法进行工程项目施工各岗位成本的责任核算和控制,用会计核算法进行工程项目成本核算。
*/

#pragma mark  1Z202042 施工成本分析的方法
/*
    成本分析的基本方法：比较、因素分析、差额计算、比率（相关、构成、动态）
    综合成本的分析方法：分部分项工程成本分析、月(季)度成本分析、年度成本分析、竣工成本的综合分析
    成本项目的分析方法：人、材、机、管理
    专项成本分析方法：成本盈亏异常分析、工期成本分析、资金成本分析
 */
/*
 
 二、施工成本分析的方法  【4个】
 
     (一)成本分析的【基本方法】【4个方法】  比较、因素分析、差额计算、比率（相关、构成、动态）
 
         1.比较法
 
             又称“指标对比分析法”，对比技术经济指标， 检查目标完成情况，分析产生差异的原因。
             (1)实际与目标比:检查完成情况，分析积极因素和消极因素
             (2)本期与上期比:反映提高降低程度
             (3)与平均、先进比:反映差距
 
         2.因素分析法
 
             又称连环置换法，分析各种因素（产量、单价、损耗率）对成本的影响程度。
             计算步骤:
             ● 确定分析对象
             ● 确定影响因素，并排序(排序规则:先实物量，后价值量;先绝对值，后相对值)
             ● 目标数相乘
             ● 替换计算
             ● 结果比较，确定影响程度
 
             计算思路:【注意减数和被减数  注意损耗率是百分数】
             已知:目标数A、B、C，实际数A1、B1、C1 则有:
             ● 目标:A*B*C ——————1
             ● 量变:A1*B*C——————2
             ● 价变:A1*B1*C —————3
             ● 率变:A1*B1*C1—————4
             ● 2-1:量变引起费变
             ● 3-2:价变引起费变
             ● 4-3:率变引起费变
             ● 4-1:量价率均变引起费变
             (即实际与目标差额)
 
 
         3.差额计算法——因素分析法的简化形式【最常考】
 
         4.比率法
 
             【用两个以上指标的【比例】进行分析】。
 
             (1)相关比率法:【性质不同且相关，如产值与工资】。
             (2)构成比率法:比重分析法或结构对比分析法，
                 考察【量、本、利，即预算、实际和降低成本比例关系】。
             (3)动态比率法:同类指标不同时期，基期指数、环比指数。
 
 
     (二)综合成本的分析方法【4个分析方法】
 
         1.分部分项工程成本分析
 
             (1)分部分项工程成本分析是项目成本分析的基础;
             (2)分析对象:已完工分部分项工程;
             (3)分析方法:预算、目标和实际成本“三算”;【是三个  不是两个 少个就不对】
             (4)资料来源:预算成本来自投标报价，目标成本来自施工预算，实际成本来自施工任务单。
             (5)无法也没必要对每个分部分项工程进行成本分析。但主要分部分项工程必须进行成本分析，而且从开工到竣工进行系统的成本分析。
 
         2.月(季)度成本分析
 
             (1)依据:当月(季)成本报表;
             (2)实际与预算比，分析降低水平;
             (3)实际与目标比，分析落实情况和管理中的问题和不足。
 
            1000万中标 目标责任书800万 实际900万
 
             在进行月季度成本分析时发现出现了属于预算定额规定的政策性亏损则应该 从【控制支出】 着手把 【超支额压缩】 到最低限度
 
         3.年度成本分析
 
             (1)一年结算一次，不得转入下一年度;
             (2)依据:年度成本报表;
             (3)重点:【除了月度分析内容以外】，年度成本分析的重点是针对下一年度施工进展制定可行的成本管理措施，保证成本目标实现。
 
         4.竣工成本的综合分析
 
             (1)以单位工程竣工成本分析资料为基础。
 
             (2)单位工程竣工成本分析的【内容】:
                 竣工成本分析;
                 主要资源节超对比分析;
                 主要技术节约措施及经济效果分析。【不是主要经济指标分析】
 
     (三)成本项目的分析方法 【4个】
 
         1.人工费
         2.材料费
 
             (1)主材结构件——受价格和消耗量影响
             (2)周转材——取决周转率和损耗率
             (3)采购保管费——分析保管费率的变化
             (4)材料储备资金——分析日平均用量、单价、储备天数对储备资金的影响程度。储备天数是关键因素。
 
         3.机械使用费
         4.管理费
 
     (四)专项成本分析方法 【3个方法】
 
         1.成本盈亏异常分析
             从 “三同步”入手。
             原因:经济核算基本规律是完成多少产值、消耗多少资源、发生多少成本之间有着同步关系。
             “三同步”适用于【盈亏异常、月度成本检查】。
             通过以下五方面进行分析:
             (1)产值与实际工程量和形象进度是否同步;
             (2)资源消耗与实耗人、材、机是否同步;
             (3)产值统计与实际支付是否同步;【产、支】
             (4)预算成本与产值统计是否同步;【预、产】
             (5)实际成本与资源消耗是否同步。【实、耗】
 
 
         2.工期成本分析
 
             计划工期成本与实际工期成本的比较分析。 先用比较法，再用“因素分析法”。
 
         3.资金成本分析
 
             应用“成本支出率”指标，即实际支出占实际收入的比例。
 

 
 */
#pragma mark - ****************************************************************** 1Z203000 项目进度控制 18
/*
 

 一、进度控制的工作环节
 
     项目管理各方，进度控制的目标和时间范畴不相同。
 
     进度控制是一个动态的管理过程。它包括:
     (1)目标分析和论证(目的:论证进度目标是否合理，有否可能实现。)
     (2)收集资料，编制进度计划
     (3)跟踪检查
     (4)纠偏或调整
 
 */
#pragma mark ********************************  1Z203010 建设工程项目进度控制与进度计划系统 3

/*
 
 */
#pragma mark 1Z203011 项目进度控制的目的

/*
 
 进度控制的目的:通过控制实现进度目标。
 进度控制的过程也是进度不断调整的过程。
 进度控制不仅关系到进度目标能否实现，还【直接】关系到质量和成本。
 最基本的工程管理原则:确保质量，控制进度。
 项目进度计划系统是项目进度控制的依据。P123
 项目进度计划系统建立完善有个过程，逐步形成。
 
 */
#pragma mark 1Z203012 项目进度控制的任务

/*
  业主方
         ——控制整个项目实施阶段的进度。包括设计准备、设计、施工、物资采购、动用前准备。
         与P4区别!项目实施阶段包括设计准备、设计、施工、动用前准备、保修
 设计方
         ——依据设计合同控制设计进度。应尽可能使设计进度与招标、施工、物资采购相协调。
         国际上，设计进度计划主要是出图计划。出图计划，是设计方控制进度的依据，也是业主方控制设计进度的依据。
 施工方
         ——依据施工合同控制施工进度。施工方应编制不同深度、不同功能、不同周期的进度计划。
 供货方
         ——依据供货合同控制供货进度。
 
 */
#pragma mark 1Z203013 项目进度计划系统的建立

/*
 项目进度计划系统是项目进度控制的依据。P123
 项目进度计划系统建立完善有个过程，逐步形成。

 
 进度计划系统的四个层次:P123图
     第二层次(平面):不同项目参与方
     第三、四层次(平面):不同深度
 
 业主要编制四个  其他要编制三个（不用编制不同参与方的）
 
 进度计划系统的四个类型:
     1.不同【深度】——【总规划、子规划、 单项计划】
     2.不同功能——控制性、指导性、实施性
     3.不同项目参与方——业主、设计、施工和采购供货
     4.不同周期——5年、年、季、月和旬
 
 必须注意各进度计划系统之间的联系协调。
 
 */
#pragma mark 1Z203014 计算机辅助建设工程项目进度控制

/*
 
 进度计划软件是在【网络计划】原理的基础上编制的。
 
 计算机辅助网络计划编制的意义:
     (1)解决计算量大的困难;
     (2)确保计算准确性;
     (3)利于网络计划调整;
     (4)利于编制资源需求计划。
 
 为使各方快捷获取信息，可利用项目信息门户作为基于互联网信息处理平台辅助进度控制。
 
 */
#pragma mark ********************************  1Z203020 建设工程项目总进度目标的论证 3

/*
 
 一、总进度目标论证的工作内容
 
      1.总进度目标确定的时间范畴:决策阶段
      2.总进度目标控制的时间范畴:实施阶段
      3.哪方任务:业主方(总包模式，协助业主的项目总包方)
      4.总进度目标控制前，首先做什么工作?:分析和论证目标实现的可能性。
 
     建设工程项目的总进度目标指的是整个项目的进度目标，它是在项目决策阶段项目定义时确定的， 项目管理的主要任务是在项目的实施阶段对项目的目标进行控制。建设工程项目总进度目标的控制是业主方项目管理的任务。在进行建设工程项目总进度目标控制前，首先应分析和论证目标实现的可能性。
 
     在项目的实施阶段，项目总进度包括:
     (1)设计前准备阶段的工作进度;
     (2)设计工作进度;
     (3)招标工作进度;
     (4)施工前准备工作进度;
     (5)工程施工和设备安装进度;
     (6)工程物资采购工作进度;
     (7)项目动前的准备工作进度。
     项目总进度目标的论证应分析和论证实施阶段各项工作的进度，以及实施阶段各项工作进展的相互关系。
 
 二、总进度目标论证的工作内容
 
     总进度目标论证的工作:【总进度规划编制、工程实施条件分析和工程实施策划】。
     总进度目标论证的核心工作:通过编制总进度纲要论证总进度目标实现的可能性。
 
     总进度纲要的主要内容:(4总1子，里程碑)
     (1) 总体部署;
     (2) 总进度规划;
     (3) 子系统进度规划;
     (4) 里程碑事件计划进度目标;
     (5) 总进度目标实现的条件和采取的措施。
 
 三、总进度目标论证的工作步骤:(三先三后)
     (1) 调查研究和收集资料;
     (2) 项目结构分析;【大】
     (3) 进度结构分析;【小】
     (4) 项目编码;【中间编码】
     (5) 编各层(各级)进度计划;【小】
     (6) 编总进度计划;【大】  编制总进度之前协调各进度的关系
     (7) 调整(计划);
     (8) 报告。
 
    大小小大中间编码
     熟记口诀:先项目后进度，先分析后编码，先各层后总体
 
 1. 调研和收集资料包括:(1)-(3)收集:决策阶段进度目标资料、组织管理经济技术资料、类似项目进度资料;(4)-(5)调查:总体部署、主客观条件。
 2. 项目结构分析是将整个项目逐层分解，确立工作目录， 一到三级工作目录分别是【子系统、子项目、工作项】。
 3. 进度结构分析第一至三层进度计划，分别是子系统、 子项目、工作项【的进度计划】。
 4. 项目编码应考虑:对不同计划层的标识、对不同计划对象的标识、对不同工作的标识。
 
 
 */
#pragma mark ********************************  1Z203040 建设工程项目进度控制的措施 3

/*
  纠偏措施关键词汇总(P57\P83\P153\P323\P356)
 
 组织措施       组织、人、部门、分工、流程、会议、责任制、编审调整(进度、工作计划);
              生产要素优化配置、定额管理、任务单管理、活劳动、物化劳动、施工调度
             【进度控制的主要工作环节应在项目管理组织设计的任务分工和管理职能分工表中标示并落实  组织措施】
 管理措施       思想、方法、手段、合同管理、风险管理、网络计划、信息技术、【承发包(采购)模式】 【管理技术 归于管理措施】
 经济措施       资金、资源、激励、【成本】风险分析;增减帐、业主签证 【编制与进度计划相适应的资源需求计划 是经济措施】
 技术措施       设计、施工、换机换料、【技术经济】分析【项目施工技术】
 合同措施       合同结构、合同条款、合同索赔(成本、合同两章特有)
 
 1.编制进度计划的流程，如:定义组成;编审调整程序。
 2.会议应明确:类型、人、时间、文件。
 3.管理观念方面应加强:
     1)系统的观念;
     2)动态控制的观念;
     3)多方案比选的观念。
 4.在【工程预算】中，应考虑加快工程进度的资金。
 5.进度受阻，分析是否存在设计技术的影响因素，有无设计变更的可能性。
              是否存在施工技术的影响因素，有无改变施工技术、施工方法和施工机械的可能性。
 
 */
#pragma mark ********************************  1Z203030 建设工程项目进度计划的编制和调整方法 10

#pragma mark 大差法计算流水步距和工期
/*
 
 流水施工工期 = 各施工过程（或专业工作队）之间流水步距之和 + 最后一个施工过程（或专业工作队）在各施工段流水节拍之和  + 工艺间歇时间之和
 
 
 累加数列错位相减取大差法（简称‘大差法’）计算流水步距 【注意数列累加时，必须是同一施工过程在不同施工段上的累加】
 
各工作在不同工段的流水节拍数
        工段一 工段二 工段三
 工作一    4    4      4
 工作二    1    1      1
 工作三    2    2      2
 
 则工作一、二的流水步距为 10
 4  8   12
    1   2   3
 4  7   10  -3      累加的值相减的最大值为10
 
 工作二、三的流水步距为
 
 1  2   3
    2   4   6
 1  0   -1  -6  累加的值相减的最大值为1
 
 所以流水步距和为 10+1 = 11
 工期为 11 + 2+2+2  +1 = 18
 
 
 
 */
#pragma mark 1Z203031 横道图进度计划的编制方法

/*
 
 横道图是最简单、运用最广、最传统的进度计划方法。
 用于小型项目、大型项目子项目、【计算资源需求量】和概要预示进度。
 
  横道图优点:直观、易懂
 
  横道图缺点:
     (1)工序(工作)之间的逻辑关系可以设法表达，但不易表达清楚;
     (2)适用于手工编制计划;
     (3) 没有通过严谨的进度计划时间参数计算，不能确定计划的关键工作、关键路线与时差;能够确定持续时间
     (4)计划调整只能用手工方式进行，其工作量较大;
     (5)难以适应较大的进度计划系统。
 
 */
#pragma mark 1Z203032 工程网络计划的编制方法

/*
 
 */
#pragma mark 1Z203033 工程网络计划有关时间参数的计算

/*
 
 我国常用的工程网络计划包括:【前三个都是重点】
     1.双代号网络计划
     2.单代号网络计划
     3.双代号时标网络计划
     4.单代号搭接网络计划 （不太容易考）
 
 
 */
#pragma mark  专题一:双、单代号网络计划的基本概念及看图识错

/*
 
 专题一:双、单代号网络计划的基本概念及看图识错
 
     双代号网络计划(P127)
        （没有工作代号  有节点编号）
 
                         工作名称
        （节点编号）i   -------------->  j
                         持续时间
 
    单代号网络计划(P133)
        （唯一不用虚箭线的 其他都用）
 
                (工作代号) i           (工作代号) j
                (工作名称）槽1  一>     (工作名称）槽2
                (持续时间) 3           (持续时间) 3
 
     1.双代号网络计划的基本概念(P127)
 
         (1)箭线(工作)——表示逻辑关系
 
                 实箭线——占用时间、多数消耗资源 (只占时间，不耗资源，如混凝土养护)
                 虚箭线——不占时间，也不耗资源
                         作用——联系、区分、断路
 
                 工作类型——本工作、紧前工作、紧后工作、平行工作
                 箭线方向——从左到右
 
         (2)节点—— 一项工作只有唯一一条箭线和一对节点。
 
                 节点编号——从小到大，可不连续，但不允许重复。
 
         (3)线路
 
                从起始到终点的通路，叫线路。
                总时间最长的线路，称为关键路线。
                关键线路上的工作，叫关键工作。
                关键线路至少一条，可能多条，可能转移。
 
         (4)逻辑关系
 
                 工艺关系——工艺过程、工作程序决定的先后顺序
                 组织关系——组织安排或资源(人、财、机、资金) 调配而产生的先后顺序(同类型的先后顺序)
 
     2.双代号网络计划的绘图规则(P128)
 
         (1)必须正确表达逻辑关系(扎1与支3、浇1与扎3之间本没 有逻辑关系，上图形成了逻辑关系，下图采用断路法修正)
         (2)不允许(严禁)出现循环回路
         (3)节点之间严禁出现双向箭头或无箭头的连线
         (4)严禁出现无箭头节点或箭尾节点的箭线
         (5)当节点有多条箭线时，可使用母线绘制
         (6)箭线不宜交叉，不可避免，可用【过桥法或指向法】
         (7)网络图中只有一个起点节点和一个终点节点
 
     3.单代号网络计划的基本概念(P133)
 
         不用虚箭线。
 
     4.单代号网络计划的绘图规则(P133)
         (6)只有一个起点和一个终点，当有多个起点或终点时，应在两端分别设一项虚工作。
 
        工作时间为0的是虚工作
 
 */
#pragma mark  专题二:双代号网络计划时间参数计算及关键线路

/*
 专题二:双代号网络计划时间参数计算及关键线路
 
 确定
     1.工作持续时间和工期(P137)
 
         工作持续时间(Di-j)——一项工作从开始到完成的时间。
 
         工期(T)
             计算工期Tc——根据网络计划计算出来的工期
             要求工期Tr——任务委托人要求的工期
             计划工期Tp——任务实施人计划的工期
         已规定要求工期，计划工期小于等于要求工期，Tp≤Tr
         未规定要求工期，计划工期等于计算工期，Tp=Tc
 
     2.六个时间参数
 
         (1)最早开始时间ESi-j，各紧前工作全部完成，本工作有可能开始的最早时刻。
         (2)最早完成时间EFi-j，各紧前工作全部完成， 本工作有可能完成的最早时刻。
         (3)最迟开始时间LSi-j，不影响整个任务按期完成，本工作必须开始的最迟时刻。
         (4)最迟完成时间LFi-j，不影响整个任务按期完成， 本工作必须完成的最迟时刻。
         (5)总时差TFi-j，不影响总工期，本工作可以利用的机动时间。
         (6)自由时差FFi-j，不影响紧后工作最早开始， 本工作可以利用的机动时间。
 
     3.六时参数的数值表达(对应P138-139的10个公式)
 
          起点工作最早开始时间=0
          其他工作最早开始时间=各紧前工作的最早完成时间的最大值【所有紧前工作都完成】
          最早完成时间=最早开始时间+持续时间
          计算工期=终点节点的各项工作的最早完成时间的最大值
          终点工作最迟完成时间=计划工期
 
          其他工作最迟完成时间=各紧后工作的最迟开始时间的最小值
          最迟开始时间=本工作的最迟完成时间-持续时间
          总时差=最迟开始时间-最早开始时间=最迟完成时间-最早完成时间
          终点工作自由时差=计划工期-终点节点最早完成时间
          其他工作自由时差=紧后工作的最早开始时间-本工作的最早完成时间
 
     4.计算
         (1)步骤:
                 (1)从左到右计算ES、EF，遇到有大小时取大; (副产品:计算工期Tc);
                 (2)从右到左计算LF、LS，遇到有大小时取小;
                 (3)从右到左计算TF;
                 (4)从右到左计算FF，遇到有大小时取小。
         (2)口诀:
                 顺加取大，逆减取小 （前两个（最早）参数顺加取大  后四个逆减取小）

                        ES LS TF
                        EF LF FF

     5.【示例】计算双代号网络计划的时间参数、总工期并标出关键线路(六时法)
                 总工期:终点节点最早完成时间;
                 关键线路:总时差最小(此处为零)的工作连成的线路

 
     最快速计算工期、判断关键线路的方法——标号法
 
 */
#pragma mark   专题三:单代号网络计划的时间参数计算及关键线路

/*
 专题三:单代号网络计划的时间参数计算及关键线路
 
 确定
     1.计算工期和关键线路(标号法)
 
     2.时间参数的计算公式(P142)
 
         (3)计算相邻两项工作之间的时间间隔LAGi,j LAGi,j=ESj-EFi (即自由时差)
         (4)计算工作总时差(逆) TFi=min{TFj+LAGi,j}  总时差+时间间隔的和的最小值
         (5)计算工作自由时差(逆) FFi=min{LAGi,j}  时间间隔的最小值
 
 */
#pragma mark   专题四:双代号时标网络计划的概念及识图(P130-132)

/*
 
 专题四:双代号时标网络计划的概念及识图(P130-132)
 
     1.定义
 
         实箭线表示工作，虚箭线表示虚工作，波形线表示工作的自由时差。
 
     2.特点
 
         (2)图上直接显示各工作的最早开始与最早完成时间，自由时差，关键线路。
 
     3. 解题思路
 
         先找关键线路，最后判断选项正误。
 
     4.主要题型
 
         第一类:求时间参数、计算工期、关键线路
 
             ● 最早开始时间——实箭头起点
             ● 最早完成时间——实箭头终点(或波形线的起点)
             ● 最迟开始时间=最早开始时间+总时差
             ● 最迟完成时间=最早完成时间+总时差
             ● 计算工期——终点节点与起点节点的位置之差
             ● 关键线路——无波形线的通路(逆序)
             ● 自由时差——波形线长度
             ● 总时差—— 该工作及后续线路上波形线之和的最小值

 
         ★第二类:实际进度前锋线:自上而下，用点画线，将各项工作实际进度达到的前锋点连接而成的折线。
 
             解题步骤:先沿着时点画竖直线，再找关键线路，然后判断选项正误。
            答题技巧:对于平行关键线路，提前按最少的算，拖后按最大的算!
 
     (1)间接法
         先绘制时标网络计划表
         计算各工作的最早时间参数，
         再在时标网络计划表上确定节点位置，
         完成连线，
         某些工作箭线长度不足以到达该工作的完成节点时，用波形线补足。
 
     （2）直接法绘制双代号时标网络计划图，直接在时标计划表上绘制时标网络计划。
 
         绘制步骤如下：
             1)将起点节点定位在时标计划表的起始刻度线上；
             2）按工作持续时间在时标计划表上绘制起点节点的外向箭线；
             3）其他工作的开始节点必须在其所有紧前工作都绘出以后，定位在这些紧前工作最早完成时间最大值的时间刻度上，某些工作的箭线长度不足以到达该节点时，用波形线补足，箭头画在波形线与节点连接处；
             4)用上述方法从左至右依次确定其他节点位置，直至网络计划终点节点定位，绘图完成。
 

 */
#pragma mark   专题五:单代号搭接网络计划的概念及计算(P134-137， P144-150)

/*
 专题五:单代号搭接网络计划的概念及计算(P134-137， P144-150)
 
        时距是时间间隔 不是参数  不特殊
        用箭线和时距标识逻辑关系
 
         1.搭接顺序(时距)finish start
 
                FTSi,j ——工作i完成到紧后工作j开始的时间间距;
                FTFi,j ——工作i完成到紧后工作j完成的时间间距;
                STSi,j ——工作i开始到紧后工作j开始的时间间距;
                STFi,j ——工作i开始到紧后工作j完成的时间间距。
 
         2.搭接关系——记住四个例子
 
             (1)完成到开始时距(FTS)
 
                     堤坝护坡，一定要等土堤自然沉降后才能修护坡。
 
             (2)完成到完成时距(FTF)
 
                     工作前慢后快，前工作必须先完成，后工作才能完成。
 
             (3)开始到开始时距(STS)
 
                     道路路基路面工程，路基开始，路面才能开始。
 
             (4)开始到完成时距(STF)
 
                     地下水位以上的土方开挖几天后，降水工作必须完成。
 
         3.时间参数计算(P144-146，对应P147-148)
 
                 (1)计算最早时间(开始、完成)
                        【掌握以下即可】
                         3)当出现最早开始时间为负时，应将该工作与起点节点用虚箭线相连接，并确定时距为:STS=0;——对应 P147(4)
                         5)当有两种以上的时距(有两项及以上紧前工作)时， 分别计算最早时间，取其最大值;——对应P148(7)
                         6)最早完成时间的最大值若在中间工作，则该工作应 与终点节点用虚箭线相连接，并确定时距为:FTF=0;—— 对应P148(9)
 
                【不掌握计算过程】
                 (2)计算时间间隔LAGi,j
                 (3)计算工作总时差(逆) TFn=Tp-EFn  TFi=min{TFj+LAGi,j}
                 (4)计算工作自由时差(逆) FFn=Tp-EFn  FFi=min{LAGi,j}
                 (5)计算工作最迟完成时间 LFn=Tp LFi=EFi+TFi
                 (6)计算工作最迟开始时间 LSi=ESi+TFi
 

 */
#pragma mark 1Z203034 关键工作、关键路线和时差的确定

/*
 
 1.关键工作——总时差最小的工作【不是为零】
 
         计划工期等于计算工期，总时差为零(特例)
         要求工期小于计算工期，总时差为负
         要求工期大于计算工期，总时差为正
 
 2.四种网络计划关键工作、关键线路的确定
 
     网络类型       双代号网络计划P139                 单代号(搭接) 网络计划 P143、146                            双代号时标网络计划 P132
     关键工作                         (1)当计划工期=计算工期，总时差为0的工作;
                                    (2)当计划工期不等于计算工期，总时差最小的工作;

     关键线路
                 (1)总的持续时间最长的线路;           (1)总的持续时间最长的线路;                                 (1)总的持续时间最长的线路;
                 (2)全部由关键工作组成的线路           (2)全部由关键工作组成的线路;                                (2)全部由关键工作组成的线路;

                                                  (3)从起点到终点均为关键工作，且所有工作的时间间隔为零的线路       (3)无波形线的通路
 
 
 
 
 
 
 3.网络计划调整的方法
 
      压缩关键线路(工作)的持续时间
          当计算工期不能满足要求工期时，压缩关键工作持续时间以满足工期要求。选择关键工作时，宜考虑下述因素:
         (1)不影响质量和安全的工作;【影响不大也可以】
         (2)有充足备用资源的工作;
         (3)增加的费用最少的工作。
 
                         拓展——工期、紧后工作延误索赔
 
 责任                 工作                  赔偿方法
 
 施工方            关键工作、非关键工作      工期:不给顺延
 
 业主方、 不可抗力    关键工作              工期:延误天数就是顺延天数
                  非关键工作             工期:比较总时差，超过总时差的天数就是顺延天数
 
 业主方、 不可抗力    关键工作              紧后工作:延误天数就是影响天数
                  非关键工作             紧后工作:比较自由时差，超过自由时差的天数就是影响天数
 

 */
#pragma mark 1Z203035 进度计划调整的方法

/*
 
 一、进度计划的检查
 
     一、进度计划的检查方法
 
         1. 计划执行中的跟踪检查
                定期对实际执行情况跟踪检查，收集实际进度数据。
         2. 收集数据的加工处理
                对实际数据进行整理、统计和分析，形成可比性数据，在网络图上进行记录，及时发现进度偏差，为网络图调整提供信息。
         3. 实际进度检查记录的方式
                (1)采用时标网络计划时，实际进度前锋线。
                (2)采用无时标网络计划时，文字、数字、符合或列表。
 
         ——双代号时标网络计划六种常规考法:
         ● 最早开始时间——实箭头起点
         ● 最早完成时间——实箭头终点(或波形线的起点)
         ● 最迟开始时间=最早开始时间+总时差
         ● 最迟完成时间=最早完成时间+总时差
         ● 计算工期——终点节点与起点节点的位置之差
         ● 关键线路——无波形线的通路(逆序)
         ● 自由时差——波形线长度
         ● 总时差—— 该工作及后续线路上波形线之和的最小值
 
     ——进度计划的检查内容
         (1)关键工作进度;
         (2)非关键工作时差;
         (3)实际进度对逻辑关系的影响;
         (4)资源状况;
         (5)成本状况。
 
 二、进度计划的调整
 
     1.调整内容
 
         (1)调整关键线路的长度;
         (2)调整非关键工作时差;
         (3)增、减工作项目;【可以增加项目的 注意这项】
         (4)调整逻辑关系;
         (5)调整持续时间;
         (6)调整资源投入。
 
     2.调整方法
 
         (1)调整关键线路长度
 
                 1)拖后，选资源强度小或费用低的工作缩短持续时间。
                 2)提前，若不拟提前，选资源占用量大或直接费用高的关键工作，适当延长持续时间。
 
         (2)调整非关键工作时差——在其时差范围内进行
 
                 1)在最早开始与最迟完成时间范围内移动;
                 2)延长工作持续时间;
                 3)缩短工作持续时间。
 
         (3)增、减工作项目
 
                 1)只对局部逻辑关系进行调整;
                 2)重新计算，保证工期不变。
 
         (4)调整逻辑关系
 
                 只有要求改变施工方法或组织方法时才进行。
 
         (5)调整工作持续时间
 
                 原持续时间估计有误或实现条件不充分。
 
         (6)调整资源投入
 
                 资源供应异常，优化、应急，使其对工程影响最小。
                 网络计划的调整，可定期，也可在必要时进行。

 
 */
#pragma mark - ****************************************************************** 1Z204000 建设工程项目质量控制 23
/*
 */
#pragma mark ******************************** 1Z204010 建设工程项目质量控制的内涵 3

/*
 
 复习重点、难点、高频考点梳理
 1.建设工程五方责任主体项目负责人终身责任制
 2.项目质量的形成过程及项目质量的影响因素
 3.项目质量风险分析
 
 */
#pragma mark 1Z204011 项目质量控制的目标、任务与责任

/*
 
 
 
 一、相关概念
 
     1.质量——一组固有特性满足要求的程度。
         包括:产品质量、工作质量，运行质量。
 
         建设工程项目的质量特性主要体现在安全、适用、耐久、可靠、经济、协调性等六个方面。
 
     2.质量管理
 
         ——【建立和确定】质量方针、质量目标及质量职责，通过质量【策划、控制、保证和改进】等手段实现管理职能。
 
         根据质量管理体系标准，质量管理就是确定和建立质量方针、质量目标及职责，并在质量管理体系中通过质量策划、质量控制、质量保证和质量改进等手段来实施和实现全部质量管理职能的所有活动。
 
     3.质量控制——在【明确】的质量目标和条件下，通过【计划、实施、检查和监督】，进行质量目标的控制。
 
     质量控制的概念：
         质量控制是质量管理的一部分，
         质量控制是致力于满足质量要求的一系列活动，包括:(1)设定目标;(2)测量结果;(3)评价;(4)纠偏。
 
         工程项目的质量要求由业主提出。
         项目实施过程中，包括勘察、设计、招标采购、施工安装、竣工验收等各个阶段，各方应致力于实现业主要求的质量总目标的一系列活动。
 
 二、项目质量控制的目标与任务
 
     目标:满足建设单位需要并符合法律、规范、标准要求。
     任务:对各方质量行为和工程实体质量进行控制。
 
     对建设、勘察、设计、施工、监理单位的质量行为，以及项目工程实体质量的设计、材料、设备、安装质量进行控制。
 
     施工质量控制是项目质量控制的重点。
 
 三、项目质量控制的责任和义务
 
     1. 建设单位——第2、3、4、5、7、8、10、11条
     2. 勘察设计单位——第2、5、7条
     3. 施工单位——第3、5、6、7条
     4. 监理单位——第1、4、5条
 
     建筑工程五方责任主体项目负责人:建设、勘察、设计单位项目负责人，施工单位项目经理、监理单位总监。
 
     符合下列情形之一的，县级以上主管部门追究项目负责人质量终身责任:
     (1)发生质量事故;
     (2)发生严重质量问题;
     (3)设计使用年限内不能正常使用。
 
     质量终身责任实行书面承诺和竣工后永久性标牌制度。
 
 */
#pragma mark 1Z204012 项目质量的形成过程和影响因素分析

/*
 
 一、项目质量的基本特性
 
     反映:使用功能、安全可靠、文化艺术、工程环境 【没有经济适用】
 
 二、项目质量的形成过程
 
     1.需求识别——在决策阶段，
                 在决策阶段，为质量目标提出明确要求。
                 业主需求、法律法规要求是决定质量目标的主要依据。
 
     2.目标定义——主要在设计阶段，也涉及施工阶段
 
                 主要在设计阶段，将项目质量目标具体化。
                 承包方有时为了创品牌或创优制定更高的质量目标。
 
     3.目标实现——主要在施工阶段，包括施工准备和作业技术活动。
 
                 最重要和最关键的是在施工阶段，包括施工准备和作业技术活动。
                 其任务是把特定的劳动对象转化为符合质量标准的工程产品。
 
                 业主方，担负着整个工程项目质量总目标的策划、决策和实施的监控任务。
 
 三、项目质量的影响因素
 
     1.人的因素 ——  起决定性作用。应以控制人的因素为基本出发点
 
     2.机械的因素
 
             工程设备:组成工程实体，工程完工后拿不走的。如电梯、泵机，通风空调、消防、环保设备等。
             施工机械设备：施工机械和各类工器具统称施工机械设备，指工程完工后拿走了的。如运输、吊装、工具、仪器、设施等。
 
     3.材料（含设备）的因素——材料质量是工程质量的基础。
 
             包括工程材料、施工用料、周转材料等。
 
     4.方法的因素——也称技术因素。如多项新技术，BIM。
 
     5.环境的因素
 
             (1)自然环境:地质、水文、气象、地下、不可抗力。
             (2)社会环境:......程度、力度、【理念】、水准、高低、状况。 【理念是社会】
                     法律法规健全程度及其执法力度，项目法人决策理性化程度，建筑业经营者经营管理理念;
                     建筑市场发育程度及交易行为规范程度;
                     政府质量监督及行业管理成熟程度;
                     咨询服务业发展程度及其服务水准高低;
                     廉政管理及行风建设状况。
             (3)管理环境:质量管理体系、质量管理制度和各单位之间的协调。【制度 】
             (4)作业环境:能源介质、照明、通风、防护、给排水、交通、道路。
 
 */
#pragma mark 1Z204013 项目质量风险分析和控制

/*
 
 一、质量风险识别
 
     1.从风险产生的原因分:
 
             (1)自然风险:自然条件、自然灾害。
             (2)技术风险:技术水平局限，技术掌握、应用不当 (如新结构、技术、工艺、材料应用风险更大)。
             (3)管理风险:管理体系、制度、能力，责任心，组织，流程，分工、职能划分。
             (4)环境风险:社会环境(腐败和违法)、工作环境 (现场的五大污染)。【社会环境 和 工作环境】
 
     2.风险识别的方法
 
             风险识别可按风险责任单位和项目实施阶段分别进行，如设计单位在设计阶段或施工阶段的质量风险识别。
 
             识别分三步:
             (1)采用层次分析法画质量风险结构层次【图】;
             (2)【分析】每种风险的促发因素;
             (3)将风险识别的结果汇总成为质量风险【识别报告】。
 
     质量风险识别报告的内容:风险编号、风险种类、风险促发因素、可能发生的风险事故的简单描述以及风险承担的责任方。
 
 二、质量风险评估
 
     分析概率、损失量、风险量、风险等级。
 
     质量风险评估表的内容:编号、风险种类、风险因素、风险事件描述、发生概率、损失量、风险等级、备注。
 
 三、质量风险响应
 
     包括制定对策和编制风险管理计划。
 
     1.对策
             规避:    避免更大的风险。依法招投标，慎选单位;正确选址，避开灾害;选用成熟可靠的方案;合理安排工期进度。
             减轻:    制定对策，把风险降到最低。制定预案，落实质量保证措施。
             转移:    组成联合体、分包、担保、保险。
             自留:    自我承担，分为无计划自留和有计划自留(设立风险基金、预留不可预见费)。
 
     2.质量风险管理计划表
 
             内容:编号、风险事件、风险等级、响应策略、主要监控措施、责任部门、责任人、备注。
     二、质量风险管理计划
     内容：
     (1)质量风险管理方针、目标;
     (2)质量风险识别和评估结果;
     (3)风险应对策略和具体措施;
     (4)风险控制的责任分工;
     (5)相应的资源准备计划。
 
 四、质量风险控制
 
             监控、预测、预警。
 
 */
#pragma mark ******************************** 1Z204020 建设工程项目质量控制体系 3

/*
 
 复习重点、难点、高频考点梳理
 1.项目质量控制体系的特点
 2.项目质量控制体系的建立和运行
 3.企业质量管理体系的建立和运行
 4.企业质量管理体系文件的构成
 
 */
#pragma mark 1Z204021 全面质量管理思想和方法的应用

/*
 
 一、全面质量管理(TQC)的思想
 
     全面质量管理、全过程质量管理、全员参与质量管理
 
     1.全面质量管理
 
             指【项目参与各方】进行质量管理的总称，包括对【工程(产品)质量】和【工作质量】的全面管理。
 
     2.全过程质量管理——强调 “过程方法”原则。
 
             要控制的主要过程有:
             项目策划与决策过程;
             勘察设计过程;
             设备材料采购过程;
             施工组织与实施过程;
             检测设施控制与计量过程;
             施工生产的检验试验过程;
             工程质量的评定过程;
             工程竣工验收与交付过程;
             工程回访维修服务过程等。
 
     3.全员参与质量管理——每个部门，每个工作岗位。
 
             运用目标管理方法，将质量总目标逐级分解，发挥全体员工的作用
 
 二、质量管理的PDCA循环
 
     PDCA循环，是建立质量管理体系和进行质量管理的基本方法。
 
     1.计划 P
         确定质量目标，制定行动方案。
     2.实施 D
         将质量的目标值转为质量的实际值
         行动方案部署交底，作业技术活动。
     3.检查 C
         是否执行了行动方案，实际条件是否发生了变化， 不执行的原因，执行的结果。
     4.处置 A
         纠偏和预防改进。
 
 */
#pragma mark 1Z204022 项目质量控制体系的建立和运行

/*
 
 一、性质、特点和构成
 
     (一)性质
             1.以项目为对象，由总组织者负责建立;
             2.是项目管理组织的一个目标控制体系(仅是其中一个);
             3. 一次性。
 
     (二)特点(与企业质量管理体系对比) 排除法解题
 
             1.目的不同——只用于特定的项目质量控制   【用于企业】
             2.范围不同——涉及项目所有质量责任主体  【只针对企业】
             3.目标不同——是项目的质量目标       【企业的质量管理】
             4.时效不同——一次性 （是一次性 不是短期）  【有效期三年】
             5.方式不同——由总组织者自我评价诊断，不需第三方认证  【第三方认证】
 
                                    项目质量控制系统                           企业质量管理系统
             建立的目的              特定项目质量控制                         建筑企业或组织的质量管理
             服务的范围              所有质量责任主体                        一个承包企业或组织机构
             控制的目标              项目的质量目标                     具体建筑企业或组织的质量管理目标
             作用的时效                  一次性                                  永久
             评价的方式              自我评价与诊断                             第三方认证

     (三)结构
 
             1.多层次结构
 
                     第一层次（业主），建设单位、代建方、受托方、【项目总包】的项目管理机构
                     第二层次（总包），设计总负责、【施工总承包】
                     第三层次（分包），承担设计、施工、供货的各承包单位
 
             2.多单元结构
                     第二层次及以下的质量保证体系可能有多个(即总包、分包可能有多个单位)。
 
 二、项目质量控制体系的建立
 
     (二)建立的程序  【记忆顺序】
                 1.确立网络——明确各层面质量控制负责人。
                 2.制定制度——例会制、协调制等，形成管理文件或手册。
                 3.分析界面
                         静态界面:法律法规、合同、组织分工。
                         动态界面:各单位之间的衔接配合。
                 4.编制计划——总组织者编总的，各责任主体编各自的。
 
     (三)建立的责任主体
                 由建设单位或项目总包的项目管理机构负责建立。 区别于P181 施工质量计划由施工单位编制。
 
 三、项目质量控制体系的运行
 
     1.运行环境
                 项目的合同结构;质量管理的资源配置、质量管理组织制度。
 
                 建设工程项目质量控制体系的运行环境：
                 ①建设工程的合同结构——纽带
                 ②质量管理的人员和资源配置——基础条件
                 ③质量管理的组织制度——评价的依据，运行的保证。
 
     2.运行机制——内在动力
 
                 (1)动力机制——【核心机制】，来源于竞争机制、利益机制
                 (2)约束机制——【取决于内部自我约束、外部监控效力】
                 (3)反馈机制——信息反馈
                 (4)持续改进机制——PDCA循环原理
 
 */
#pragma mark 1Z204023 施工企业质量管理体系的建立和认证

/*
 
 一、质量管理八项原则
 
     1. 以顾客为关注焦点【不是产品】
     2. 领导作用
     3. 全员参与
     4. 过程方法:作为过程  【不是全过程控制】
     5. 持续改进:永恒目标
     6. 循序决策：基于事实的决策方法:数据、信息、决策
     7. 关系管理：与供方互利的关系
 
 二、企业质量管理体系文件构成：
     【质量方针和质量目标、质量手册、程序性文件、质量记录】
 
     1.质量方针和质量目标
             反映用户、社会对质量的要求及企业的承诺。
 
     2.质量手册——【纲领性文件】
 
             对企业质量体系作系统、完整和概要的描述。
             【内容包括】:
                     企业的质量方针、质量目标;
                     组织机构及质量职责;
                     体系要素或【基本控制程序】;
                     质量手册的评审、修改和控制的管理办法。
 
     3.程序性文件——支持性文件、细则
 
             【各项管理标准、规章制度都属于程序性文件】。
 
             【一般有以下六个方面的通用性管理程序】:
             (1)文件控制程序;
             (2)质量记录管理程序;
             (3)内部审核程序;
             (4)不合格品控制程序;
             (5)纠正措施控制程序;
             (6)预防措施控制程序。
     4.质量记录
             质量活动进行及结果的客观反映。
 
 三、企业质量管理体系的运行
 
     (4)落实企业质量体系内审程序的目的:P176
             1)评价执行情况;
             2)揭露问题，为【改进】提供依据;
             3)检查质量体系运行信息;
             4)向【外审】单位提供证据。
 
 四、企业质量管理体系的认证与监督
 
     1.认证机构:公正的第三方
     2.维持与监督管理 有效期3年
         企业通报、监督检查、认证注销、..、复评、重新换证。
         (4)认证暂停:体系不符合要求的警告措施;
         (5)认证撤销:企业可以提出申诉，并在一年后可重新提出认证申请;
 
     认证注销是企业的自愿行为。
     在企业质量管理体系发生变化或证书有效期届满未提出重新申请等情况下，认证持证者提出注销的，认证机构予以注销，收回该体系认证证书。
 
     企业质量管理体系的维持与监督管理内容如下：
     ①企业通报。
     ②监督检查：包括定期和不定期的监督检查。定期检查通常是每年一次。
     ③认证注销：注销是企业的自愿行为。
     ④认证暂停。
     ⑤认证撤销：企业可以提出申诉，撤销后一年后可重新提出认证申请。
     ⑥复评。
     ⑦重新换证：标准变更、范围变更、证书持有者变更。
 
 */
#pragma mark  ******************************** 1Z204030 建设工程项目施工质量控制 5

/*

 复习重点、难点、高频考点梳理
 1.施工质量控制的基本环节
 2.施工质量计划的编制及审批
 3.施工准备的质量控制
 4.施工过程的质量控制
 
 */
#pragma mark 1Z204031 施工质量控制的依据与基本环节

/*
 
 一、施工质量控制的依据
 
     1. 共同性依据

         与质量管理有关的法律法规。
 
     2. 专业技术性依据
 
         与质量管理有关的规范、规程、标准、规定。
 
     3. 项目专用性依据
 
         本项目的合同、设计文件、交底会审记录、变更通知、会议记录和工程联系单。
 
 一、施工质量的基本要求
 
     最基本要求:实体质量验收合格。
     验收合格的规定:
     (1)符合勘察、设计文件的要求:
     (2)符合标准和相关专业验收规范的规定。
         规定(1)按图施工;
         规定(2)依法施工;另，践约施工。
 
 二、施工质量控制的基本环节
 
     1.事前——施工前，编计划，明目标，定方案，设管理点，【落实责任】，分析影响因素，制定预防措施。
 
     2.事中——包括自我控制(自己活动行为的约束)和外部监控(活动过程 和结果的监督检查)。自控、监控主体分别是?P192、P193
 
         自控是关键、是决定性因素。
 
         目标:确保工序质量合格。
         关键:坚持质量标准。
         重点:对工序质量、工作质量和质量控制点的控制。
     3.事后——结果评价、认定，纠偏，整改，处理。
 
 */
#pragma mark 1Z204032 施工质量计划的内容与编制方法

/*
  一、施工质量计划的形式和内容
 
     施工质量计划包含在企业质量管理体系中，以施工项目为对象。
 
     1.形式
         (1)施工质量计划;
         (2)施工组织设计(含施工质量计划);
         (3)管理实施规划(含施工质量计划)。
 
     2.施工质量计划基本内容【记忆】
         (1)工程特点施工条件分析;
         (2)质量总、分目标;
         (3)【质量管理组织机构】和职责，人员及资源配置;
         (4)技术方案和【施工组织方案】;
         (5)材料、设备等的质量管理及控制措施;
         (6)施工质量检验的安排、方法、标准;
         (7)【施工质量控制点】及其跟踪控制的方式与要求;
         (8)质量记录的要求。
 
 
 二、施工质量计划的编制与审批
     1.编制主体
             由自控主体即施工承包企业编制。
             平行发包，各单位分别编制;
             总分包模式，总编总，分编分，分作为总的一部分。
             总对分指导和审核，并承担连带责任。
 
     2.施工质量计划的审批
         (1)企业内部审批
             由施工企业项目经理部主持编制，报企业组织管理层批准。
         (2)项目监理机构审查
             施工单位开工前填写《施工组织设计报审表》，报送监理机构审查;符合要求，总监签认报建设单位;需要调整，重新审查。
 
 三、施工质量控制点的设置与管理
 
     1.质量控制点的设置
 
             工程施工质量控制点应选择 技术要求高、施工难度大、质量影响大、发生质量问题危害大的对象进行设置。
 
             质量控制点的选择原则通常包括：
             (1)关键、隐蔽;
             (2)薄弱、不稳定;
             (3)较大影响;
             (4)新技术、新工艺、新材料; 【不包括新员工】
             (5)难;
             (6)不良。
 
     2.质量控制点的重点控制对象
 
             (1)人的行为(生理、心理、技术能力)
             (2)材料的质量与性能(高强螺栓、焊条、水泥)
             (3)施工方法与关键操作(预应力张拉、大模、滑模、升板法施工)
             (4)施工技术参数(...量、比、度、等级)
             (5)技术间歇(砌筑与抹灰、混凝土浇筑与模板拆除)
             (6)施工顺序(先焊后拉)
             (7)质量通病(研究对策，制定预防措施)
 
     3.质量控制点的管理
 
             首先，事前预控;其次，交底;还要，动态设置、动态跟踪管理。
 
             专项施工方案或作业指导书，经施工单位技术负责人、项目总监、建设单位项目负责人签字。超过一定规模的危险性较大的分部分项工程，还要组织专家论证。
 
         质量控制点，分为“见证点”和“待检点” 。
             见证点:重要部位、特种作业、专门工艺;24h
             待检点:隐蔽工程。
 
 */
#pragma mark 1Z204033 施工生产要素的质量控制

/*
 一、施工人员的质量控制
 
     坚持执业资格注册制度和作业人员持证上岗制度。
 
 二、材料设备的质量控制
 
     优先采用节能低碳的新型建筑材料和设备。
 
 三、工艺方案的质量控制
 
     制定合理有效的施工技术方案和组织方案。
     合理选用机械设备和临时设施，合理布置施工总平面图和各阶段施工平面图
 
 四、施工机械的质量控制
 
     施工机械设备，从【设备选型、性能参数、操作要求】等方面加以控制
     模具、脚手架等施工设备，需按【设计、施工】要求进行专项设计。
     危险性较大的起重机械设备，安装方案要审批，使用前经专业管理部门验收。
 
 五、施工环境因素的控制
 
     要减少环境对施工质量的不利影响，主要是采取【预测预防】的风险控制方法
 
 
 
 1.技术方案:施工工艺、施工方法;
   组织方案:区段划分、施工流向、劳动组织。
 2.施工机械设备，应从设备选型、性能参数、操作要求等方面加以控制。
 3.模具、脚手架等施工设备，需按设计、施工要求进行专项设计。
 4.危险性较大的起重机械设备，安装方案要审批，使用前经专业管理部门验收。
 
 5.施工环境因素控制，采取【预测预防】的风险控制方法。
 
 */
#pragma mark 1Z204034 施工准备的质量控制

/*
 
 一、【施工技术准备】的质量控制
 
     施工前，室内进行。
                 如:熟悉图纸、设计交底、图纸会审、项目划分、细化方案、编制作业指导书、绘制各种详图(放线、大样、配筋、配板、配线图)、技术交底、技术培训。完善控制措施，明确控制对象和方法。
 
 二、【现场施工准备】的质量控制
 
    施工过程中，施工现场
 
     1.计量控制 ——  按规定对计量器具进行维修和校验，统一计量单位，组织量值传递，保证量值统一。
     2.测量控制 ——  测量控制方案，由项目技术负责人批准。
                 测量控制点线，建设单位提供、施工单位复核、监理审核。
     3.平面图控制
 
 三、工程质量检查验收的项目划分
 
     工程质量验收划分为单位、分部、分项和检验批。
 【成本划分：单项、单位、分部、分项】
 
     划分原则:
         单位工程——独立使用功能
         分部工程——专业性质、工程部位
         分项工程——工种、材料、工艺、设备
         检验批 ——工程量、楼层、施工段、变形缝。
 
     检验批应由专业监理工程师组织施工单位项目专业质量检查员、专业工长等进行验收。
 
     分项工程是由专业监理工程师组织验收的，分部工程师由总监理工程师组织验收的，
     检验批是工程验收的最小单元，是分项工程乃至整个建筑工程质量验收的基础。
     分部工程所包含的全部分项工程质量验收合格，仅仅是分部工程验收合格的一部分条件，还包括质量控制资料应完整，有关安全、节能、环境保护和主要使用功能的抽样检验结果应符合相应规定，观感质量要符合要求
 
     检验批质量验收合格应符合下列规定:
     (1)主控项目的质量经抽样检验均应合格;
     (2)一般项目的质量经抽样检验合格;
     (3)具有完整的施工操作依据、质量验收记录。
 
 */
#pragma mark 1Z204035 施工过程的质量控制

/*
 
 
 
 一、工序施工质量控制
 
     施工过程质量控制，属于事中质量控制。
 
     工序质量控制，首先是作业者的自控，其次是作业者外部的检查、监督。
 
     对施工过程的质量控制，必须以【工序】质量控制为基础和核心，工序质量控制是施工质量控制的重点。
 
     工序施工质量控制包括:
     1.【工序施工条件控制】——生产要素、生产环境
     2.【工序施工效果控制】——质量特征、特性指标
 
     工序施工效果控制，属于事后质量控制。
 
     下列工序质量必须现场检测，合格后才能进行下道工序:(依据“事后”判断，注意记忆数据 必考)
     (1)地基基础工程:地基承载力，桩的承载力，桩身质量
     (2)主体结构工程:混凝土、砂浆、砌体强度，钢筋及钢筋半成品、钢筋网片质量，钢筋保护层厚度，预制构件结构性能
     (3)建筑幕墙工程:硅酮结构胶相容性
     (4)钢结构及管道工程:钢结构力学性能 【钢结构 不是钢材】
 
     1.地基基础工程
     　　(1)地基及复合地基承载力检测
         　　对灰土地基、砂和砂石地基、土工合成材料地基、粉煤灰地基、强夯地基、注浆地基、预压地基，其竣工后的结果(地基强度或承载力)必须达到设计要求的标准。检验数量，每单位工程不应少于3点，l000m2以上工程，每l00m2至少应有1点，3000m2以上工程，每300m2至少应有1点。每一独立基础下至少应有1点，基槽每20延米应有1点。
         　　对水泥土搅拌桩复合地基、高压喷射注浆桩复合地基、砂桩地基、振冲桩复合地基、土和灰土挤密桩复合地基、水泥粉煤灰碎石桩复合地基及夯实水泥土桩复合地基，其承载力检验，数量为总数的0.5%～1%，但不应小于3处。有单桩强度检验要求时，数量为总数的0.5%～1%，但不应少于3根。
     　　(2)工程桩的承载力检测
         　　对于地基基础设计等级为甲级或地质条件复杂，成桩质量可靠性低的灌注桩，应采用静载荷试验的方法进行检验，检验桩数不应少于总数的1%，且不应少于3根，当总桩数少于50根时，不应少于2根。
         　　设计等级为甲级、乙级的桩基或地质条件复杂，桩施工质量可靠性低，本地区采用的新桩型或新工艺的桩基应进行桩的承载力检测。检测数量在同一条件下不应少于3根，且不宜少于总桩数的1%。
     　　(3)桩身质量检验
         　　对设计等级为甲级或地质条件复杂，成桩质量可靠性低的灌注桩，抽检数量不应少于总数的30%，且不应少于20根;其他桩基工程的抽检数量不应少于总数的20%，且不应少于10根;对混凝土预制桩及地下水位以上且终孔后经过核验的灌注桩，检验数量不应 少于总桩数的10%，且不得少于10根。每个柱子承台下不得少于1根。
 　　2.主体结构工程
     　　(1)混凝土、砂浆、砌体强度现场检测
         　　检测同一强度等级同条件养护的试块强度，以此检测结果代表工程实体的结构强度。
 
         　　混凝土：按统计方法评定混凝土强度的基本条件是，同一强度等级的同条件养护试件的留置数量不宜少于10组，按非统计方法评定混凝土强度时，留置数量不应少于3组。
 
         　　砂浆抽检数量：每一检验批且不超过250m3砌体的各种类型及强度等级的砌筑砂浆，每台搅拌机应至少抽检一次。
 
         　　砌体：普通砖15万块、多孔砖5万块、灰砂砖及粉灰砖10万块各为一检验批，抽检数量为一组。
 
     　　(2)钢筋保护层厚度检测
         　　钢筋保护层厚度检测的结构部位，应由监理(建设)、施工等各方根据结构构件的重要性共同选定。
 
         　　对梁类、板类构件，应各抽取构件数量的2%且不少于5个构件进行检验。
 
     　　(3)混凝土预制构件结构性能检测
 
         　　对成批生产的构件，应按同一工艺正常生产的不超过1000件且不超过3个月的同类型产品为一批。在每批中应随机抽取一个构件作为试件进行检验。
 
 　　3.建筑幕墙工程
     　　(1)铝塑复合板的剥离强度检测。
     　　(2)石材的弯曲强度;室内用花岗石的放射性检测。
     　　(3)玻璃幕墙用结构胶的邵氏硬度、标准条件拉伸粘结强度、相容性试验;石材用结构胶结强度及石材用密封胶的污染性检测。
     　　(4)建筑幕墙的气密性、水密性、风压变形性能、层间变位性能检测。
     　　(5)硅酮结构胶相容性检测。
 　　4.钢结构及管道工程
     　　(1)钢结构及钢管焊接质量无损检测：对有无损检验要求的焊缝，竣工图上应标明焊缝编号、无损检验方法、局部无损检验焊缝的位置、底片编号、热处理焊缝位置及编号、焊缝补焊位置及施焊焊工代号;焊缝施焊记录及检查、检验记录应符合相关标准的规定。
     　　(2)钢结构、钢管防腐及防火涂装检测。
     　　(3)钢结构节点、机械连接用紧固标准件及高强度螺栓力学性能检测。
 
 
 钢筋保护层厚度检测的结构部位，应由监理（建设）、施工等各方根据结构构件的重要性共同选定。
 对梁类、板类构件，应各抽取构件数量的2%且不少于5个构件进行检验。
 
 二、施工作业质量自控
 
     1.自控主体:施工单位;
     2.自控程序:作业技术交底(是最基层的技术管理交底活动)、作业活动实施、作业质量三检(自检、互检、专检);
 
     作业技术交底是施工组织设计和施工方案的具体化，是最基层的技术管理交底活动
 
     施工单位内部的自检、互检、专检和交接检，以及现场监理机构的旁站检查和平行检验
 
 三、施工作业质量监控
 
     1.监控主体:建设、监理、设计、质监单位
     2.现场质量检查的内容
             1 开工前检查——开工条件;
             2 工序交接检查——自检、互检、专检;
             3 隐蔽工程检查;
             4 停工后复工检查;
             5 分项、分部工程完工检查;
             6 成品保护检查。
 
         现场质量检查包括工序交接检查，应严格执行 自检自查、互检互查、专职管理人员的质量检查 制度。
 
     3.现场质量检查的方法
 
             (1)目测法 —— 看、【摸、敲、照】  【不仅仅是看】
             (2)实测法 ——
                     靠:直尺、塞尺检查平整度;
                     量:测量工具、计量仪表检查偏差，坍落度;
                     吊:垂吊线检查垂直度;
                     套:方尺套方，阴阳角、踢脚线、对角线
             (3)试验法 ——
 
                     理化试验
                             物理力学性能检验
                                     力学指标测定，如抗拉、抗压、抗弯、抗折、冲击韧性、硬度、承载力等。
                                     物理性能测定，如密度、含水量、凝结时间、安定性、抗渗、耐磨、耐热性等。
                             化学成分及性质测定
                                     如钢筋中的磷、硫含量，混凝土中粗骨料中的活性氧化硅成分，以及耐酸、耐碱、抗腐蚀性等。
                             现场试验
                                     静载试验、通水试验、耐压试验、蓄水、淋水试验。
                     无损检测
                             表面探测内部结构或损伤情况。超声波、X射线、γ射线探伤。
 
     4.技术核定、隐蔽工程验收及成品保护
 
             (1)技术核定
 
                     施工方以技术核定单的方式向监理提出，报送设计单位确认。
 
             (2)隐蔽工程验收程序
 
                     施工方自检合格，填写《隐蔽工程验收单》，事先通知监理及有关方;按约定时间验收，验收合格，各方共同签署验收记录;验收不合格，整改、重新验收。
 
             (3)成品保护
                     防护、覆盖、封闭、包裹。
 
 */
#pragma mark 1Z204036 施工质量与设计质量的协调

/*
 
 一、项目设计质量的控制
 
         项目设计质量的控制 以使用功能、安全可靠性为核心。
 
         进行下列设计质量的综合控制:
         1. 功能性;
         2. 可靠性;
         3. 观感性;
         4. 经济性;
         5. 施工可行性
 
 二、施工与设计的协调
 
         1.设计联络
                 了解设计意图、设计进度、提出合理化建议
         2.设计交底和图纸会审
                 (1)设计交底: 1理解设计意图; 2了解设计内容和技术要求; 3明确质量控制重点难点。
                 (2)图纸会审: 1解决各专业设计之间的矛盾; 2消除施工图的差错。
         3.设计现场服务和技术核定
         4.设计变更
 
 */
#pragma mark  ******************************** 1Z204040 建设工程项目质量验收 4

/*

 */
#pragma mark 1Z204041 施工过程的质量验收

/*
 
 施工过程中质量验收的内容，勘察单位，设计单位项目负责人和施工单位技术，质量部门负责人应当参加地基与基础分部工程验收，
 设计单位项目负责人和施工单位技术，质量部门负责人应当参加主体结构，节能分部工程的验收。
 
 工程符合下列条件方可进行竣工验收:
 (1) 完成工程设计和合同约定的各项内容。
 (2) 施工单位提出工程竣工报告。工程竣工报告应经项目经理和施工单位有关负责人审核签字。
 (3) 监理单位提出工程质量评估报告。工程质量评估报告应经总监理工程师和监理单位有关负责人审核签字。
 (4) 勘察、设计单位提出质量检查报告。质量检查报告应经该项目勘察、设计负责人和勘察、设计单位有关负责人审核签字。
 (5) 有完整的技术档案和施工管理资料。
 (6) 有工程使用的主要建筑材料、建筑构配件和设备的进场试验报告，以及工程质量检测和功能性试验资料。
 (7) 建设单位已按合同约定支付工程款。
 (8) 有施工单位签署的工程质量保修书。
 (9) 对于住宅工程，进行分户验收并验收合格，建设单位按户出具《住宅工程质量分户验收表》。
 (10) 建设主管部门及工程质量监督机构责令整改的问题全部整改完毕。
 (11) 法律、法规规定的其他条件。
 
 竣工验收：单位验收
 施工过程验收：检验批、分项、分部
 
 一、施工过程的质量验收(检验批、分项、分部)
 
     1.检验批合格规定:(验收的最小单位)
             (1)主控项目均应合格;
             (2)一般项目合格; ====
             (3)完整记录。------
 
     2.分项工程合格规定:
             (1)检验批合格;
             (2)记录完整。------
 
     3.分部工程合格规定:
             (1)分项工程合格;
             (2)资料完整;*****
             (3)安全、节能、环保和主要使用功能符合规定;
             (4)观感质量符合要求。(不给“合格、不合格”  符合要求和不符合要求)  ######
 
             分部工程验收还需对地基基础、主体结构、设备安装分部工程进行【见证取样试验或抽样检测】;
 
             还需要对观感质量进行验收，并综合给出质量评价，评价为“差”的进行补救。(不给“合格、不合格”)
 
     4 单位工程质量验收合格应符合下列规定：
             1、所含分部工程的质量均应验收合格。
             2、质量控制资料应完整。  *****
             3、所含分部工程中有关安全、节能、环境保护和主要使用功能的检验资料应完整。 （增加文字）
             4、主要使用功能的抽查结果应符合相关专业验收规范的规定。
             5、观感质量应符合要求。  ######【必须验收观感质量】
 
         单位工程质量验收也称质量竣工验收，是建筑工程投入使用前的最后一次验收，也是最重要的一次验收。
 
 【
    观感质量、资料完整  单位和分部
    记录完整          分项、检验批
    主控项目、一般项目   检验批
 
 】
 
     分别由谁组织验收?
     检验批 ——由专业监组织验收。        由专业监理工程师组织施工单位项目专业质量检查员、专业工长等进行验收
     分项工程——由专业监组织验收。        由专业监理工程师组织施工单位项目专业技术负责人等进行验收
    分部工程——由总监组织验收。         由总监理工程师组织施工单位项目负责人和项目技术负责人等进行验收;
                                 【勘察】、设计单位项目负责人和施工单位技术、质量部门负责人应参加【地基与基础】分部工程验收;
                                 设计单位项目负责人和施工单位技术、质量部门负责人应参加【主体结构、节能】分部工程验收。
     单位工程---总监组织预验收  建设单位组织验收
 
 二、施工过程质量验收不合格的处理
 
     1.严重缺陷推倒重做，一般缺陷返修更换，重新验收;
     2.检测单位鉴定达到设计要求，予以验收;
     3.原设计单位核算满足安全和使用，予以验收;
     4.加固处理，按技术处理方案和协商文件验收;
     返修或加固处理后仍不能满足，严禁验收
 
 
 考点3 :装配式预制构件的质量验收
 
 1.预制构件进场时应检查【质量证明文件或质量验收记录】
 
 2.梁板类简支受弯预制构件进场时应进行【结构性能检验】
 
 3.钢筋混凝士构件和允许出现裂缝的预应力混凝土构件应进行【承载力、挠度和裂缝宽度】检验,
     不允许出现裂缝的预应力混凝土构件应进行【承载力、挠度和抗裂检验】;
 
 4.不可单独使用的叠合板预制底板,可【不进行】结构性能检验。
     对叠合梁构件,是否进行结构性能检验、结构性能检验的方式应根据【设计要求】确定。
 
 */
#pragma mark 1Z204042 竣工质量验收

/*
 
 一、验收依据
 
    【施工单位的内部文件不能是依据】
 
     (1)法律法规、条例、办法;
     (2)工程施工质量验收统一标准;
     (3)专业工程施工质量验收规范;
     (4)批准的设计文件、施工图纸及说明书;
     (5)工程施工承包合同;
 
 二、验收条件
 
     (2)施工单位自检合格，提出【竣工报告】;
     (3)监理单位提出【质量评估报告】;
     (4)勘察、设计单位提出【质量检查报告】;
     (8)施工单位签署质量保修书。
     验收合格后，建设单位提出【竣工验收报告】
 
 三、验收标准——单位工程合格规定
 
     1、所含分部工程的质量均应验收合格。
     2、质量控制资料应完整。
     3、所含分部工程中有关安全、节能、环境保护和主要使用功能的检验资料应完整。 （增加文字）
     4、主要使用功能的抽查结果应符合相关专业验收规范的规定。
     5、观感质量应符合要求。
 
     住宅工程要分户验收。
     建设单位组织施工、监理等单位，对每户及公共部位的观感质量和使用功能进行检查验收。
     验收完毕，填写《住宅工程质量分户验收表》;建设、施工单位项目负责人，监理单位总监分别签字。
     《住宅工程质量分户验收表》作为《住宅质量保证书》的附件，一同交给住户。
     分户验收不合格，不能进行整体竣工验收。
 
     在住宅工程各检验批、分项、分部工程验收合格的基础上在住宅工程竣工验收前，建设单位应当组织施工，监理等单位依据国家有关工程质量验收标准对每户住宅及相关公共部位的观感质量和使用功能进行检查验收。
     每户住宅和规定的公共部位验收完毕，应当填写住宅工程质量分户验收表建设单位和施工单位项目负责人、监理单位项目总监理工程师要分别签字。
     住宅工程质量分户验收的主要内容包括建筑节能和采暖工程质量
 
 四、验收程序和组织
 
     分包工程完工后，分包单位自检，按规定的程序进行验收。验收时，总包单位派人参加
     单位工程完工后，施工单位自检，总监理工程师组织竣工预验收。存在问题，施工单位及时整改
 
     总监组织竣工预验收。
 
     验收程序:
         (1)施工单位提交工程竣工报告(须总监签署意见)，申请竣工验收。
         (2)建设单位组成验收组，制定验收方案。
         (3)建设单位在竣工验收【7 】个工作日前将验收的时间、地点以及验收组名单书面通知质监机构。
         (4)建设单位组织竣工验收。  不能形成一致意见时，协商，待意见一致后，重新组织工程竣工验收。
 
             1 五个责任单位分别汇报;
             2 查阅五个责任单位的档案资料;
             3 实地查验工程质量;
             4 全面评价。
 
 五、竣工验收报告 （是建设单位验收工程相关的）
 
     验收合格后，建设单位提出【竣工验收报告】。
 
     竣工验收报告的内容:
         工程概况;
         【建设单位】执行基本程序情况;
         对勘察、设计、施工、监理的评价;
         验收时间、程序、内容、组织形式;
         竣工验收意见。
         还应附文件:
             施工许可证;
             设计文件审查意见;
             竣工报告;
             质量评估报告;
             质量检查报告;
             质量保修书;
             竣工验收意见。
 
 六、验收备案 （政府部门验收工程相关的）
 
     建设单位应当自竣工验收合格之日起15日内备案。
     备案应提交的文件:
     (1)竣工验收备案表;
     (2)竣工验收报告;
     (3)规划、环保部门的认可文件;
     (4)消防部门的合格证明文件;
     (5)质量保修书。
 
 【注意区分 备案资料 和 竣工验收报告的资料】
 
 
 */
#pragma mark ******************************** 1Z204050 施工质量不合格的处理 4

/*
 
 复习重点、难点、高频考点梳理
 
 1.工程质量事故的分类
 2.施工质量事故发生的原因
 3.施工质量事故报告和调查处理程序
 4.施工质量缺陷处理的基本方法
 
 
 */
#pragma mark 1Z204051 工程质量问题和质量事故的分类

/*
 质量不合格、质量缺陷、质量问题、质量事故的相关概念：
 
 凡工程产品没有满足某个规定的要求就称之为质量不合格；
 而未满足某个与预期或规定用途有关的要求，称之为质量缺陷。
 质量不合格，影响使用功能或结构安全，造成永久质量缺陷或存在重大质量隐患，甚至直接导致倒塌或伤亡，必须进行返修、加固或报废处理，按照直接经济损失的大小分为质量问题和质量事故。
 
 
 二、工程质量事故的分类
 
 1.按损失程度分级 (313\151\151，往严重的靠)
 
     事故等级       死亡（人）      重伤 (人)         【直接】经济损失 (万元)
     特大          R≥30          R≥100              M≥10000
     重大         10≤R< 30       50≤R< 100        5000≤M<10000
     较大         3≤R<10          10≤R<50         1000≤M<5000
     一般          R<3            R<10              M<1000
 
 按事故的责任分类
 
        指导责任事故（管理人员的责任）
                 指导或领导失误。如，不按规范指导施工，强令他人违章作业，片面追求施工进度，降低施工质量标准等。
        操作责任事故（一线操作工责任）
                 操作者不按规程和标准实施操作。如，浇筑混凝土随意加水，或振捣疏漏等。
        自然灾害事故
                 不可抗力。如地震、台风、暴雨、雷电及洪水。
 */
#pragma mark  1Z204052 施工质量事故的预防

/*

 一、施工质量事故发生的原因
 
     1.技术原因:勘察、设计、施工在技术上的失误。
     2.管理原因:管理不完善。如，体系不完善，措施不力，【违章作业】、制度不严，控制不严，检验不严，检测仪器管理不善失准等。
     3.社会、经济原因:社会上的不正之风，七无 三边（边勘察边设计边施工）， 盲目追求利润，随意压低标价，偷工减料等。
     4.人为事故和自然灾害原因:人为，不可抗力。
 
二、施工质量事故预防的具体措施
 
    1.严格按照基本建设程序办事
    2.认真做好地质勘察
    3.科学加固处理好地基
    4.进行必要的设计审查复核
    5.严格把好建材及制品质量关
    6.对施工人员进行必要的技术培训
    7.依法进行施工组织管理
    8.做好应对不利施工条件和各种灾害的预案
    9. 加强施工安全与环境管理
 
 */
#pragma mark 1Z204053 施工质量问题 和质量事故的处理

/*
 
 二、施工质量事故处理程序 (8步)
 
 若事故不要处理，步骤:事故报告、事故调查、原因分析、【事故结论、提交事故处理报告】(5步)
 
     1.事故报告
 
         事故发生，现场人员立即向建设单位负责人报告，建设单位负责人1小时内上报。
         事故报告的内容:简要的、初步的......
 
     2.事故调查
 
         未造成人员伤亡的一般事故，县级人民政府可以委托事故发生单位组织调查
         事故调查报告的内容:单位概况，事故经过，救援情况，人员伤亡直接经济损失，技术分析报告，原因性质，责任认定，责任者处理建议， 防范整改措施。
 
     3.原因分析
         必要时要组织检测鉴定和专家技术论证。
     4.制定处理方案
         要做到安全、可行、经济、满足使用功能
     5.事故处理(技术处理，责任处罚)
         包括技术处理，责任处罚。
     6.检查验收
     7.事故结论
     8.提交处理报告
 
         事故处理报告的内容:【原始资料数据】，【原因分析论证】，处理依据，处理方案措施，处理过程资料，【检查验收记录】，【责任者处罚】和事故处理结论，等。
 
 【注意区分 处理报告和调查报告的内容】
 
 三、施工质量事故处理的基本方法
 
     1.修补处理
             蜂窝、麻面、局部损伤、裂缝。
 
             缝窄，表面密封;
             缝宽，嵌缝密闭;
             缝深，灌浆修补。
     3.返工处理
             堤坝填筑压实、桥梁预应力张拉、住宅误用水泥、基础混凝土强度达不到。
 
     4.限制使用:修补后无法保证使用安全要求，又无法返工。
     5.不作处理
             (1)【工业建筑物】放线【定位偏差，干缩微裂】; 【裂缝 返修】
             (2)【轻微】麻面、【楼面平整度偏差】;【麻面 返修】
             (3)检测单位鉴定合格;
             (4)原设计单位核算，仍能满足。
 
     混凝土墙表面轻微麻面，可通过后期的抹灰、喷涂或刷白等工序弥补，可不做专门处理
     隐蔽部位结构混凝土出现混凝土表面裂缝，经检查分析，属于表面养护不够的干缩裂缝，不影响使用及外观，可不做处理
 
 */
#pragma mark ******************************** 1Z204060 数理统计方法在工程质量管理中的应用 4

/*
 
 */
#pragma mark 1Z204061 分层法的应用

/*
 
 一、基本原理——分门别类
 
         对工程质量状况的调查和质量问题的分析,必须【分门别类】地进行,以便准确有效地找出问题及其原因所在,这就是分层法的基本思想
 
         分层调查的统计数据表1Z204061，【个体不合格率最大的，对质量影响最大】。
 
 二、实际应用
         应用分层法的关键:调查分析的类别和层次划分。
         根据管理需要和统计目的，取得原始数据。
 
 由于工程质量形成的影响因素多，所以对工程质量状况 的调查和质量问题的分析必须分门别类地进行，以便准确 地找出问题及其原因。这是分层法的基本思想。

 */
#pragma mark 1Z204062 因果分析图法的应用

/*
 
 一、基本原理
 
         也称质量特性要因分析法。对每个质量特性或问题，【逐层深入排查，确定最主要原因】。
 
 二、应用注意事项
 
         (1)一个特性或一个问题 一张图。
         (2)采用QC小组，集思广益。
         (3)可以邀请小组以外人员参与，广泛听取意见。
         (4)层层深入，排出所有可能原因。
         (5)采用投票或其他方式，选择1至5项最主要原因。
 
 */
#pragma mark  1Z204063 排列图法的应用

/*

在质量管理过程中， 通过【抽样检查或检验试验】得到关于【质量问题、质量偏差、质量缺陷、质量不合格】、【质量问题原因分析】的统计数据，可采用排列图法进行状况描述。
 
 在质量管理过程中，通过抽样检查或检验试验所得到的关于质量问题、偏差、缺陷、不合格等方面的统计数据，以及造成质量问题的原因分析统计数据，均可采用排列图方法进行状况描述，它具有直观、主次分明的特点。
 
 特点:直观、主次分明。
 
 将不合格点频数由大到小排序，计算出累计频数和累计频率。
 
 ABC分类管理法:(累计频率)  （记忆）
 0% ~80% ， A类问题，主要问题，重点管理;
 80%~90% ， B类问题，次要问题，次重点管理;
 90%~100%，C类问题，一般问题，常规管理。
 
 
 */
#pragma mark 1Z204064 直方图法的应用

/*
 
 一、主要用途
 
         1.了解【统计数据分布特征】(集中、离散)，【掌握质量能力状态】。
         2.【分析生产过程质量】是否处于正常、稳定和【受控状态】以及【质量水平】是否保持在公差允许范围内。
 
 二、直方图的观察分析
 
     1.形状观察分析
 
             (1)直方图的分布形状及区间宽窄由质量特性统计数据的【平均值和标准偏差】决定。
 
             (2)正常直方图呈正态分布，中间高、两边低、对称。反映质量处于正常、稳定状态。
             (3)异常直方图呈偏态分布，常见的有折齿型、 缓坡型、孤岛型、双峰型、峭壁型。
 
     2.位置观察分析
 
             (1)将直方图分布位置与质量控制标准的上下限范围进行比较分析。
             (2)图(a)，正常稳定受控，经济合理;
             (3)图(b)，偏下限，易出现不合格;
             (4)图(c)，临界状态，易出现不合格;
             (5)图(d)，居中，且边界与上下界限有较大距离，质量能力偏大，不经济;
             (6)图(e)(f)，超出上下界限，质量不合格。
     图1Z204064-3 直方图与质量标准上下限

 
 */
#pragma mark  ******************************** 1Z204070 建设工程项目质量的政府监督 2

/*

 */
#pragma mark  1Z204071 政府对工程项目质量的监督职能

/*

 一、政府质量监督的性质与职权
 
     国务院建设行政主管部门对全国的建设工程质量实施统一监督管理。
     国家交通、水利等部门，负责全国有关专业建设工程质量的监督管理。
     国务院发展计划部门，对国家【出资】的重大建设项目实施监督检查。
     国务院经济贸易主管部门，对国家重大【技术】改造项目实施监督检查。
 
     性质:行政执法行为。
         对工程实体质量（主体结构和主要使用主体）和建设、勘察、设计、施工、监理(简称工程质量责任主体)及质检单位的质量行为实施监督。
 
     职权:
     (1)要求被检查单位提供资料;【不是财务台账】
     (2)进入施工现场检查;
     (3)发现问题，责令改正。
 
 二、政府质量监督机构
 
     质量监督，由【建设行政主管部门、建设工程质量监督机构】具体实施，对工程质量承担监督责任。
 
     监督人员应当具备的条件:
     (1)监督人员占监督机构总人数的75%以上;
     (2)具有工程类专业大专以上学历或工程类执业注册资格;
     (3)具有三年以上工程质量管理或设计、施工、 监理等工作经历。
 
 */
#pragma mark 1Z204072 政府对工程项目质量监督的内容

/*
 
 一、质量监督的内容

     （一）执行法律法规和工程建设强制性标准的情况；
     （二）抽查涉及工程主体结构安全和主要使用功能的工程实体质量；
     （三）抽查工程质量责任主体和质量检测等单位的工程质量行为；
     （四）抽查主要建筑材料、建筑构配件的质量；
     （五）对工程竣工验收进行监督；
     （六）组织或者参与工程质量事故的调查处理；
     （七）定期对本地区工程质量状况进行统计分析；
     （八）依法对违法违规行为实施处罚
 
 二、质量监督程序
 
     1.受理
 
         开工前，建设单位申报。
         监督机构审查合格后，签发质量监督文件
 
     2.制订工作计划并组织实施
 
     3.施工过程中，对实体质量和质量行为进行抽查、抽测
 
         (1)实体质量。检测重点:涉及结构安全和重要使用功能的项目，如基础和主体。
 
         (2)质量行为。
             检查内容:
             1质量保证体系;
             2有关人员资质和资格;
             3建设行政手续;
             4施工组织设计、 监理规划等文件及审批和执行情况;
             5执行法律法规和强制性标准情况;
             6质量检查记录。
 
     4.监督竣工验收
 
         重点监督:组织形式、程序。
             重点对竣工验收的组织形式、程序等是否符合有关规定进行监督
 
     5.形成质量监督报告
 
         基本内容:——1概况4情况1评价1意见
                 项目概况;质量行为情况;实体质量情况;问题整改情况;竣工验收情况;质量评价(包括节能和环 保评价);缺陷处理意见。
 
     6.建立质量监督档案
 
         按单位工程建立，经监督机构负责人签字后归档。

 */
#pragma mark - ****************************************************************** 1Z205000 建设工程职业健康安全与环境管理 14
/*

 */
#pragma mark ******************************** 1Z205010 职业健康安全管理体系与环境管理体系 2

/*
 
 复习重点、难点、高频考点梳理
 1.职业健康安全和环境管理体系的比较
 2.职业健康安全和环境管理体系的结构模式
 3.职业健康安全与环境管理的特点和要求
 4.职业健康安全管理体系与环境管理体系的建立和运行
 
 */
#pragma mark 1Z205011 职业健康安全与环境管理体系标准

/*
 
 环境保护是我国的一项基本国策。环境管理的目的是保护生态环境，使社会的经济发展与人类的生存环境相协调。 对于建设工程项目来说，环境保护主要是指保护和改善施工现场的环境。
 
 一、两种体系标准的比较
 
     1. 相同点
 
         (1)主体相同
 
             都是组织管理体系的一部分，主体都是组织。
 
         (2)目标一致 ------【相同】
 
             改进管理绩效;
             增强满意程度;
             减小风险降低成本;
             提高信誉和形象。
 
         (3)原理相同
 
             预防为主、系统管理、持续改进和PDCA。
            【不是管理为主  不是系统规划】
 
         (4)不规定绩效标准
 
     2. 不同点
 
         (1)满足的对象不同
 
             安全管理体系——员工和相关方
             环境管理体系——公众和社会
 
         (2)侧重点不同
 
             安全体系——危险源辨识，风险评价、控制;
             环境体系——环境因素分析
 
 二、两种管理体系的结构、模式和要素比较
 
     (一)安全管理体系
 
             1. 总体结构
 
                     范围、规范性引用文件、术语和定义、安全要求
 
             2. 运行模式
                     安全要求分为：
                     安全方针、策划、实施运行、检查纠正、管理评审，持续改进。即PDCA，动态循环、螺旋上升的模式。
 
             3. 要素比较（区别核心要素和辅助性要素）
 
                     (1)核心要素(10个):
                             安全方针;
                             【策划】危险源辨识、 风险评价控制;法律法规;目标方案;
                             【实施运行】职责权限;运行控制;
                             【检查纠正】测量监视;合规性评价;内部审核;
                             管理评审。
                     (2)辅助性要素(7个):能力、培训和意识;沟通、参与和协商;文件;文件控制;应急准备和响应; 事件调查、不符合、纠正措施和预防措施;记录控制。
 
                 五大要素:1 3 7 5 1
                         安全方针、策划、实施运行、检查纠正、管理评审
                 核心要素:1 3 2 3 1
 
     (二)环境管理体系
 
             1. 总体结构
                     范围、规范性引用文件、术语和定义、组织所处环境、领导作用、策划、支持、运行、绩效评价、改进。
             2. 运行模式
                     策划、支持和运行、绩效评价、改进。 即PDCA，动态循环、螺旋上升的模式。
 

 三、安全与环境管理的目的
 
     1.安全管理的目的
 
             防止和减少安全事故、保护生产者健康安全、保障人民群众生命财产免受损失;
             控制影响工作场所内的各类人员健康安全的条件和因素;
             避免因管理不当对人员健康和安全造成危害。
 
     2.环境管理的目的
 
             保护生态环境，使社会经济发展与人类生存环境相协调。
             对于建设工程，指保护和改善施工现场环境。
 
 */
#pragma mark  1Z205012 职业健康安全与环境管理的特点和要求

/*

 一、职业健康安全与环境管理的要求
 
     1.决策阶段
 
             建设单位办理安全与环保审批手续，进行环境影响评价和安全预评价。
 
     2.设计阶段
 
             设计单位进行安全环保设施设计，对防范安全事故提出指导意见，对新结构、新材料、新工艺、特殊结构的工程，提出预防安全事故的措施建议。
             在总概算中，明确安全环保设施费、安全施工措施费和环保措施费。
             设计单位、注册建筑师对设计负责。
 
     3.施工阶段
 
             建设单位申领施工许可证时，提供安全施工措施资料
 
             建设单位在开工报告批准之日起15日内，将安全施工措施，报县级以上建设部门和有关部门备案;
             在拆除工程施工15日前，将拆除方案备案。
 
             企业法定代表人是企业安全生产第一负责人，项目经理是项目安全生产第一负责人。
             实行总包的，总包对安全生产负总责并自行完成主体施工。分包接受总包安全管理。分包不服从导致安全事故，由分包承担主要责任，总包就分包工程承担连带责任。
 
     4.试运行阶段
 
             项目竣工后，建设单位向环保部门申请，对环保设施进行竣工验收，环保部门30日内完成验收。
             需要试生产的项目，应在投入试生产之日起3个月内向环保部门申请对配套环保设施进行竣工验收。
 
 */
#pragma mark  1Z205013 职业健康安全管理体系与环境管理体系的建立和运行

/*
 
 安全管理体系与环境管理体系的建立：
 1. 领导决策
 2. 成立工作组
 3. 人员培训
 4. 初始状态评审
 5. 制定方针、目标、指标和管理方案
 6. 管理体系策划与设计
 7. 体系文件编写
 8. 文件的审查、审批和发布

 一、体系文件的编写
 
         体系文件包括管理手册、程序文件、作业文件。
 
         管理手册是纲领性文件。
         程序文件按4W1H编写。
 
         作业文件包括作业指导书(操作规程)、管理规定、监测活动准则及程序文件引用的表格。
 
 二、两种管理体系的运行和维持
 
     1.运行
 
             体系运行实施的重点:培训意识和能力，信息交流，文件管理，执行控制程序，监测，不符合、 纠正和预防措施，记录。
 
     2.维持【重点】
             (1)内部审核
 
                     内部审核是组织对其自身的管理体系进行的审核，是管理体系自我保证和自我监督的一种机制。
 
             (2)管理评审
 
                     由最高管理者组织。
 
             (3)合规性评价
 
                     分为公司级和项目组级两个层次。
                     项目组级，由项目经理组织，超过半年，不少于一次。
                     公司级，由管理者代表组织，每年一次。
 
             内部审核是组织对其自身的管理体系进行的审核，是对体系是否正常运行以及是否达到了规定的目标所作的独立的 检查和评价，是管理体系自我保证和自我监督的一种机制。
             管理评审是由组织的最高管理者对管理体系的系统评价，判断组织的管理体系面对内部情况和外部环境的变化是否充分适应 有效，由此决定是否对管理体系做出调整，包括方针、目标、机构和程序等。
 
 */
#pragma mark ******************************** 1Z205020 建设工程安全生产管理 4

/*
 
 
 复习重点、难点、高频考点梳理
 
 1.安全生产管理制度
 2.安全生产管理预警体系的建立和运行
 3.施工安全技术措施要求
 4.安全隐患的处理
 
 */
#pragma mark 1Z205021 安全生产管理制度 2

/*
 
 1. 安全生产责任制度
 
         是最基本的安全制度，是所有安全制度的核心。
 
         主要内容:
                 各类人员的安全责任;
                 检查考核办法;
                 具体指标要求(总分包的安全责任);
                 安全操作规程;
                 安全人员:1万m2以下1人，1~5万m2不少于2人，5万m2 以上不少于3人。
 
 2. 安全生产许可证制度
 
         有效期3年。期满前3个月办理延期手续。
 
 4. 安全生产教育培训制度
 
         包括管理人员、特种作业人员和企业员工的安全教育。
 
         (1)特种作业人员 应具备的条件:
             1年满 18 周岁，且不超过国家法定退休年龄
             2经社区或者县级以上医疗机构体检健康合格
             3具有初中及以上文化程度
             4具备必要的安全技术知识与技能
             5相应特种作业规定的其他条件
 
             取得《特种作业证》后，可上岗。
             跨省区市作业人员，可在户籍所在地或从业所在地参加培训。
 
 6. 特种作业人员持证上岗制度
 
         特种作业证有效期6年，全国有效，每3年复审1次， 连续从事10年以上，每6年复审1次。
         离岗6个月以上，重新实际操作考试，合格后上岗。
        一般员工离岗一年以上 必须进行安全技术培训和教育
 
         (2)企业员工的安全教育
 
                 1)新员工三级安全教育——企业、项目、班组。
 
                 2)改变工艺和变换岗位安全教育——
 
                     离岗一年以上重新上岗，必须进行安全技术培训和教育。
 
                 3)经常性安全教育——
 
                     安全思想、安全态度教育最重要。
                     形式——班前班后会、安全活动日、安全生产会、事故现场会、张贴安全生产招贴画、宣传标语及标志。
 
 5. 安全措施计划制度
 
         具体包括:
         1)安全技术措施:......装置
         2)职业卫生措施:防......、通风、照明、取暖、降温
         3)辅助用房及设施:......室、厕所
         4)安全宣传教育措施:图书、展览、制度、研究、实验、安全操作方法训练设施。
 
         安全技术措施计划编制步骤:工作活动分类→危险源识别→风险确定→风险评价→制定安全技术措施计划→评价安全技术措施计划的充分性。
 
 7. 专项施工方案专家论证制度
 
         专项施工方案，经施工单位技术负责人、总监签字后实施。
 
         包括:基坑支护与降水工程;土方开挖工程;模板工程;起重吊装工程;脚手架工程;拆除、爆破工程。
         上述工程中，涉及深基坑、地下暗挖、高大模板工程的专项施工方案，还应组织专家论证。
 
 9. 施工起重机械使用登记制度
 
         施工单位应当自施工起重机械和整体提升脚手架、模板等自升式架设设施验收合格之日起三十日内，向建设部门或其他有关部门登记。
 
         登记提交的资料:
         生产方面:如设计文件、制造质量证明书、检验证书、【使用说明书、安装证明】等。(文件、证、书)
         使用方面:如机械和设施的管理制度和措施、使用情况、作业人员情况等。(制度、措施、情况)
 
 10. 安全检查制度
 
         (1)安全检查目的
 
             清除隐患、防止事故、改善劳动条件。
 
         (2)安全检查内容
 
             查思想、查制度、查管理、查隐患【不是危险源】、查整改、查伤亡事故处理
 
         (3)安全检查重点
 
             检查“三违”和安全责任制的落实。
 
         (4)安全隐患处理程序
 
             处理程序:登记-整改-复查-销案
 
         安全生产检查监督的主要类型：
         （一）全面安全检查——汇总分析，详细探讨所出现的问题及相应对策。
         （二）经常性安全检查——工程项目和班组应开展经常性安全检查，及时排除事故隐患。
         （三）专业或专职安全管理人员的专业安全检查
         （四）季节性安全检查
         （五）节假日检查
         （六）要害部门重点安全检查
 
         对于企业要害部门和重要设备必须进行重点检查。由于其重要性和特殊性，一旦发生意外，会造成大的伤害，给企业的经济效益和社会效益带来不良的影响。为了确保安全，对设备的运转和零件的状况要定时进行检查，发现损伤立刻更换，决不能“带病”作业；一过有效年限即使没有故障，也应该予以更新，不能因小失大。
 
 
 12.“三同时”制度
 
         安全生产设施、劳动卫生设施、防治污染设施，必须与主体工程同时设计、同时施工、同时投产和使用。
 
         安全设施投资应纳入项目概算。  按照“三同时”制度要求，安全设施投资应当纳入建设项目概算
 
 13. 安全预评价制度
 
         项目前期，对危险性、危害性进行预测性评价。
 
         开展安全预评价，是贯彻“安全第一，预防为主”的 重要手段，是企业安全管理工作基础。
 
 14. 意外伤害保险制度
 
         工伤保险属于强制性保险，意外伤害险并非强制性保险，是否投保由施工企业自主决定。
 
 */
#pragma mark 1Z205022 安全生产管理预警体系的建立和运行 1

/*
 
 一、预警体系的四大要素
 
         四要素:外部环境、内部管理不良、信息管理和事故预警系统。
 
         外部环境:自然环境、政策法规、技术变化。
         内部管理不良:质量、设备、人的行为活动管理。
 
 二、预警体系的两大功能 ------预警分析、预控对策
 
         1.预警分析
 
             包括:监测、信息管理、指标体系构建和评价。
 
             (3)指标体系构建
             3)预警方法:指标预警、因素预警、综合预警，误警和漏警。
 
             (4)【预警评价】
 
                 包括确定预警级别和预警信号标准
 
                 级别（越小越严重） 状态          信号标准
                 I级预警         特别严重          红
                 II级预警         严重            橙
                 III级预警        上升            黄
                 IV级预警         正常            蓝
 
             【预警评价】包括确定评价的对象、内容和方法,建立相应的预测系统,【确定预警级别和预警信号标准】等工作
 
         2.预控对策——组织准备、日常监控和事故危机管理。
 
         3.两者关系
 
             (1)内容不同
                     预警分析:隐患辨识，前提和基础。
                     预控对策:纠错、治错，目标。
             (2)对象不同
                     预警分析:正常的安全管理过程。
                     预控对策:已被确认的事故现象。
 
 预警分析和预控对策的活动内容是不同的，前者主要是对系统隐患的辨 识，后者是对事故征兆的不良趋势进行纠错、治错的管理活动，但两者相辅相成，是明确的时间顺序关系和逻辑顺序关系。
 预警分析是预警体系完成其职能的前提和基础，预控对策是预警体系职能活动的目标，两者缺少任何一个方面，预体系无法 完整实现其功能，也难于很好地实施事故预警的目的。
 
 三、预警体系的运行(排序)
         
         预警分析:完成监测、识别、诊断与评价的功能;
         预控对策:完成纠错治错的功能。
 
 预警体系功能的实现主要依赖于预警分析、预控对策 两大子系统作用的发挥。
 
 

 */
#pragma mark 1Z205023 施工安全技术措施和安全技术交底

/*
 
 一、安全技术措施
 
     1.安全控制目标（控制人机料环）
 
             (1)减少消除人、设备、材料的不安全状态;
             (2)改善生产环境、保护自然环境。
 
     2.安全控制程序
 
             (1)确定安全目标
             (2)编制安全技术措施计划 --P
             (3)落实和实施 --D
             (4)验证 --C
             (5)持续改进 --A
 
     3.安全技术措施的要求
 
             (1)安全技术措施必须开工前制定——与施工组织设计一同编制
             (2)全面性——大中型、结构复杂重点工程要编制施工安全技术措施和专项工程施工安全技术措施
             (3)针对性——针对每项工程的特点制定
             (4)力求全面具体可靠——考虑周全
             (5)安全技术措施必须包括【应急预案】
             (6)可行性和可操作性
             (7)安全技术措施必须包含【施工总平面图】
 
 二、安全技术交底【实务】
 
     1.主要内容
 
             (1)本项目的作业特点和危险点;
             (2)针对危险点的具体预防措施;
             (3)应注意的安全事项;
             (4)相应的安全操作规程和标准;
             (5)发生事故后应采取的避难和急救措施。
     2.要求
 
             (1)逐级，纵向延伸到班组全体作业人员;
 
             (5)对于涉及“四新”项目或技术含量高、技术难度大的单项技术设计，必须经过【两阶段技术交底】，即初步设计技术交底和施工图设计技术交底;
 
             (7)书面交底;
             (8)签字(归档)。
 
             安全技术交底是安全管理人员自我保护的手段。
 
 */
#pragma mark 1Z205024 安全生产检查监督的类型和内容

/*
 
 1.安全检查的目的
 
         清除隐患、防止事故、改善劳动条件、提高安全生产意识。
 
         安全检查由项目经理组织。
 
 安全检查的主要类型
     1. 全面安全检查
     2. 经常性安全检查
     3. 专业或专职安全人员的专业安全检查
     4. 季节性安全检查
     5. 节假日安全检查
     6. 要害部门重点安全检查
 
 2.安全生产检查监督的主要内容
 
         (1)查思想——认识程度，重视程度，处理态度
         (2)查制度——......制度、安全操作规程
         (3)查管理——是否有效，是否落实
         (4)查隐患
         (5)查整改
         (6)查事故处理
 */
#pragma mark 1Z205025 安全隐患的处理

/*
 
 一、安全隐患的内容
 
         包括:人的不安全因素、物的不安全状态和管理的不安全因素三方面。【注意区分属于哪个不安全因素】
 
         要求会区分，找语句的重心!
         特例:(二)物的不安全状态 1(3)物的放置方法的缺陷
 
 二、安全隐患治理原则
 
         1. 冗余安全度治理原则
                 【多道防线】。如，道路上一个坑，设防护栏、警示 牌、照明、红灯。(井盖)
 
         2. 单项隐患综合治理原则
                 【人机料法环】，多角度。如，触电事故，对人进行安全教育、设漏电开关、线路改造、严禁乱接乱拉。
 
         3~6:直接隐患间接隐患并治、预防减灾并重、重点治理、动态治理原则
 
 */
#pragma mark ******************************** 1Z205030 建设工程生产安全事故应急预案和事故处理 4

/*
 
 复习重点、难点、高频考点梳理
 1.应急预案体系的构成
 2.应急预案的评审
 3.安全事故的分类及处理措施
 
 */
#pragma mark 1Z205031 生产安全事故应急预案的内容

/*
 一、应急预案体系的构成:综合应急预案、专项应急预案、现场处置方案
 
         规模小、危险少， 综合、专项应急预案可合并编写。
 
         综合应急预案:
                 从总体上阐述方针、政策......的综合性文件。
         专项应急预案:
                 针对具体事故类别(如基坑开挖、脚手架拆除)的计划或方案。
                 专项应急预案应制定明确的救 援程序和具体的应急救援措施
         现场处置方案:针对具体装置、场所、设施、岗位的【应急处置】措施。【应急演练】。
                 应根据风险评估及危险性控制措施逐一编制，做到事故相关人员应知应会，熟练掌握，并通过【应急演练】，做到迅速反应、正确处置
 
 
 二、应急预案编制的要求
         1. 符合【法律】、法规、规章和标准的规定;
         2. 结合本地区、本部门、本单位安全生产的【实际情况】;
         3. 结合本地区、本部门、本单位【危险性分析情况】;
         4. 应急组织和人员的【职责分工明确】，有具体的落实措施;
         5. 有明确、具体的事故【预防措施】和应急程序，并与其应急能力相适应;
         6. 有明确的【应急保障措施】，并能满足本地区、本部门、本单位的应急工作要求;
         7. 预案基本要求齐全、【完整】，预案附件提供的信息准确;
         8. 预案内容与相关应急预案相互衔接。
 
 */
#pragma mark 1Z205032 生产安全事故应急预案的管理

/*
 
 
 建设工程生产安全事故应急预案的管理包括应急预案的评审、备案、实施和奖惩。
 
 1.评审
 
         地方各级安监部门组织，必要时可以召开听证会。
         参加人员:政府人员和安全管理专家。
 
         评审人员与预案单位有利害关系的，应当回避。
 
         地方各级安全生产监督管理部门组织有关专家对本部门编制的应急预案进行审定，必要时可以召开听证会。
         参加应急预案评审的人员包括应急预案涉及的政府部门工作人员和有关安全生产及应急管理方面的专家。
         评审人员与所评审预案的生产经营单位有利害关系的，应当回避。
 
 2.备案
         地方各级安监部门的应急预案，报同级人民政府和上级安监部门备案;
         其他负有安监职责的部门(如建设部门)的应急预案，抄送同级安监部门备案。
 
         央企备案到国务院，下属公司备案到省、市级
         有许可证备案到县级，无许可证备案到省级
 
         中央管理的总公司的综合应急预案、专项应急预案，报国务院国资部门、安监部门、有关主管部门备案
 3.实施
 
         应急预案演练，综合、专项应急预案，每年至少一次;
         现场处置方案，每半年至少一次。
 
 4.奖惩
         未备案，警告、三万元以下罚款。
         未制定或未采取措施，停产停业整顿，行政处罚。
 
         生产经营单位应急预案未按照有关规定备案的，由县级以上安全生产监督管理部门给予警告，并处罚款。
 
 
     有下列情形之一的，应急预案应当及时修订:
     (1)生产经营单位因兼并、重组、转制等导致隶属关系、经营方式、法定代表人发生变化的;
     (2)生产经营单位生产工艺和技术发生变化的;
     (3)周围环境变化，并形成新的重大危险源的;
     (4)应急组织指挥体系或职责已经调整的;
     (5)依据的法律、法规、规章和标准发生变化的;
     (6)应急预案演练评估报告要求修订的;
     (7)应急预案管理部门要求修订的。
 
 
 */
#pragma mark 1Z205033 职业健康安全事故的分类和处理

/*
 
 一、职业健康安全事故的分类【注意依据文件的不同，伤亡人数的不同规定】
 
     1.按发生原因分
 
             我国《企业职工伤亡事故分类标准》规定:
             建设工程领域最常见的职业伤害事故是高处坠落、物体打击、机械伤害、触电、坍塌、中毒、火灾7类。
 
             物体打击:不包括因爆炸引起的物体打击
             机械伤害:不包括车辆、起重设备引起的伤害
 
     2.按严重程度分
 
             我国《企业职工伤亡事故分类标准》规定:
 
             (1)轻伤，1至105个工作日;
             (2)重伤，105工作日以上(含)的失能伤害;
             (3)死亡， 重大伤亡，死亡1~2人;
                      特大伤亡，死亡3人以上(含3人)。
 
     3.按人员伤亡或直接经济损失分(313\151\151，往严重的靠)
 
         依据《生产安全事故报告和调查处理条例》，分为:
         事故等级       死亡（人）      重伤 (人)         直接经济损失 (万元)
         特大          R≥30          R≥100              M≥10000
         重大         10≤R< 30       50≤R< 100        5000≤M<10000
         较大         3≤R<10          10≤R<50         1000≤M<5000
         一般          R<3            R<10              M<1000

 
 二、建设工程安全事故的处理
 
     (一)事故处理原则(“四不放过”原则)
 
             1.事故原因未查清不放过
             2.事故【责任人】未受到处理不放过   【不是企业】
             3.事故【责任人】和周围群众没有受到教育不放过  【不是有关人员】
             4.事故没有【制定】切实可行的整改措施不放过  【不是落实 】
            【没有提到企业】
 
     (二)安全事故处理措施
 
             1.按规定向有关部门报告事故情况
 
                 事故发生后，现场人员立即向施工单位负责人报告;施工单位负责人1小时内向事故发生地县级以上安监部门 和负有安监职责的部门报告。
                 专业工程，还需要向有关行业主管部门报告。【向三个部门报告：县级以上安监部门、建设部门，有关行业主管部门】
 
                 现场人员立即向施工单位负责人报告;施工单位负责人1小时内报告。情况紧急，现场人员可以直接向县级安监部门和负有安监职责的部门报告。
 
 
                 部门每级上报时间不超过2小时。必要时，可以越级。
                 安监部门和负有安监职责的部门除按规定逐级上报外，还应同时报告本级人民政府。
 
 
                 安监部门和负有安监职责的部门应当依照下列规定 上报事故情况:
                 1)特大、重大，逐级上报至国务院安监部门和负有安监职责的部门;
                 2)较大，逐级上报至省......;
                 3)一般，逐级上报至设区的市......。
 
             2.组织调查组，开展事故调查
 
                 特大事故由国务院或国务院授权有关部门调查。
                 重大、较大、一般事故分别由省、市、县人民政府负责调查。
                 省、市、县人民政府可直接，也可授权或委托。【即使不是一般、未伤亡的事故也可以委托】
 
                 未造成伤亡的一般事故，县人民政府也可委托【事故发生单位】组织调查。
 
                            一般  较大  重大  特大
                 上报(部门)   市   省    国    国
                 调查(政府)   县   市    省    国
 
             3. 现场勘查
 
             4. 分析事故原因
 
                 通过分析，确定事故的直接责任者、间接责任者和主要责任者。
 
             5. 制定预防措施
 
             6. 提交事故调查报告
 
                 事故调查组自事故发生之日起60日内提交事故调查报告;特殊情况，可适当延长，但延长期限最长不超过60日。
 
                 事故调查报告的内容:
                 (1)事故发生单位概况;
                 (2)事故发生经过和事故救援情况;
                 (3)事故造成的人员伤亡和直接经济损失;
                 (4)事故发生的原因和事故性质;
                 (5)事故责任的认定以及对事故责任者的处理建议;
                 (6)事故防范和整改措施。
 
             7. 事故的审理和结案
 
                 重大、较大、一般事故，负责事故调查的人民政府自收到调查报告之日起15日内批复;
                 特大事故，30日内批复; 特殊情况，可以适当延长，但延长时间最长不超过30日。
 
 
 
             3.提交和批复事故调查报告 （调查时间长 批复时间短）
 
                 提交:事故调查组60日内提交事故调查报告; 特殊情况，可延长，但延长期限最长不超过60日。
                 事故调查报告内容:(比P205少一条)
                 批复:重大、较大、一般事故，15日内批复; 特大事故，30日内批复;特殊情况，可延长，但延长时间最长不超过30日。
 
 
 事故调查报告的内容:单位概况，事故经过，救援情况，人员伤亡直接经济损失，技术分析报告，原因性质，责任认定，责任者处理建议， 防范整改措施。
 事故处理报告的内容:原始资料数据，原因分析论证，处理依据，处理方案措施，处理过程资料，检查验收记录，责任者处罚和事故处理结论，等。


 */
#pragma mark ******************************** 1Z205040 建设工程施工现场职业健康安全 与环境管理的要求 4 实务紧密相关

/*
 
 */
#pragma mark 1Z205041 施工现场文明施工的要求

/*
 
 文明施工是指保持良好的作业环境、卫生环境和工作秩序。
 
 一、现场文明施工的措施
 
     (一)加强文明施工管理
 
             项目经理为现场文明施工第一责任人。
             安全三检:自检、互检、交接检。
             【质量三检：自检、互检、专检】

     (二)落实各项管理措施
 
             1.施工平面布置
 
                     施工总平面图是现场文明施工的依据。
 
             2.现场围挡、标牌
 
                     (1)围挡高度:四周连续，市区、市容景观路段不低于2.5m，其他不低于1.8m。
 
                         施工现场必须实行封闭管理，设置进出口大门，制定门卫制度，严格执行外来人员进场登记制度。
                         沿工地四周连续设置围挡，市区主要路段、市容景观 路段围挡高度不低于2.5m，其他工地不低于1.8m
 
                     (2)“五牌一图”:
                         工程概况牌、管理人员名单及监督电话牌、消防保卫(防火责任)牌、安全生产牌、文明施工牌和施工现场总平面图。
 
             3.施工场地
 
                     (1)施工现场应积极推行硬地坪施工，作业区、生活区主干道必须硬化，其他道路应硬化。
                     (4)严禁泥浆、污水、废水外流或未经允许排入河道，严禁堵塞下水道和排水河道。【记忆】
 
             4. 材料堆放、周转设备管理
                 (1)建筑材料、构配件、料具必须按施工现场总平面图堆放，布置合理。
                 (2)建筑材料、构配件、料具不得超高，堆料分门别类悬挂标牌。
 
             5.现场生活设施
 
                     (1)施工现场作业区与办公生活区必须明显划分。
 
             6.现场消防、防火管理
 
                     (1)现场建立消防管理制度，建立消防领导小组， 落实消防责任制和责任人员。
                     (2)易燃易爆物品堆放间、油漆间、木工间、总配电室等消防防火重点部位，要设置灭火器和消防沙箱。【记忆】
 
 */
#pragma mark 1Z205042 施工现场环境保护的要求

/*
  一、施工现场环保的要求
 
         2. 开发利用自然资源的项目，必须采取措施保护生态环境。
         4. 应满足项目所在区域环境质量、相应环境功能区划和生态功能区划标准或要求
         9.对环境造成重大影响、应编制环境影响报告书的， 严重影响居民生活环境质量的，存在重大意见分歧的工程项目，可以举行听证会。【不是必须举行听证会】
         10.防治污染的设施，必须与主体工程同时设计、 同时施工、同时投产使用。
             必须经原环保部门验收合格， 方可投产使用。
 
             防治污染的设施必须经原审批环境影响报告书的环境保 护行政主管部门验收合格后，该建设工程项目方可投入生产或使用
 
         12. 排放污染物的单位，必须依照国务院环保部门申报登记。
 
 二、施工现场环保的措施【必考】
 
     工程建设过程中的污染主要包括对施工场界内的污染和对周围环境的污染。
     对施工场界内的污染防治属于职业健康安全问题，
     而对周围环境的污染防治是环境保护的问题。
 

     (一)大气污染防治措施
 
             2.高大建筑物要使用【封闭式容器或永久性垃圾道】处理高空废弃物。
             6.除设有符合规定的装置外，禁止在施工现场焚烧 油毡、橡胶、塑料等废弃物品、其他产生有毒、有害烟尘和恶臭气体的物质。【有符合规定的装置可以在城市等焚烧】 【密闭 带有烟尘处理的装置】
             8.工地茶炉应尽量采用电热水器。【不是烧煤】
             9.大城市市区的建设工程不容许搅拌混凝土。
 
     (二)水污染防治措施
 
             1.禁止将有毒有害废弃物作土方回填。
             2.施工现场的搅拌站废水，水磨石污水，必须经沉淀池沉淀合格后再排放。
             3.现场存放油料，必须对库房地面进行防渗处理。
             4.施工现场100人以上的临时食堂，要设隔油池。
             5.工地临时厕所、化粪池应采取防渗漏措施。
 
     (三)噪声污染的控制措施：声源控制、传播途径控制、接收者防护、严控人为噪声
 
             【建筑施工场界噪声排放限值[dB] 昼间 70  夜间 55】
 
             1. 声源控制(2个)
 
                     (1)防止噪声污染最根本的措施。
 
                     (2)采用低噪声设备。
                     (3)安装消声器。-------- 【关键字：安装】
 
             2.传播途径控制(4个)
 
                     (1)吸声:利用吸声材料。
                     (2)隔声:应用隔声结构。
                     (3)消声:利用消声器阻止传播。----------【关键字：利用】
                     (4)减振降噪:降低机械振动减小噪声。=====
 
             3.接收者防护(2个)
 
                     使用耳塞、耳罩等防护用品。
 
             4.严控人为噪声
 
                     (1)施工现场不得高声喊叫、无故甩打模板、乱吹哨，限制高音喇叭的使用
                     (2)人口稠密区，一般晚10点到次日早6点停止强噪声作业。特殊情况，施工单位会同建设单位找当地居委会协调，安民告示，求得谅解。
 
     (四)固体废物的处理
 
             基本思想:资源化、减量化、无害化，全过程控制。
 
             处理方法:
                     1. 回收利用
                     2. 减量化处理——分选、破碎、压实、脱水
                     3. 焚烧——不适合再利用且不宜直接填埋
                     4. 稳定和固化——利用水泥、沥青等胶结材料包裹
                     5. 填埋——无害化、减量化处理后填埋
 
 */
#pragma mark 1Z205043 施工现场职业健康安全卫生的要求

/*
 
 工程建设过程中的污染主要包括对施工场界内的污染和对周围环境的污染。
 对施工场界内的污染防治属于职业健康安全问题，而对周围环境的污染防治是环境保护的问题。
 
 施工现场生活区设置封闭式垃圾容器，施工场地生活垃圾实行袋装化，及时清运。对建筑垃圾进行分类，并收集到现场封闭式垃圾站，集中运出
 
 1.现场宿舍
 
     (1)宿舍室内净高不小于2.4m，通道宽度不小于 0.9m，每间宿舍不超过16人。
     (2)宿舍必须设置可开启式窗户，宿舍床铺不超过2层，严禁通铺。
 
 2.现场食堂
 
     (1)食堂必须有卫生许可证，炊事人员必须持身体健康证上岗。
     (6)食堂门扇下方应设不低于0.2m的防鼠挡板。 灶台瓷砖高度不小于1.5m。粮食存放台距墙和地面 大于0.2m。（≥  ≥  ＞）
 
 3.现场厕所
 
     (1)施工现场应设置水冲式或移动式厕所，厕所地面应硬化。蹲位宜设隔板，隔板高度不低于0.9m。
     (2)高层建筑超过8层后，每隔四层设临时厕所。
         厕所应设专人负责清扫、清毒。
 
 4.其他临时设施
 
     (3)【生活区】设开水炉、电热水器或保温桶。
         施工区配备流动保温水桶。
     (5)传染病、中毒，必须2小时内报告。【安全、质量事故立即报告】
 
 */
#pragma mark - ****************************************************************** 1Z206000 建设工程合同与合同管理  26
/*
 */
#pragma mark  ******************************** 1Z206010 建设工程施工招标与投标 3

/*
 
 */
#pragma mark 1Z206011 施工招标的内容

/*
 
 O、招标应具备的条件:
          招标人已经依法成立;
          初步设计及概算已经批准; 【不是施工图设计】
          招标范围、方式和组织形式已经核准;
          有资金或资金来源已经落实; 【不是到位】
          有招标所需的设计图纸及技术资料。 【不是施工图纸】
 
 一、招投标项目的确定
 
         宜采用招标方式的项目:
         (1)大型、公用等关系社会公共利益、公众安全的;
         (2)全部或部分使用国有资金的;
         (3)使用国际组织或外国政府资金的。
 
 二、招标方式的确定
 
         1. 公开招标
 
             亦称无限竞争性招标，针对一切符合条件的法人或组织。
             对于按规定应该招标的项目，一般应采用公开招标方式。
 
             优点——有较大的选择范围。
             缺点——资格审查和评标的工作量大、耗时长、 费用高，可能因资格预审把关不严导致鱼目混珠。
             公开招标，招标人不得以不合理的条件限制或排斥潜在的投标人。
 
         2.邀请招标
 
             亦称有限竞争性招标，事先经过考察和筛选，只针对某些特定的法人和组织。
 
             应公开招标的如果采用邀请招标，需经过批准。
 
             下列情形之一，可以邀请招标:
             (1)技术复杂、特殊要求，或受自然环境限制，(且)只有少量潜在投标人可供选择;
             (2)拟公开招标的费用占合同金额比例过大;
 
             应当向三个以上法人或组织发投标邀请书。
 
 三、自行招标与委托招标
 
         可自行办理，也可委托招标代理机构办理。
 
         自行办理，应具有编制招标文件和组织评标的能力。
 
         不具备自行招标能力，必须委托。
 
         招标代理机构分为甲、乙两级。
         乙级只能承担工程投资额(不含征地费、大市政配套费与拆迁补偿费)1亿元以下的代理业务。 【不带括号  只说1亿 是错误的】
 
         甲、乙招标代理机构可以跨省、区、市承担代理业务。
 
 四、招标信息的发布与修正
 
     1.发布
 
             资格预审公告和招标公告应在指定媒介发布，不得收取费用。
 
             招标人或招标代理机构应至少在一家指定媒介发布招标公告。
 
             自招标文件或者资格预审文件出售之日起至停止出售之日止，最短不得少于5日。
 
             发售资格预审文件，不得以营利为目的;
             设计文件可酌收押金，退还设计文件，退还押金;【押金 不是费用】
 
             招标文件售出，不予退还;
             招标人不得擅自终止招标。
 
     2.修正
 
             时限——投标截止日至少15日前;
             形式——书面;
             全面——必须直接通知所有招标文件收受人;
             性质——招标文件的有效组成部分。
 
 五、资格预审
 
         通过预审的申请人少于3个的，重新资格预审。
 
         根据《招标投标法实施条例》第三十二条，招标人不得以不合理的条件限制或排斥潜在的投标人。
         招标人有下列行为之一的，属于以不合理条件限制、排斥潜在投标人或投标人:
         (1)就同一招标项目向潜在投标人或投标人提供有差别的项目信息;
         (2)设定的资格、技术、商务条件与招标项目的具体特点和实际需要不相适应或与合同履行无关;
         (3)依法必须进行招标的项目以特定行政区域或特定行业的业绩、奖项作为加分条件或中标条件;
         (4)对潜在投标人或投标人采取不同的资格审查或评标标准;
         (5)限定或指定特定的专利、商标、品牌、原产地或供应商;
         (6)依法必须进行招标的项目非法限定潜在投标人或投标人的所有制形式或组织形式;
         (7)以其他不合理条件限制、排斥潜在投标人或投标人。
 
 六、标前会议
 
         会议纪要，应以书面形式发给每一个投标人，对问题的解答不需要说明问题来源。
         会议纪要、答复函件形成补充文件，与招标文件具有同等法律效力。补充文件与招标文件内容不一致，以补充文件为准。
 
 七、评标
 
         初步评审——【符合性审查】，重点审查投标书是否实质上响应了招标文件要求，不响应为废标。
 
                 细微偏差不能作为废标，处理方法:大小写不一致，大写为准;单价与总价不一致，单价为准;正本副本不一致，正本为准。
 
         详细评审——【核心，实质性审查】，包括技术评审和商务评审。
                 评标结束后，评标委员会推荐中标候选人1-3人， 并标明排列顺序。
 
 */
#pragma mark 1Z206012 施工投标的内容

/*
 
 投标程序(步骤):
     1.研究招标文件
     2.进行各项调研
     3.复核工程量
     4.选择施工方案
     5.投标计算
     6.确定投标策略
     7.正式投标
 
 1. 研究招标文件
 
     研究重点:投标者须知、合同条款、设计图纸、工程范围、工程量表。
 
     重点注意:投标人须知(招标工程的内容和范围、投标文件的组成、重要时间安排)。【记忆】
 
 3. 复核工程量
 
     对单价合同，实测与图纸相差较大，要求澄清。
     对总价合同，如果业主对争议工程量不予更正，投标时要附上声明：工程量有错误，结算时应按实际完成量计算。
 
 4. 选择施工方案
 
     由投标人的技术负责人主持制定。
 
 7. 正式投标
 
     注意投标截止日期——超过该日期，无效投标
 
     注意投标文件完备性——应当实质响应
     投标文件不完备或投标没有达到招标人的要求，在招标范围以外提出新的要求，均视为对招标文件的否定，不会被招标人所接受。
 
     注意标书标准——签章、密封。企业公章、企业法定代表人名章(或项目经理授权委托书原件)。
     不密封或密封不满足要求，投标无效。投标书应盖有投标企业公章以及企业法定代表人名章(或签字)。
     如果由项目经理部组织投标，需要提交企业法人对项目经理的授权委托书原件。
 
     注意投标的担保：
     通常投标需要提交投标担保。
 
 */
#pragma mark 1Z206013 合同的谈判与签约

/*
 
 一、合同订立的程序
 
     要约邀请——发布招标公告
     要约——提交投标文件
     承诺——发出中标通知书
 
 二、合同谈判的主要内容
 
     1. 谈判双方达成一致的内容，以“合同补遗”、“会议纪要”的方式，构成合同的一部分。
 
     2. 工期较长，容易货币贬值、通货膨胀，价格调整条款可以比较公正的解决承包人的风险损失。
 
         【合同计价方式以及价格调整方式】共同确定了合同的实际价格。
 
     3. 合同付款分四个阶段:预付款、进度款、最终付款、 退还保留金。
 
     4. 承包人应力争以维修保函代替保留金。
 
         维修保函对承包人有利，可提前取回现金，且保函有时效，期满自动作废。
         对业主无风险，真正发生维修费用，可凭保函向银行索回款项。
 
         对于具有较多单项工程的建设工程项目，可在合同中明确允许分部位或分批提交业主验收，并从该批验收时起开始计算该部分的维修期
         由于工程变更原因对工期产生不利影响时，应该给予承包人要求合理延长工期的权利
         承包人应该只承担由于材料和施工方法及操作工艺等不符合合同规定而产生的缺陷的维修责任
         业主和承包人可以【不是应当】根据项目情况、施工环境因素等商定适当的开工时间
 
 中标人与招标人可根据招标文件中要求的工期，或者根据投标人在投标文件中承诺的工期，并考虑工程范围和工程量的变动而产生的影响来商定一个确定的工期。
 同时，还要明确开工日期、竣工日期等。
 
 
 
 双方【可】根据【各自的项目准备情况、季节和施工环境因素】等条件洽商适当的开工时间。 【是可以洽商  不是应当洽商】
 
 对于具有较多的单项工程的建设工程项目，可在合同中明确允许【分部位或分批】提交业主验收（例如成批的房屋建筑工程应允许分栋验收；分多段的公路维修工程应允许分段验收；分多片的大型灌溉工程应允许分片验收等），并从该批验收时起开始计算该部分的维修期，以缩短承包人的责任期限，最大限度保障自己的利益。
 
 双方应通过谈判明确，由于工程变更（业主在工程实施中增减工程或改变设计等）、恶劣的气候影响，以及种种“作为一个有经验的承包人无法预料的工程施工条件的变化”等原因对工期产生不利影响时的解决办法，通常在上述情况下应该给予承包人要求【合理延长工期】的权利。
 
 合同文本中应当对维修工程的范围、维修责任及维修期的开始和结束时间有明确的规定，承包人应该【只承担由于材料和施工方法及操作工艺】等不符合合同规定而产生的缺陷。
 
 承包人应力争以【维修保函】来代替业主扣留的保留金。
 
 与保留金相比，维修保函对承包人有利，主要是因为可提前取回被扣留的现金，而且保函是有时效的，期满将自动作废。同时，它对业主并无风险，真正发生维修费用，业主可凭保函向银行索回款项。因此，这一做法是比较公平的。
 维修期满后，承包人应及时从业主处撤回保函。
 
 三、合同补遗与签订
 
     谈判结果一般以《合同补遗》，或《合同谈判纪要》的形式，形成书面文件。
 
     合同必须遵守法律，对于违反法律的条款，即使双方达成协议并签了字，也不受法律保障。
 
     谈判结束后，形成完整的合同文本草案，经双方代表认可后形成正式文件。【不是谈判结束 即形成正式文件】
 
 */
#pragma mark  ******************************** 1Z206020 建设工程合同的内容 6

/*
 
 复习重点、难点、高频考点梳理
 
 1.施工承包合同的内容
 2.物资采购合同的内容
 3.施工专业分包合同的内容
 4.施工劳务分包合同的内容
 
 
 
     勘察合同、设计合同、施工承包合同属于建设工程合同;
     工程监理合同、咨询合同等属于委托合同。
 */
#pragma mark 1Z206021 施工承包合同的内容

/*
 
 一、文件组成及解释顺序
 
     1.施工合同示范文本组成:
 
         (1)协议书;
         (2)通用条款;
         (3)专用条款。
 
     2.施工合同【通用条款】规定的优先顺序
 
         签署日期在后的、内容重要的排前面。
 
         顺序【记忆】：【排在前面的比后面的拥有最优先解释权】
         (1)合同协议书;
         (2)中标通知书(如果有);
         (3)投标函及其附录(如果有);
         (4)专用合同条款及其附件;
         (5)通用合同条款;
         (6)技术标准和要求;
         (7)图纸;
         (8)已标价工程量清单或预算书;
 
 二、发包方的责任与义务
     ——场地、图纸、办证、协调、交通、交底、验收、付款
 
     (1)图纸的提供和交底
 
         至迟开工前14天向承包提供图纸。
 
     (2)对化石、文物的保护
 
         增加的费用和(或)延误的工期由发包承担。
 
     (6)许可或批准
 
         办理用地规划，工程规划，施工，水、电、路、占等许可。【夜间施工、文明施工  是施工方办理】
 
     (7)提供施工现场
 
         最迟开工7天前向承包移交施工现场。
 
     (9)提供基础资料
 
         向承包提供地下管线，气象和水文观测，地质勘察资料，并对资料的真实性、准确性和完整性负责。
 
     (10)支付担保
 
         发包要求承包提供履约担保的，发包应向承包提供支付担保。
 
 三、承包人的一般义务
     ——质量、安全、文明、环保、工期、保修、保险、工资、归档
 
     (1)办理法律规定应由承包人办理的许可和批准。【夜间施工、文明施工  是施工方办理】
     (2)完成工程，承担保修义务;
     (3)采取施工安全和环保措施，办理工伤保险，确保工程及人员、材料、设备和设施安全;
     (4)编制施工组织设计和施工措施计划;
     (6)负责施工场地及周边环境与生态保护;
     (9)编制竣工资料，完成【竣工资料立卷归档】。【不是施工资料归档】
 
 四、进度、质量、费用控制的内容
 
     1.进度控制
 
         (1)进度计划修订
 
                 发包、监理对进度计划的确认，不减轻或免除承包的责任和义务。
 
         (2)开工通知
 
                 监理应在开工日期7天前向承包发开工通知。 【14天图纸 7天现场 7天开工】
 
                 因发包原因造成监理未能在开工日期90天内发开工通知的，承包有权提出价格调整要求，或者解除合同。
 
         (3)工期延误
 
                 1)发包人原因——发包承担费用、工期、利润。
 
                 2)承包人原因
                     承包人支付逾期竣工违约金，不免除继续完成义务。
 
         (4)暂停施工
 
                 1)发包人原因——发包承担费用、工期、利润。
 
                 2)承包人原因
 
                     承包人承担费用和工期，监理复工指示后84天内仍未复工，视为无法履行合同。【90天】
 
                 3)紧急情况暂停施工
                     紧急情况需暂停施工，承包人可先暂停，并及时通知监理人，
                     监理人应在接到通知后24小时内发出指示，逾期未发出指示，视为同意。
 
         (5)提前竣工
 
                 发包要求承包人提前竣工的，发包通过监理向承包下达提前竣工指示，承包应提交提前竣工建议书，包括实施的方案、缩短的时间和增加的价格。
 
         (6)实际竣工日期
 
                 1验收合格:提交竣工验收申请报告之日。
 
                 2发包原因，42天内未完成竣工验收，或完成竣工验收不签发工程接收证书:提交竣工验收申请报告之日。
 
                 3未竣工验收，发包擅自使用:转移占有工程之日。
 
     2.质量控制
 
         (2)隐蔽工程检查
 
                 1)检查程序
 
                     承包人自检合格，共同检查前48小时书面通知监理。
                     监理人不能按时进行检查，检查前24小时提交书面延期要求，但延期不能超过48小时。
 
                 2)重新检查
 
                     发包人或监理人对质量有疑问的，可要求重新检查，承包人应遵照执行。
 
                     经检查，质量符合要求，发包承担费用、工期、利润;质量不符合要求，承包承担费用、工期。
 
                 3)承包人私自覆盖
 
                     无论是否合格，费用和(或)工期均由承包人承担。
 
         (3)缺陷责任与保修
 
                 1)缺陷责任期
 
                     自通过竣工验收之日起计算，在专用合同条款中约定具体期限，最长不超过24个月。【是 实际竣工日期 不是竣工验收合格】
 
                     单位工程先于全部工程验收，合格并交付使用，单位工程缺陷责任期自单位工程验收合格之日起算。
 
                     因承包人原因导致无法竣工验收的，从实际通过竣工验收之日起计算
 
                     发包原因导致无法竣工验收的，自提交竣工验收申请报告90天后，自动进入缺陷责任期。
                     发包擅自使用，自转移占有之日起算。
 
                 2)保修责任
 
                     保修期从竣工验收合格之日起算，不低于最低保修年限。
     3.费用控制
 
         (1)预付款
 
                 预付款至迟开工7天前支付。逾期超过7天，催告， 收到通知后7天仍未支付，暂停施工。
                 承包人在发包人支付预付款7天前提供预付款担保。
 
         (2)进度款(7+7+14)
 
                 1)承包人每月25日报送上月20日到当月19日的工程量报告，并附进度付款申请单。
                 2)监理人收到后，7天内完成审查并报送发包人， 发包人7天内完成审批并签发进度款支付证书。
                 3)发包人进度款支付证书签发后14天内完成支付。

 */
#pragma mark 1Z206022 物资采购合同的内容

/*
 
 一、建筑材料采购合同
 
     1.约定质量标准的原则
         (1)国家标准;
         (2)部颁标准;
         (3)企业标准;
         (4)合同约定。
 
         标的物应该符合国家或行业现行的质量标准和设计要求
 
     2.包装
 
         包装物一般应由供货方提供，不得收取包装费。
 
     3.验收
 
         (1)驻厂验收
         (2)提运验收
         (3)接运验收
         (4)入库验收:广泛采用正式的验收方式。
 
     4.交货期限
 
         (1)供货方负责送货，以收货戳记日期为准;
         (2)采购方提货，按合同规定通知的提货日期为准;
         (3)委托运输，以承运单位签发的日期为准。
             凡委托运输部门送货的，以供货方发运产品时承运单位签发的日期为准
 
     5.价格
 
         (1)有国家定价，按国家定价;
         (2)由国家定价但尚无定价，报请物价主管部门;
         (3)不属于国家定价，双方协商。
 
     6.违约责任
         多交货部分、不符合合同规定的产品，代为保管期间实际支出的保管费由供货方承担。
 
 二、设备采购合同的主要内容
 
     采用【固定总价】合同，包括税费、运杂费、保险费。
 
     价款支付分三次: (1)制造前，10%预付款; (2)货物送达交货地点，80%; (3)剩余10%作为设备保证金。
 
 
 */
#pragma mark 1Z206023 施工专业分包合同的内容

/*
 
 一、承包人责任义务
     ——类似承包合同的发包人 ——场地、图纸、办证、协调、交通、交底、验收、付款
     ——提供总包合同(价格内容除外)供分包查阅。
 
         《建设工程施工专业分包合同(示范文本)》下承包人的工作:
         1)向分包人提供与分包工程相关的各种证件、批件和各种相关资料，向分包人提供具备施工条件的施工场地;
         2)组织分包人参加发包人组织的图纸会审，向分包人进行设计图纸交底;
         3)提供合同专用条款中约定的设备和设施，并承担因此发生的费用;
         4)随时为分包人提供确保分包工程的施工所要求的施工场地和通道等，满足施工运输的需要，保证施工期间的畅通;
         5)负责整个施工场地的管理工作，协调分包人与同一施工场地的其他分包人之间的交叉配合，确保分包人按照经批准的施工 组织设计进行施工。
 
 二、专业分包人责任义务——类似承包合同的承包人
     ——质量、安全、文明、环保、工期、保修、保险、工资、归档
 
     2.分包人与发包人的关系
 
         分包不得与发包或工程师发生直接工作联系，不得直接致函发包或工程师，不得直接接受发包或工程师指令。
 
     3.分包工程范围内，承包人随时可以发指令。
 
     4.分包人的工作
 
         (2)完成规定的设计内容，承包人承担费用。
         (3)向承包提供进度计划及进度统计报表;
         (4)向承包提交施工组织设计。
         (5)按规定办理交通、噪声、环保、安全文明等手续， 承包人承担费用;
         (7)竣工交付前，负责成品保护。
 
 三、合同价款及支付
 
     2.分包合同价款与总包合同相应部分无任何连带关系。
 
     3(5)承包人应在收到分包竣工结算报告及结算资料后28天内支付结算价款。
 
 四、禁止转包或再分包
 
     1.专业分包不得将工程转包，也不得再分包。
     2.专业分包可以将劳务作业再分包。
 
 */
#pragma mark  1Z206024 施工劳务分包合同的内容

/*

 一、承包人的主要义务——除了干活外的全部事情
 
     1.组建项目管理班子。
     2.向分包提供场地、道路、资料、临时设施。
     3.负责编制施工组织设计，组织编制年季月施工计划、物资需用量计划表。
     4.负责测量定位、沉降观测、技术交底，组织图纸会审，档案资料收集整理及交工验收。
     5.按时提供图纸。
     6.向分包支付报酬。
     7.负责与各单位联系协调。
 
 二、劳务分包人的主要义务——只会干活
 
     2(1)科学安排作业计划。
     2(2-3)加强安全教育、现场管理。
 
 三、保险原则:自己的人、自己的设备，自己办保险
 
     1. 劳务分包人施工开始前，承包人应获得发包人为施工场地内的自有人员及第三方人员生命财产办理的保险，且不需劳务分包人支付保险费用。
 
     2. 运至施工场地用于劳务施工的材料和待安装设备，由 承包人办理或获得保险，且不需劳务分包人支付保险费用。
     3. 承包人必须为租赁或提供给劳务分包人使用的施工机械设备办理保险，并支付保险费用。
     4. 劳务分包必须为从事危险作业的职工办理意外伤害保险，并为施工场地内自有人员和施工机械设备办理保险，支付保险费。
 
 【法规里规定 是承包人买保险】
 
 四、劳务报酬最终支付
 
     (1)下列情况，固定劳务报酬或单价可以调整:
     1 市场人工价格变化幅度超过一定百分比;
     2法律政策变 化导致劳务价格变化
 
     1.全部工作完成，经承包人认可后14天内，劳务分包人向承包人递交完整的结算资料。
     2.承包人14天内核实，确认后14天内向劳务分包人支付劳务报酬尾款。
 
 五、禁止转包或再分包
 
     劳务分包不得将劳务作业转包或再分包。(专业分包可以将劳务作业再分包，P297)
 
         1.劳务分包人施工开始前，承包人应获得发包人为施工场地内的自有人员及第三人人员生命财产办理的保险，且不 需劳务分包人支付保险费用。
         2.运至施工场地用于劳务施工的材料和待安装设备，由承包人办理或获得保险，且不需劳务分包人支付保险费用。
         3.承包人必须为租赁或提供给劳务分包人使用的施工机械设备办理保险，并支付保险费用。
         4.劳务分包人必须为从事危险作业的职工办理意外伤害保险，并为施工场地内自有人员生命财产和施工机械设备办理保险，支付保险费用。
         5.保险事故发生时，劳务分包人和承包人有责任采取必要的措施，防止或减少损失。
 
 */
#pragma mark  1Z206025  项目总承包合同的内容

/*

 项目总包和施工承包的最大不同之处在于承包商负责全部或部分的设计，并负责物资设备的采购。
 
 1.项目总承包的责任义务
 
     (1)完成设计、采购、施工、竣工试验;
     (2)自费修复各种缺陷;
     (3)编制项目进度计划;
     (4)开工15日前向发包人提交施工组织设计;
     (5)开工20日前，通知发包人办理开工批准、施工许可证、质量监督等许可;
     (6)提前10日，通知发包人办理临时用地、临时水电路许可等有关手续;
     (7)提供新发现的障碍资料。
 
 2.发包人的权利义务
 
     (1)负责办理项目审批、备案手续，取得用地使用权， 完成拆迁补偿，提供立项文件。
     (2)履行合同约定的价格调整、付款、结算义务。
     (3)有权提建议、修改、变更，赔偿，发暂停通知。
     (4)提供基础资料、已有障碍资料。
     (5)负责组织设计阶段审查会议
     (6)办理开工批准、施工许可证、质量监督等许可;
     (7)联系协调处理文物、古树、化石、坟墓，承担相关费用，工期顺延;
     (8)20日内确认安全环保等管理计划。
 
 */
#pragma mark  1Z206026 工程监理合同的内容

/*

 一、监理工作内容(与P75-76结合学)
 
     1. 编制监理规划、监理实施细则;
     4. 审查施工组织设计是否符合强制性标准;
     13. 审核、签发或出具工程款支付证书;
     14. 在巡视、旁站和平行检验;
     17. 验收隐蔽工程、分部分项工程;
     19. 编写工程质量评估报告;
     20. 参加工程竣工验收，签署竣工验收意见。
 
 二、监理机构人员规定
 
     更换总监，提前7天向委托人书面报告;
     更换其他监理，通知委托人。
     (P61 更换项目经理:14天，14+28天)
 
     2. 哪些情形需要更换监理人员?:
     (1)严重过失行为的;
     (2)有违法行为不能履行职责的;
     (3)涉嫌犯罪的;
     (4)不能胜任岗位职责的;
     (5)严重违反职业道德的;
     (6)专用条件约定的其他情形。
 
 三、监理人的职责
 
 1. 在服务范围内，委托人和承包人提出的意见和要求， 监理人应及时提出处置意见。当委托人与承包人之间发生合 同争议时， 监理人应协助委托人、承包人协商解决。【是协助协商  不代表任何一方】
 2. 当委托人与承包人之间的合同争议提交仲裁机构或人 民法院时，监理人应提供必要的证明资料。
 3. 在专用条款约定的授权范围内，处理委托人与承包人 的合同变更事宜。如果变更超过授权范围，应以书面形式报 委托人批准。
     紧急情况下，为了保护财产和人身安全，监理人所发出 的指令未能事先报委托人批准时，应在发出指令后24小时内 以书面形式报委托人(项目经理48小时)。
 4. 监理人发现承包人的人员不能胜任本职工作，有权要 求承包人予以调换。
 
 
     紧急情况，为确保安全，监理人应在发出指令后24 小时内书面报告委托人。(P61，项目经理48小时)
 
 */
#pragma mark   ******************************** 1Z206030 合同计价方式 3

/*

 复习重点、难点、高频考点梳理
 1.单价合同的运用
 2.总价合同的运用
 3.成本加酬金合同的运用
 
 
 */
#pragma mark  1Z206031 单价合同的运用

/*

 当合同总价与各项单价乘以实际完成的工程量之和发生矛盾时，则肯定以后者为准，即单价优先。实际工程款的支付也将实际完成工程量乘以合同单价进行计算。
 
 
 单价合同适合工程量一时不能明确的工程。
 
 实际支付的工程款=实际完成的工程量*合同单价
 
 单价优先。有明显错误，业主【有权先修改再评标】。总价单价不一致，以单价为准调整总价。
 
 单价合同 业主和承包商都不存在工程量方面的风险。
 
 类型
    固定单价合同【不管什么情况都不变单价】
         适用于工期较短、工程量变化幅度不会太大的项目。【变化幅度 即 百分比】
    变动单价合同
         适用的三种情况:【实际工程量发生较大变化】、通货膨胀达到一定水平、国家政策发生变化。
 
 当采用变动单价合同时，合同双方可以约定一个估计的工程量，当实际工程量发生较 大变化时可以对单价进行调整，同时还应该约定如何对单价进行调整;当然也可以约定，当通货膨胀达到一定或国家政策发 生变化时，可以对哪些工程的内容的单价进行调整以及如何进行调整。
 
*/
#pragma mark 1Z206032 总价合同的运用

/*
 
 一、总价合同的含义
 
     也称总价包干合同，当施工内容和有关条件不变时，价款总额不变。
 
 二、固定总价合同
 
     承包商承担了全部的工程量和价格的风险。
 
     国际上，被广泛接受和采用
 
     价格风险:
         价算错，漏报，物价、人工费上涨;
     工作量风险:
         量算错，工程范围不确定，工程变更，设计深度不够。
 
     固定总价合同价格调整的情况:重大工程变更、累计工程变更超过一定幅度、其他特殊条件。【没有通货膨胀】
 
     采用固定总价合同，双方结算比较简单，但是由于承包商承担了较大的风险，因此报价中不可避免地要增加一笔较高的不可预见风险费。
 
     适用范围:
     (1)量小、期短;
     (2)设计详细，图纸完整;
     (3)工程结构和技术简单，风险小;
     (4)投标期相对宽裕。
     (5)施工期限一年左右的项目。
 
 三、变动总价合同——可调总价合同
 
     适用的四种情况:通货膨胀、设计变更、工程量变化、工程条件变化。
 
     建设周期一年半以上的项目，应考虑下列因素引起的价格变化:
     (1)劳务工资、材料费上涨;
     (2)运输费、燃料费、电力等价格变化;
     (3)外汇汇率不稳定;【外汇 不是银行汇率】
     (4)国家立法改变引起工程费用上涨。
 
 四、总价合同特点
 
     (1) 可以较早确定或者预测工程成本;
     (2) 【业主风险小，承包人风险大】;
     (3) 易于迅速确定最低报价的投标人;
     (4) 【进度】上能极大地调动承包人的积极性;
     (5) 发包单位能更容易、更有把握对项目进行控制;
     (6) 必须完整明确规定承包人的工作;
     (7) 必须将设计和施工的变化控制在最小限度内。
 
 */
#pragma mark 1Z206033 成本加酬金合同的运用

/*
 一、含义——成本补偿合同
 
     承包商不承担任何价格或工程量变化的风险。
 
 二、特点和适用条件
 
     1.适用条件(应用)
         (1)工程特别复杂，工程技术、结构方案不能预先确定，或尽管可以确定但不能竞争性招标，如研究开发项目;
         (2)时间特别紧迫，如抢险救灾工程;
         (3)施工总管、CM、项目管理合同、咨询服务合同。
 
     2.对业主的优点
 
         (1)分段施工缩短工期;
         (2)减少承包商对立情绪;
         (3)利用承包商的技术专家，弥补设计不足;
         (4)根据自身力量和需要，较深入地介入和控制施工和管理;
         (5)通过确定最大保证价格约束成本不超过限值，转移一部分风险。
 
     3.对承包商的特点
 
         优点:风险低，利润比较有保证
         缺点:合同不确定性大
 
 三、形式
 
 【考概念  考适用情况】
 
     (1)成本加固定费用合同——成本估计不准，可能变化不大。
 
         确定一笔固定数目的报酬金额作为管理费及利润，对人工、材料、机械台班等直接成本则实报实销。
 
         如果【设计变更或增加新项目】，固定报酬也要增加。
 
         在工程总成本一开始估计不准，可能变化不大的情况，可采用此合同形式。
 
     (2)成本加固定比例费用合同——很难描述工程范围，或工期紧迫，无法按常规编制招标文件招标。
 
         工程成本中直接费加一定比例的报酬费，报酬部分的比例在签订合同时由双方确定。
 
         这种方式的报酬费用总额随成本加大而增加，【不利于缩短工期和降低成本】
 
         一般在工程初期很难描述工作范围和性质，或工期紧迫，无法按常规编制招标文件招标时采用
 
 
     (3)成本加奖金合同——准备不充分，仅能制定一个估算指标。规定底点和顶点，最大罚款不超过最高酬金。
 
         奖金根据成本估算指标制定，在合同中规定一个底点和一个顶点，分别为工程成本估算的60%~75%和 110%~135%。
         当实际成本超过顶点对承包商罚款时，最大罚款限额不超过原先商定的最高酬金值。
         在招标时，当图纸、规范等准备不充分，不能据以确定合同价格，而仅能制定一个估算指标时采用。
 
     (4)最大成本加费用合同——设计深度达到可以报总价，包括管理费、风险费、利润。
         【在非代理型(风险型)CM 模式中应用】。
 
         在总价合同基础上加固定酬金的方式，即当设计深度达到可以报总价的深度，投标人报一个工程成本总价和一个固定的酬金(包括各项管理费、风险费和利润)。
         在非代理型(风险型)CM模式中应用
 
  (1) 成本加固定费用合同
 
         【根据这种合同，招标单位对投标人支付的人工、材料、设备台班费等直接成本全部予以补偿，同时还增加一笔管理费。
         所谓固定费用，是指杂项费用与利润相加的和，这笔费用总额是固定的， 只有当工程范围发生变更而超出招标文件的规定时才允许变动。】
 
         这种超出规定的范围是指在成本、 工时、 工期或其他可测项目方面的变更招标文件规定数量的上下 10%.
 
 (2) 成本加固定比例费用合同
 
         成本加固定比例费用合同与成本补偿合同相似， 不同的只不过是所增加的费用不是一笔固定金额，而是按照成本的一定比率计算的一个百分比份额。
 
 (3) 成本加奖金合同
 
         奖金是根据报价书的成本概算指标制定的，概算指标可以是总工程量的工时数的形式， 也可以是人工和材料成本的货币形式，
         在合同中，概算指标被规定了一个底点和一个顶点， 投标人在概算指标的顶点下完成工程时就可以得到奖金， 奖金的数额按照低于指标顶点的情 况而定;
         而如果投标人在工时或工料成本上超过指标顶点时， 他就应该对超出部分支付罚款， 直到总费用降低到概算指标的顶点为止。
 
 */
#pragma mark  ******************************** 1Z206040 建设工程施工合同风险管理、 工程保险和工程担保 4

/*
 
 */
#pragma mark 1Z206041 施工合同风险管理

/*
 
 1.工程合同风险的分类
 
     按原因分:合同工程风险(客观、非主观故意导致)、
            合同信用风险(主观故意导致)。
 
     按阶段分:合同订立风险、合同履约风险。
 
 2.工程合同风险产生的原因 【记忆】-------合同的不完全性
 
        合同的不完全性、个人有限理性、环境不确定性、信息不对称、交易成本(成本高于收益)、机会主义行为(损人利己)
 
         (1)合同的不确定性。人的有限理性导致。
         (2)工程实施存在各种风险，如不利自然条件、工程变更、政策法规变化、物价变化。
         (3)合同语句表达不清晰、不细致、不严密、矛盾。
         (4)合同双方疏忽。
         (5)交易成本的存在，解决特定事宜使成本超出收益。
         (6)信息的不对称，是【合同不完全的根源】。业主不真正了解承包商，承包商不真正了解业主，总包对分包不真正了解。
         (7)机会主义行为的存在，通过掩盖信息和提供虚假信息损人利己
 
 3.施工合同风险的类型【记忆】
 
     (1)环境风险        (政治、经济、法律、自然环境)
 
             (1)政治环境:战争、罢工;
             (2)经济环境:通货膨胀、【汇率调整】、工资和物价上涨;
             (3)法律环境:法律颁布、【税率调整、增加税种】;
             (4)自然环境:不可抗力，水文、地质、现场条件恶劣
 
     (2)成员资信能力风险    (业主、承包、分包、供货、【政府、周边居民】)
 
             (1)业主资信能力风险:经营状况恶化，苛刻刁难承包商，经常改变主意(改变设计、施工方案)，不能完成合同责任。
             (2)承包(分包、供货)资信能力风险。
             (3)政府工作人员干预、周边居民、单位干预。
 
     (3)管理风险        (【环境调查预测】，【合同条款】、工程范围标准，投标策略，设计、方案、计划、措施，实施过程)
 
             (1)对环境调查预测的风险;
             (2)合同条款不严密、工程范围标准不确定;
             (3)投标策略错误;
             (4)技术设计、施工方案计划、组织措施有漏洞;
             (5)实施过程的风险:合作伙伴、保证措施、分包太多。
 
 4.工程合同风险分配原则
 
     (1)业主对风险的分配起主导作用;
     (2)效率原则、公平原则。
         1.最大限度发挥双方的积极性，做到:（效率原则）
             1)谁能最有效的预测、防止、控制、降低、转移风险，就由他承担相应的风险责任。
             2)谁能以最低的成本来承担风险损失，就由谁来控制风险
 
         2.公平合理，责认权利平衡（公平原则）
 
     不合理分配产生的后果:
 
         (1-2)业主、承包商双方缺乏积极性。
         (3)如果合同定义的风险没有发生，则业主多支付了不可预见风险费，承包商取得了超额利润。
 
     合理分配的好处:
 
         (1-4)报价合理、不可预见费较少;减少合同的不确定性;最大限度发挥双方的积极性;效益更好
 
     谁最能有效的预防控制风险，或者有效的降低风险损失或者能将风险转移给其他方面则由谁来承担相应的风险责任
 
 
 
 */
#pragma mark  1Z206042 工程保险的内容

/*

 一、保险概述
 
     1.保险标的
 
         保险保障的目标和实体。
 
     2.保险金额
 
         保额，保险人承担赔偿或给付保险金责任的最高限额。
 
     3.保险费
 
         保费，投保人支付给保险人的价金。
 
     4.保险责任
 
         分为基本责任和特约责任。
             基本责任包括直接和间接责任。
             特约责任属于除外责任范围，需要特别注明承保
 
         保险合同内都有除外责任条款，除外责任属于免赔责任，
 
         除外责任（比较一致的有以下几项）:
         (1)投保人故意行为所造成的损失;
         (2)因被保险人不忠实履行约定义务所造成的损失;
         (3)战争或军事行为所造成的损失;
         (4)保险责任范围以外，其他原因所造成的损失。
 
 三、工程保险种类【记忆】
 
     1.工程一切险
 
         包括建筑工程一切险、安装工程一切险，以双方名义投标。
 
         国内由项目法人办理，国外由承包人办理。
             如果承包人不愿投保工程一切险，也可以就材料、设备、临时工程、已完工程分别投保，但应征得业主同意。
             一般集中投保比分别投保费用少。
 
     2.第三者责任险
 
         指施工原因导致项目法人和承包人以外的第三人受到财产损失或人身伤害的赔偿。
 
         被保险人是项目法人和承包人，一般附加在工程一切险中。
 
         工地财产损失、职工伤亡，不属于第三者责任险， 而属于工程一切险和人身意外伤害险。
 
     3.人身意外伤害险
     4.承包人设备保险
     5.执业责任险
 
     6.CIP保险——一揽子保险【掌握】
         包括:劳工赔偿、雇主责任险、一般责任险、建筑工程一切险、安装工程一切险。
         优点:最优价格、最佳保障;有效风险管理;降低赔付率、降低保险费率;避免诉讼，便于索赔。
 
 */
#pragma mark 1Z206043 工程担保的内容

/*
 
 一、担保方式
     保证:保证人履行债务或承担责任;
     抵押:不转移对所拥有财产(动产、不动产)的占有;
     质押:将质押物(动产、权利)移交债权人占有;
     留置:债权人按(保管、运输、加工)合同约定占有债务人的动产;
     定金:给付方不履行，无权要求返还;收受方不履行，双倍返还。
 
     工程担保中大量采用保证担保。
 
 【记忆】
      种类        含义          形式                              比例\特点                       作用
     投标担保   投标向招标   保函、担保、保证金               2%,80万,30天; 2%; 2%,10万          保证中标签合同 ，筛选投保人
     履约担保   投标向招标   保函、担保、保证金、保留金                   10%                     促使承包商履行合同约定
     预付款担保 承包向发包   保函、担保、抵押                 =预付款 逐月减少                       保证偿还发包人的预付款
     支付担保  发包向承包   保函、担保、保证金                    20%-25% 分段滚动                确保工程款支付到位，解决拖欠
 
 投标担保 ：
     《工程建设项目施工招标投标办法》规定，投标保证金不超过投标总价的2%，但最高不超过80万元
     《招标投标法实施条例 》规定，投标标保证金不得超过招标项目估算价的2%。投标保证金有效期应当与投标有效期一致。
     主要目的是保护招标人不因中标人不签约而蒙受经济损失。另一个作用是在一定程度上筛选投标人。
 
 履约担保:
     1.履约担保是最重要、担保金额最大的工程担保。
     2.履约担保有效期从开工到竣工交付或保修期满。
 
     3.保修担保，可采用保留金方式。
 
         保留金是指在发包人(工程师)根据合同约定，每次支付工程进度款时扣除一定数目的款项，作为承包人完成其修补缺陷义务的保证。一般为每次进度款的10%，但总 额应限制在合同总价款的5%。
 
     4.建筑行业倾向于采用有条件银行保函。
 
         银行履约保函是由商业银行开具的担保证明，通常为合同金额的10%。分为有条件银行保函和无条件银行保函。建筑业采用有条件银行保函。
 
     5.由担保公司或保险公司开具履约担保书。
 
         履约担保书 由担保公司或保险公司开具，当承包人违约，担保公司或保险公司用该项担保金去完成施工任务或向发包人支付完成该项目所实际花费的金额，但该金额必须在保证金担保金额之内。
 
     6.履约保证金大小取决于招标项目的类型与规模。
         在投标须知中，要规定使用哪种形式的履约担保。
 
     7.发包人要求承包人提供履约担保的，发包人应当向承包人提供支付担保。
 
     促使承包商履行合同约定，完成工程建设任务。履约保证金额的大小取决于招标项目的类型和规模。在投标须知中，发包人要规定使用哪一种形式的履约担保
 
 预付款担保:
 
     合同签订后，发包人往往会支付给承包人一定比例的预付款，一般为合同金额的10%，如果发包人有要求， 承包人应向发包人提供预付款担保。
 
     主要形式是银行保函。预付款担保的金额通常与发包人的预付款是等值的。预付款逐月从工程付款中扣除， 预付款担保的金额也相应逐月减少。
 
     保证承包人能够按合同规定进行施工，偿还发包人已支付的全部预付金额
 
 支付担保：
 
     招标人提供的保证工程款支付义务的担保。
     银行保函，履约保证金，担保公司担保。支付担保 实行分段滚动，为合同总额的20%~25%。
     确保工程费用及时支付到位，解决工程款拖欠
 */
#pragma mark  ******************************** 1Z206050 建设工程施工合同实施 4

/*
 
 */
#pragma mark 1Z206051 施工合同分析的任务

/*
 
 一、合同分析的含义
 
     由企业合同管理部门或项目合同管理人员负责。
 
 二、合同分析的作用
 
     1. 分析合同中的漏洞，解释有争议部分
     2. 分析合同风险，制订风险管理对策
     3. 分解合同任务，并落实到具体的部门、人员 便于实施和检查
 
 三、合同分析的内容
 
     2. 承包人的主要任务
 
         (1)总任务，即合同标的 承包人的责任。
         (2)工作范围。由工程量清单、图纸、工程说明、技术规范定义。
 
         (3)工程变更。
 
             1 补偿范围，百分比越大，承包人风险越大。  【补偿范围10%  表示变动在10%以内的不进行补偿】
             2 索赔有效期，时间越短，对承包人越不利。
 
             合同实施中，如果工程师指令的工程变更属于合同规定的工程范围，承包人必须无条件执行;如果超过承包人应承担的风险范围，可向业主提出补偿要求
 
             工程变更如果属于合同范围内的，施工方要无条件执行，而不是先提出补偿要求，【不是合同范围内的变更 不是无条件执行】
             工程变更的索赔有效期一般是28天也有14天的，
             变更索赔期越短，对承包人越不利
             工程变更的补偿范围越大，承包人的风险越大
 
     3. 发包人的责任——合作责任
 
         (1)业主雇用工程师并委托其履行部分合同责任;
         (2)对平行的各承包人和供应商之间的责任界限作出划分，争议裁决、工作协调;
         (3)及时作出承包人履行合同所必需的决策，如下达指令，履行批准、认可、答复、检查、验收手续;
         (4)提供施工条件，如资料、图纸、场地、道路;
         (5)及时支付工程款，及时接收已完工程。
 
     4. 合同价格
 
         重点分析:计价方法、计量程序、价格调整和拖欠工程款责任。
 
     7. 验收、移交和保修
 
         在合同分析中，应对重要的验收要求、时间、程序和法律后果作说明。
 
         竣工验收合格即办理移交。
 
         移交表示:
 
         (1)业主认可并接收工程，承包人施工任务完结;
         (2)工程所有权转让;
         (3)承包人照管责任结束和业主照管责任开始;
         (4)保修责任开始;
         (5)合同规定的工程款支付条款有效。
 
 */
#pragma mark 1Z206052 施工合同交底的任务

/*
 
 “合同交底”，即合同管理人员向各层次管理者或者说向项目管理人员和各个工程小组交底。
             项目经理或合同管理人员将责任分解落实到工作小组、人员或分包单位。
 
 合同分析后，应向【各层次管理者作“合同交底”】，即 由【合同管理人员】在对合同的主要内容进行分析、解释 和说明的基础上，通过组织项目管理人员和各个工程 小组学习合同条文和合同总体分析结果。
 【项目经理或合同管理人员】应将各种任务或事件的责 任分解，落实到具体的工作小组、人员或分包单位。
 
 合同交底的目的和任务:
     (1)内容达成一致理解;
     (2)责任分解落实到人;
     (3-9)明确质量、工期、成本、逻辑、责任、后果、义务。
 
 合同交底的目的和任务:
 (1)对合同的主要内容达成一致理解;
 (2)将合同的责任分解落实到各工程小组或分包人;
 (3)将项目任务分解，明确质量和技术要求;
 (4)明确各项工作或各个工程的工期要求;
 (5)明确成本目标和消耗标准;
 (6)明确相关事件之间的逻辑关系;
 (7)明确各个工程小组(分包人)之间的责任界限;
 (8)明确完不成任务的影响和法律后果;
 (9)明确合同各方的责任和义务。
 
 */
#pragma mark 1Z206053 施工合同实施的控制

/*
 
 一、施工合同跟踪
 
     1.含义
         1)承包单位职能部门对合同执行者跟踪、监督和检查;
         2)合同执行者本身对执行情况跟踪、检查与对比。
 
     2.依据
 
         合同、计划文件、实际工程文件、现场情况
 
         合同跟踪的重要依据是合同以及依据合同而编制的各种计划文件;其次还要依据各种实际工程文件如原始记录、报表、验收报告等;另外，还要依据管理人员对现场情况的直观了解。
 
     3.对象【业主、承包、监理工程师、劳务分包、专业分包】
 
         1)承包的任务; 施工质量、进度、数量、成本
         2)工程小组或分包的工作;
         3)业主和工程师的工作。是否及时提供施工条件，给予指令答复确认，支付工程款
 
 二、合同实施的偏差分析
 
     1.原因分析
 
         可采用鱼刺图、因果关系分析图(表)、成本量差、 价差、效率差分析等方法。
 
     2.责任分析
 
         责任分析必须以合同为依据
 
     3.趋势分析
 
         最终工程状况(工期延误、成本超支、质量标准、生产能力...)、
         最终经济效益、
         承包商后果(被罚款、清算、起诉、企业形象、经营战略影响...)
 
 一、合同实施的偏差处理
 
     (1)组织措施，如增加人员投入，调整人员安排，调整工作流程和工作计划;
     (2)技术措施，如变更技术方案，采用新的高效率的施工方案;
     (3)经济措施，如增加投入，采取经济激励措施;
     (4)合同措施，如进行合同变更，签订附加协议，采取索赔手段。
 
 三、工程变更管理
 
     1.变更范围
        【增加、减少、追加、取消、改变】
 
         (1)增加或减少任何工作，或追加额外的工作;
         (2)取消任何工作，但转由他人实施的工作（违约）除外;
         (3)改变任何工作的质量标准或其他特性;
         (4)改变工程的标高、基线、位置和尺寸;
         (5)改变工程的时间安排或实施顺序。
 
     2.变更程序
 
         (1)提出
 
             ——业主、承包、设计(仅此三方)
 
         (2)批准
 
             承包商提出，工程师审查并批准;
             设计方提出，业主审查并批准;
             业主方提出，通过工程师发出。
 
         (3)执行
 
             变更指示的发出形式:书面、口头。
             根据工程惯例，除非工程师明显超越合同权限，承包人应无条件地执行工程变更的指示。
 
     3.责任分析
 
         (1)业主、政府、环境、不可抗力、原设计错误等导致的设计修改，由业主承担责任。
         (2)施工过程、施工方案出现错误、疏忽导致设计修改，由承包人承担责任。
         (3)施工方案变更要经工程师批准。
 
 */
#pragma mark 1Z206054 施工分包管理的方法

/*
 
 1.分包管理的责任主体
 
     第一责任主体是施工总包或施工总管。
 
 2.分包管理的内容——三控三管+人员管理
 
                 分包管理的内容：质量、成本、进度、安全、合同、信息、人员
 
     成本控制:对业主指定的分包支付工程款，一定要在收到业主的工程款之后才能支付，并应扣除管理费、配合费和质量保证金。
 
 3.分包管理的方法
 
     总包单位建立工程例会制度，及时反映和处理分包单位出现的各种问题。
 
 */
#pragma mark  1Z206055 施工合同履行过程中的诚信自律

/*

 诚信行为记录由各省、自治区、直辖市建设行政主管部门在当地建筑市场诚信信息平台上统一公布。
 
 诚信行为记录在诚信信息平台统一公布。
 
 【良好的长，不良的短（给整改机会）】
 
 良好行为记录:公布期限一般为3年。
 
 不良行为记录:
         资质（包括借资质 不包括出租资质）、
         承揽业务(不正当手段承揽、串标、骗标、不按合同履行义务、转包、违法分包)、
         工程质量、
         工程安全、
         拖欠工程款或工人工资。
 
         公布时间为行政处罚决定作出后7日内，公布期限一般为6个月至3年。
 
         不良行为记录整改确有实效的，提出申请，经批准，可缩短公布期限，但最短不得少于3个月。
 
 */
#pragma mark  ******************************** 1Z206060 建设工程索赔 3 【实务 考10分以上】

/*
 
 
 复习重点、难点、高频考点梳理
 1.索赔的依据
 2.索赔的方法(程序)
 3.索赔费用的计算(工期+费用)
 
 
 */
#pragma mark 1Z206061 索赔的依据

/*
 
 一、索赔的分类
 
     2. 按目的和要求分
         (1)工期索赔
         (2)费用索赔
 
     3. 按事件性质分
 
         (5)不可预见。一个有经验的承包商通常不能预见的外界障碍或条件，导致承包人损失，由发包人承担。
         (6)不可抗力。工期“顺延”，费用各自承担。
 
         在施工期间，承包商可能遇到不能预见的地下岩石，导致工期拖延，这类风险应由发包人承担。
 
 二、索赔成立的前提条件
 
     1. 事件已造成承包人成本额外支出，或直接工期损失;
     2. 不属于承包人的行为或风险责任;【不是自己的责任】
     3. 承包人按合同规定的程序、时间提交索赔意向通知和索赔报告。
     以上三个条件必须同时具备，缺一不可。
 
    【不要求已计算  不要求损失量】
 
 三、索赔的依据
 
     合同文件(最主要，协中投专通标准图纸清单预算书)、法律法规、工程建设惯例
 
 四、索赔的证据(19条)
 
     合同文件、往来函件、会谈纪要、进度计划、施工方案、施组设计、会议纪要、气象报告、现场记录、照片录像、施工日记、备忘录、现场签证、书面指令、验收报告、鉴定报告、交接记录、采购记录、市场行情资料(物价指数)、现场资料、结算资料、核算资料、法律政策文件。
 
     ——合同文件、法律政策文件 + 气象报告、市场行情资料(物价指数)+施工现场发生的所有书面资料。【必须是书面资料  口头不行】
 
 */
#pragma mark  1Z206062 索赔的方法

/*

 一、索赔程序【实务考试】
 
     发生索赔事件，或发现索赔机会，28天内提出索赔意向通知。(索赔的第一步)
 
     发出索赔意向通知后，28天内提交索赔文件和有关资料(索赔报告)。
 
     干扰事件影响持续时间长，合理时间间隔(一般为28天)，提交中间索赔报告;
 
     干扰事件影响结束后28天，提交最终索赔报告。
 
 二、索赔文件的主要内容
 
     (1)总述 (2)论证，关键部分 (3)计算 (4)证据
 
 四-六、索赔文件的核查
 
     索赔文件由工程师审核，发包人审查。
     工程师提出的初步处理意见，发承包一方或双方不接受，三方进行协商。
 
 七、反索赔的基本内容
 
     包括两方面:一是防止对方提出索赔，二是反击或反驳对方的索赔要求。
     索赔、反索赔都是双向的。P335
 
 八、对索赔报告的反击或反驳要点
 
     1.时限性;
     2.真实性;
     3.调查分析并确定干扰事件的原因和责任; 【不是索赔事件的原因、责任】
     4.理由;
     5.证据;
     6.索赔值审核——审核重点:计算方法、取费、有无重复计算、计算结果是否准确。
 
    没有审核索赔文件
 
 */
#pragma mark  1Z206063 索赔费用的计算【重要】

/*

 一、索赔费用的组成
 
     1.人工费。
 
         包括:完成合同之外的额外工作，非承包商责任工效降低，加班劳动，法定人工费增长，非承包商责任工程延期(窝工费)。
 
     2.材料费。
 
         实际用量超过计划用量;【客观原因】导致材料价格大幅上涨;【非承包商责任】工程延期导致材料价格上涨和超期储存费。
 
     3.施工机械使用费。
 
         包括:完成额外工作，非承包商责任工效降低，业主或监理工程师原因导致机械停工。
 
         窝工费的计算，租赁，按租金和调进调出费;自有，按台班折旧费。
 
     7. 总部(企业)管理费
 
         (3)以工程延期的总天数为基础，计算步骤:
             对某一工程提取的管理费=同期内公司的总管理费 ×(该工程的合同额/同期内公司的总合同额)
             该工程的每日管理费=该工程向总部上缴的管理费/ 合同实施天数
             索赔的总部管理费=该工程的每日管理费×工程延期的天数
 
     8.利润
 
         由于【工程范围变更、文件缺陷、技术错误、业主未能提供现场】，承包人可列入利润。
 
         工程暂停不能索赔利润。
         一般监理工程师很难同意在工程暂停的费用索赔中加进利润损失
 
         利润计算与原报价单中利润百分率保持一致。
 
 二、索赔费用的计算方法
 
     1.实际费用法
 
         最常用。以实际开支为根据。
 
     2. 总费用法
     3. 修正的总费用法
 
 
 */
#pragma mark 1Z206064 工期索赔的计算【重要】

/*
 
 一、工期延误的分类
 
     1.按结果分——可索赔延误、不可索赔延误。
 
     2.按线路分——关键线路延误、非关键线路延误。
 
         关键线路，非承包商原因，可索赔。
 
         非关键线路，非承包商原因，取决于总时差大小和延误时间长短。
             如果延误时间少于总时差，业主一般不会给予工期顺延，但可能给予费用补偿;
             如果延误时间大于总时差，非关键线路工作转化为关键工作，成为可索赔延误。
 
     3.按关联性划分
 
            【每一种延误都是可能索赔、可能不索赔】
 
         (1)单一延误——某一延误事件从发生到终止，没有其他延误事件发生。——可不可赔，看谁责任。
         (2)共同延误——两个或两个以上延误事件从发生到终止的时间完全相同。
             ——延误事件全是业主的，可赔;
             ——延误事件全是承包商的，不可赔;
             ——延误事件业主和承包商都有，可赔变成不可赔。
         (3)交叉延误——当两个或两个以上延误事件从发 生到终止只有部分时间重合。——不重合部分，参照单一延误;重合部分，参照共同延误。
 
 三、工期索赔的计算方法
 
     1. 直接法
 
         干扰事件直接发生在关键线路上。
 
     2. 比例分析法【重点】
 
         (1)按工程量比例进行分析
 
                 某工程的工程量由2800m3增加到3500m3，原定工期 是40天。
                 工期索赔值=原工期×新增工程量/原工程量=40× (3500-2800)/2800=10天
 
                 如果工程量增减10%为承包商应承担的风险，则: 工期索赔值=40×(3500-2800×110%)/2800=6天
 
         (2)按造价比例进行分析
 
                 某工程合同价1200万元，总工期24个月，施工过程中 业主增加额外工程200万元。
                 工期索赔值=原合同工期×附加或新增工程造价/原合 同总价=24×200/1200=4个月。
 
     3. 网络分析法——标号法
 
 */
#pragma mark  ******************************** 1Z206070 国际建设工程施工承包合同 3

/*
 
 
 */
#pragma mark 1Z206071 国际常用的施工承包合同条件

/*
 掌握FIDIC系列前三个
                    施工合同条件                     永久设备和设计—建造合同条件                   EPC交钥匙项目合同条件
 谁设计 设计什么       发包人或工程师                      承包商承担大部分设计                     承包商负责所有设计、采购和建造
 计价方式是什么        单价（子项可包干） 单价可调整         总价合同，法律、物价变化，价格可调。          固定总价合同，某些特定风险才调价。
 有没有工程师         委派工程师                           委派工程师                           没有工程师，由业主或业主代表取代
 
 
 1. FIDIC系列
 
     (1)《施工合同条件》，新红皮书
 
         由发包人或工程师设计的房屋建筑工程和土木工程。
         单价合同，某些子项包干。 【单价可调整】
         业主委派工程师:管理合同，监督进度、质量，签发支付、接收和履约证书，处理合同管理中的有关事项 。【不是业主自己干 是委派】
 
     (2)《永久设备和设计—建造合同条件》，新黄皮书。
 
         由承包商做绝大部分设计。
         总价合同，法律、物价变化，价格可调。
         工程师管理模式与《施工合同条件》类似。
 
     (3)《EPC交钥匙项目合同条件》，银皮书。
 
         承包商负责所有设计、采购和建造。
         固定总价合同，某些特定风险才调价。
         没有工程师，由业主或业主代表取代。
         与前两种相比，承包商要承担较大的风险。
 
     (4)《简明合同格式》
 
         适用于投资额较低、不需要分包或投资额较高、但工作内容简单、重复，或建设周期短。
         采用单价合同、总价合同或其他方式。
 
 2. 英国JCT
 
     适用于施工总包、DB、MC模式。属于总价合同。
 
     JCT98的适用条件:
     (5)执行速度较慢;
     (8)违约、质量缺陷由承包商承担，工期延误由业主、承包商共同承担。

 3. 美国AIA
 
     分为A、B、C、D、F、G、INT系列。
 
     其中：
     【A系列，是关于业主与承包人之间的合同文件；
     B系列，是关于业主与建筑师之间的合同文件；
     C系列，是关于建筑师与提供专业服务的咨询机构之间的合同文件；
     INT系列:国际工程项目合同文件。】
 
     D系列，是建筑师行业所用的有关文件；
     F系列，财务管理报表；
     G系列，是合同和办公管理中使用的文件和表格；
 
     【A201，即施工合同通用条件，是AIA的核心文件。】
 
     【主要用于私营的房屋建筑工程】。
 
    【 AIA中建筑师类似于红皮书中的工程师。但更强调建筑师维护业主的一面。】
     建筑师的权力:检查权、支付确认权、文件审批权、编制变更指令权。
 

 
 */
#pragma mark 1Z206072 施工承包合同争议的解决方式

/*
 
 解决国际工程承包合同争议的主要方式有：协商，调解，仲裁，诉讼。
 
 协商是解决争议最常见也是最有效的方式，也是首选的最基本的方式。
 
 DAB和DRB既不是调解也不是诉讼，是国际工程解决争议的特殊方式
 
 1.协商
 
     最常见、最有效、最基本、首选。
     协商是解决争议最常见也是最有效的方式，也是首选的最基本的方式。

 
 3.仲裁
 
     我国，实行一裁终局制。
     国际上，合同中约定是否一裁终局。
 
     特点:效率高、周期短、费用少、保密性、专业化。
 
 4. DAB(争端裁决委员会)方式——FIDIC中采用【每年都考】
 
     (1)DAB的任命
 
         由【一人、三人或五人】组成，有三种方式:
         1)常任争端裁决委员会，在施工前任命;
         2)特聘争端裁决委员会，发生争端时任命，【一名或三名】，发出最终决定时期满;
         3)由工程师兼任。
 
     (2)DAB的报酬
 
         业主和承包商各支付一半。
 
     (3)DAB的优点
 
         1)可以在项目开始时就介入;
         2)公正性、中立性，具有丰富施工经验;
         3)周期短;
         4)费用低;
         5)发包和承包自己选择，意见容易接受;
         6)不强制，不终局。(28天内，仍可仲裁诉讼)
 
 */
#pragma mark - ****************************************************************** 1Z207000 建设工程项目信息管理 3
/*

 
 */
#pragma mark  ******************************** 1Z207010 建设工程项目信息管理的目的和任务

/*
 
 
 */
#pragma mark 1Z207011 项目信息管理的目的

/*
 
 我国建设工程项目管理中当前最薄弱的工作领域是信息管理。
 
 项目信息管理的目的旨在通过有效的项目信息传输的组织和控制为【项目建设增值】服务。
 
*/
#pragma mark 1Z207012 项目信息管理的任务

/*
 1. 信息管理手册
 
     项目参建的各方都应编制各自的信息管理手册。
 
     信息管理手册的主要内容:(12条)
         任务、分工、分类、编码、模型、流程、工作平台使用规定、报表、报告、档案管理、保密制度。
 
     主要内容:
     (1)信息管理的任务(信息管理任务目录);
     (2)信息管理的任务分工表和管理职能分工表;
     (3)信息的分类;
     (4)信息的编码体系和编码;
     (5)信息输入输出模型;
     (6)各项信息管理工作的工作流程图;
     (7)信息流程图;
     (8)信息处理的工作平台及其使用规定;
     (9)各种报表和报告的格式，以及报告周期;
     (10)项目进展的月度报告、季度报告、年度报告和工程总报告的内容及其编制;
     (11)工程档案管理制度;
     (12)信息管理保密制度。
 
 2. 信息管理部门的工作任务
 
     (1)编制信息管理手册，并进行必要的修改和补充;
     (2)协调和组织各工作部门的信息处理工作;
     (3)工作平台的建立和运行维护;
     (4)协同组织收集、处理信息和形成报表和报告;
     (5)档案管理。
 
 信息工作流程和信息处理平台：
 
 3. 信息工作流程
 
     (建设工程项目信息管理中，为形成各类报表和报告，收集、录入、审核、 加工、传输、发布信息。
 
     (1)信息管理手册编制和修订的工作流程;
     (2)收集信息、录入信息、审核信息、加工信息、信息传输和发布的工作流程;
     (3)工程档案管理的工作流程。
 
 4. 基于互联网的信息处理平台
 
     信息管理的核心手段:基于互联网的信息处理平台。
 
*/
#pragma mark  ******************************** 1Z207020 建设工程项目信息的分类、 编码和处理方法

/*
 
 */
#pragma mark  1Z207021 项目信息的分类

/*

 1.建设工程项目信息分类:
 
     (1)按工作对象分; 子项目1、2、3
     (2)按工作过程分;设计准备、设计、招标、施工;
     (3)按工作任务分;三控三管;
 
     (4)按内容属性分，如组织、管理、经济、技术、法规类信息。
 
         如组织类信息 ： 编码控制信息、...组织信息
         管理类信息 ： 进度控制信息、...管理信息
         经济类信息 ： 工作量控制信息、...经济信息
         技术类信息 ：质量控制信息
         法规类信息
 
     综合分类，即按多维分类:第一维按项目结构，第二维按工作过程，第三维按工作任务
 
*/
#pragma mark 1Z207022 项目信息编码的方法

/*
 
 一、服务于各种用途的信息编码
 
     (1)项目结构编码，依据项目结构图。
     (2)组织结构编码，依据组织结构图。
     (4)项目实施的工作项编码，应覆盖项目实施的工作任务目录的全部内容。【不是项目施工全过程  必须是实施】
     (5)项目投资项编码(业主方)/成本项编码 (施工方)，【并不是概预算定额确定的分部分项工程编码】，应综合考虑 概算、预算、标底、合同价和工程款支付等因素，建立统一的编码，服务于投资目标的动态控制。
     (6)项目进度项编码，应综合考虑不同层次、 不同深度和不同用途的进度计划工作项的需要，【建立统一的编码】，服务于进度目标的动态控制。
     (8)合同编码，应参考项目的合同结构、分类，应反映【合同类型、项目结构和合同签订时间】。
     (10)工程档案编码，应根据【档案规定、项目特点和实施单位需求】等建立。
 
     需要进行编码组合。
 
*/

#pragma mark 1Z207023 项目信息处理的方法
/*
考点1:项目信息处理的方法
1. 基于网络的信息处理平台由一系列硬件和软件 构成。
2. 通过基于互联网的项目专用网站或项目信息门 户，实现业主方内部、业主方和项目参与各方，以及 项目参与各方之间的信息交流、协同工作和文档管理。
 
 */
#pragma mark  ********************************  1Z207030 建设工程管理信息化及建设工程项目管理信息系统的功能

/*
 
 */
#pragma mark  1Z207031 工程管理信息化

/*

 一、含义
 
     《国家信息化发展战略纲要》，是规范和指导未来10年国家信息化发展的纲领性文件。
 
 二、意义
 
     工程管理信息化有利于提高项目的经济效益和社会效益，以达到为项目建设增值的目的。
 
     信息技术在工程管理中开发应用的意义:
     1)“存储相对集中”，有利于检索查询、版本统一、文档管理;
     2)“程序化”，有利于提高准确性、效率;
     3)“数字化和电子化”，抗干扰、保真和保密;
     4)“便捷”、“透明”、“扁平”，有利于信息交流、协同工作。
 
 三、项目信息门户
 
     项目信息门户PIP，是信息化的重要标志。【项目所有单位入口 项目各参与方】
 
     项目管理信息系统PMIS，用于项目的目标控制。 【项目】
 
     管理信息系统MIS，用于企业的人、财、物、产、供、销管理。 【企业】
 
     项目信息门户：
 
         项目信息门户是项目各参与方信息交流、共同工作、 共同使用和互动的管理工具。
 
     1. 项目信息门户类型:
             PSWS模式，专用门户;
             ASP模式， 公用门户(国际主流)。
 
     2. 项目信息门户实施条件:
             (1)组织件;组织件最重要。
             (2)教育件;
             (3)软件;
             (4)硬件。
 
     3. 项目信息门户运行周期:全寿命期。
 
     4. 项目信息门户核心功能:信息交流、文档管理，共同工作。
 
     5. 项目信息门户主持者 :业主方、工程顾问公司
 
     对一个建设工程而言，业主方是总组织者 和总集成者，它自然就是项目信息门户的主持者，当然，它 也可以委托代表其利益的工程顾问公司作为项目信息门户的 主持者。
 
     建设工程的项目信息门户是基于互联网技术的 重要管理工具。可以作为一个建设工程服务的项目信息门户主持者的是业主方、工程顾问公司
 
 */
#pragma mark 1Z207032 工程项目管理信息系统的功能

/*
 一、项目管理信息系统的内涵 与P361结合学习
 
     项目管理信息系统主要用于项目的目标控制。
 
     项目管理信息系统是项目进展的跟踪控制系统，也是信息流的跟踪系统。
     项目管理信息系统可以在局域网或基于互联网的信息平台上运行。
 
 二、项目管理信息系统的功能——关键词 【连考3年】
     【不是管质量、安全】
     (1)投资控制——项目估算、概算、预算、标底、合同价、投资使用计划、实际投资、投入、投资
     (2)成本控制——投标估算、成本
     (3)进度控制——网络计划、关键工作、关键线路、横道图、【资源需求量】、进度
     (4)合同管理——合同查询、合同分析、合同起草（是起草 不是编写  也没有合同结构选择）
 
 */
