#pragma mark - ****************************************************************** 1Z101000 工程经济 (26个考点) 【 84页，22~24分】

#pragma mark  ******************************* 1Z101010 8.资金时间价值的计算及应用

 
#pragma mark  *********** 1Z101011 利息的计算

/*
 
 */
 #pragma mark 知识点:资金时间价值的概念
/*
一、资金时间价值的概念
 
    资金是运动的价值，资金的价值是随时间变化而变化的，是时间的函数，随时间的推移而增值，其增值的这部分资金就是原有资金的时间价值。
 
    实质是资金作为生产经营要素，在扩大再生产及其资金流通过程中，资金随时间周转使用的结果。
 
 二、影响资金时间价值的因素
 
     1.资金的使用时间;
     2.资金数量的多少;
     3.资金投入和回收的特点;
     ( 投资越晚越好，回收越早越好;晚支出，早回收)
     4.资金周转的速度。
 
 */
#pragma mark 知识点:利息与利率的概念
/*
 
 
 (一)利息
 
     概念:在借贷过程中，债务人支付给债权人超过原借贷金额的部分就是利息。(I=F-P)
 
     本质:由贷款发生利润的一种再分配。
 
     利息常常被看成是资金的一种机会成本(资金有多种用途，采取一种使用方式必然意味着放弃其他的使用方式，被放弃的方式中所能带来的最大收益即为所采取方式的机会成本)。
 
     利息是指占用资金所付的代价或者是放弃使用资金所得的补偿。
 
 (二)利率
 
     概念:单位时间内所得利息额与原借贷金额之比，通常用百分数表示。
     【年利率、月利率】
 
     i = It / P×100%
 
     【例】某公司现借得本金1000万元，一年后付息80万元， 则年利率为:(80/100)×100%=8%
         若一个季度付息80万元，则季度利率为8%;
         若一个月付息80万元，则月利率为8%。
 
 
 (三)影响利率高低的因素
 
     1 社会平均利润率。
 
         利率的高低首先取决于社会平均利润率的高低， 并随之变动。
 
         社会平均利润率是利率的最高界限。
 
     2 供求状况。
 
         借贷资本供过于求，利率下降;供小于求，利率上升。
 
     3 风险。
 
         借出资本风险越大，利率越高。
 
     4 通货膨胀。
 
         概念:市场流通中的货币数量超过经济实际需要而引起的货币贬值和价格水平全面而持续的上涨。
 
         资金贬值往往会使利息成为负值，因此银行要上调利率。
 
     5 借出资本的期限长短。
 
         期限越长，不可预见的因素就越多，风险就越大，利率就越高。

 */
#pragma mark 知识点:利息的计算
/*
 
 
 (一)单利计息:
 
     利不生利，仅用最初本金计算利息。
 
     利息 It = P 本金 × i 利率
     总利息 In = n × It
     本息额 F = P + In = P(1+n×i)
 
     在以单利计息的情况下，总利息与本金、利率以及计息周期数成正比关系。
 
     弊端:没有反映资金随时都在“增值”的概念，即没有完全反映资金的时间价值。
 
     因此，在工程经济分析中单利使用较少，通常只适用于短期投资或短期贷款。
 

 (二)复利计息:
 
     利生利，利滚利
 
     同一笔借款，在利率和计息周期均相同的情况下，用复利计算出的利息金额比用单利计算出的利息金额多。
 
     注:
         1)本金越大，利率越高，计息周期越多时，两者差距就越大。
         2)在工程经济分析中，一般采用复利计算。
         3)复利计算有间断复利和连续复利之分。
             按期(年、半年、季、月、周、日)计算复利的方法称为间断复利(即普通复利);
             按瞬时计算复利的方法称为连续复利。
             在实际使用中都采用间断复利。
 
 
 */
#pragma mark  知识点:现金流量图的绘制
/*
 
 
 (一)现金流量
 
     概念:在进行工程经济分析时，可把考查的技术方案视为一个系统。
     流出系统的资金称为现金流出，
     流入系统的资金称为现金流入。
     现金流入与现金流出之差称为净现金流量。
 
 (二)现金流量图
 
     概念:是一种反映技术方案资金运动状态的图示，即把技术方案的现金流量绘入一时间坐标图中，表示出各现金流入、流出与相应时间的对应关系。
 
 (三)现金流量图的作图方法和规则
 
     1.以横轴为时间轴，向右延伸表示时间的延续，轴上每一刻度表示一个时间单位，可取年、半年、季或月等;时间轴上的点称为 时点，通常表示的是该时间单位末的时点;0表示时间序列的起点。
 
     2.相对于时间坐标的垂直箭线代表不同时点的现金流量情况， 现金流量的性质(流入或流出)是对特定的人而言的。对投资人 而言，在横轴上方的箭线表示现金流入，即表示收益;在横轴 下方的箭线表示现金流出，即表示费用。
 
     3.在现金流量图中，箭线长短与现金流量数值大小本应成比例。
         但由于技术方案中各时点现金流量常常差额悬殊而无法成比例 绘出， 故在现金流量图绘制中，箭线长短只要能适当体现各时点 现金流量数值的差异，并在各箭线上方(或下方)注明其现金流量 的数值即可。
 
     4.箭线与时间轴的交点即为现金流量发生的时点。
 
     总之，要正确绘制现金流量图，必须把握好现金流量的三要素，即:现金流量的大小(现金流量数额)、方向(现金流入或现金流出)和作用点(现金流量发生的时点)。
 
 【训练题】关于现金流量绘图规则的说法，正确的有( )。
 A.箭线长短要能适当体现各时点现金流量数值大小的差异   B.箭线与时间轴的交点表示现金流量发生的时点   C.横轴是时间轴，向右延伸表示时间的延续   D.现金流量的性质对不同的人而言是相同的   E.时间轴上的点通常表示该时间单位的起始时点
 【答案】ABC
 
 【训练题】某企业计划年初投资200万元购置新设备以增加产量， 已知设备可以使用6年，每年增加产品销售收入60万元，增加经营 成本20万元，设备报废时残值10万元，对此项投资活动绘制现金 流量图，则第6年的净现金流量可以表示为()。
 A.向上的现金流量，数值为50万元 B.向下的现金流量，数值为30万元 C.向上的现金流量，数值为30万元 D.向下的现金流量，数值为50万元
 【答案】A 【解析】
 
 */
 #pragma mark  *********** 1Z101012 资金等值计算及应用
 
 /*
 
 */
#pragma mark 知识点:资金等值计算
/*
 
 (一)资金等值的概念
 
     不同时期、不同数额但其“价值等效”的资金称为等值，又叫等效值。
     ★ 如果两个现金流量等值，则对任何时刻的价值必然相等 。
     ★ 即使金额相同的资金，因其发生在不同时间，其价值就不相同。
     ★ 影响资金等值的因素有三个:资金金额的多少、资金发生时间的长短、利率(或折现率)的大小。其中利率是一个关键因素，一般等值计算中是以同一利率为依据的。
 
 【训练题】考虑资金时间价值，两笔资金不能等值的情形有( ) 。
 A.金额相等，发生在相同时点
 B.金额不等，发生在不同时点 C.金额不等，但分别发生在期初和期末 D.金额相等，发生在不同时点
 【答案】D
 
 
 (二)终值和现值计算
 
     1.一次支付现金流量的终值计算
            公式: F=P(1+i)n
         式中 (1+i)n 称之为一次支付终值系数，用(F/P，i，n)表示， 故计算公式又可写成:
            F=P(F/P，i，n)
 
          P:现值 F:终值 n:计息的期数  i:计息期复利率
 
         一次支付又称整存整付，是指所分析技术方案的现金流量，无论是流入或是流出，分别在各时点上只发生一次。
 
     2.一次支付现金流量的现值计算
 
            公式: P=F/(1+i)n=F(1+i)-n
 
         式中 (1+i)-n 称之为一次支付现值系数，用(P/F，i，n)表示， 故计算公式又可写成:
            P=F(P/F，i，n)
 
         计算现值P的过程叫“折现”或“贴现”，其所使用的利率常常 称为折现率或贴现率。
         故(1+i)-n 或(P/F，i，n)也可叫折现系数或贴现系数。
 
         一次支付现金流量的现值与终值的概念和计算方法正好相反，因为现值系数与终值系数互为倒数
 
         在工程经济分析中，现值比终值使用更为广泛。
         1.应注意正确选取折现率。
         2.要注意现金流量的分布情况。
             从收益的方面来看，获得的时间越早、数额越多，其现值也越大。因此，应使技术方案早日完成，早日实现生产能力，早获收益，多获收益，才能达到最佳效益。
             从投资方面看，在数额一定的情况下，投资支出的时间越晚、数额越少，其现值也越小。因此，应合理分配各年投资额，在不影响技术方案正常实施的前提下，尽量减少建设初期投资额，加大建设后期投资比重。
 
     3.等额支付系列现金流量的终值计算
 
         A:年金，发生在(或折算为) 某一特定时间序列各计算期末 (不包括零期)的等额资金序列 的价值。
 
         等额多次支付又称零存整付。
 
     4.等额支付系列现金流量的现值计算
 
 */
#pragma mark 知识点:资金等值计算的应用
/*
 
 等值计算公式使用注意事项:
 
 1.计算期数为时点或时标，本期末即等于下期初。
 
     0点就是 第一期初，也叫零期;第一期末即等于第二期初;余类推。
 
 2.P是在第一计息期开始时(0期)发生。
 
 3.F发生在考察期期末，即n期末。
 
 4.各期的等额支付A，发生在各期期末。
 
 5.当问题包括P与A时，系列的第一个A与P隔一期。即P发生在系列A的前一期。
 
 6.当问题包括A与F时，系列的最后一个A是与F同时发生。
     不能把A定在每期期初，因为公式的建立与它是不相符的。
 
 */
#pragma mark 知识点:名义利率的计算
/*
 
 在复利计算中，利率周期通常以年为单位，当计息周期小于一年时，就出现了名义利率和有效利率的概念。
 名义利率的概念:是指计息周期利率i乘以一年内的计息周期数m 所得到的年利率，用r表示年名义利率。
 计算公式:r=i×m
 若计息周期月利率为1%，则年名义利率为12%。
 名义利率的实质:计算名义利率时忽略了前面各期利息再生的 因素，这与单利的计算相同。通常所说的年利率都是名义利率。
 
 
 */
#pragma mark 知识点:有效利率的计算
/*
 
 有效利率的概念:是指资金在计息中所发生的实际利率。
 有效利率的形式:包括计息周期有效利率和年有效利率。
 1 计息周期有效利率的计算
     计息周期有效利率，即计息周期利率 i
     计算公式:i =r/m
 2 年有效利率的计算
    年有效利率，即年实际利率 ieff
    计算公式:ieff=(1+r/m)m-1
 
     年有效利率和名义利率的关系实质上与复利和单利的关系一样。
 
     每年计息期m越多，ieff与r相差越大。在工程经济分析中， 各技术方案的计息期不同，必须换算成有效利率进行评价。
 
 */
#pragma mark 知识点:计息周期小于(或等于)资金收付周期时的等值计算
/*
 
 当计息周期小于(或等于)资金收付周期时，等值计算的方法有:
 1 按计息周期利率计算
 2 按收付周期实际利率计算
 
 但应注意，对等额系列流量，只有计息周期与收付周期一致时才能按计息期利率计算。否则，只能用收付周期实际利率来计算。
 
 
 */
#pragma mark  ******************************* 1Z101020 7.技术方案经济效果评价
#pragma mark  ***********  1Z101021 经济效果评价的内容
#pragma mark 知识点:经济效果评价的基本内容
/*
 
 经济效果评价的概念:是采用科学的分析方法，对技术方案的财务可行性和经济合理性进行分析论证，为选择技术方案提供科学的决策依据。
 经济效果评价的内容:一般包括方案盈利能力、偿债能力、财务生存能力等评价内容。
 对于经营性方案，经济效果评价应分析拟定技术方案的盈利能力、偿债能力、财务生存能力。
 对于非经营性方案，经济效果评价应主要分析拟定技术方案的财务生存能力。
 
    内容                          定义                                          分析指标
 
 盈利能力        分析和测算技术方案计算期的盈利能力和盈利水平      方案财务内部收益率和财务净现值、资本金财务内部收益率、静态投资回收期、
                                                         总投资收益率和资本金 、净利润率等
 
 偿债能力       分析和判断财务主体的偿债能力                      利息备付率、偿债备付率和资产负债率等
 
财务生存能力      也称资金平衡能力，                           净现金流量和累计盈余资金 若累计盈余资金出现负值，应进行短期借款。
             分析技术方案是否有足够的净现金流量维持正常运营        短期借款应体现在财务 计划现金 流量表中，利息应计入财务费用。
 
 */

#pragma mark 知识点:经济效果评价方法
/*
 
 分类标准        具体类别                           备注
 
 基本方法       确定性评价和不确定性评价        同一技术方案必须同时进行
 性质          定量分析和定性分析             两者相结合，定量为主
 是否考虑时间    静态分析和动态分析            两者相结合，动态为主
 是否考虑融资    融资前分析和融资后分析         一般宜先进行融资前分析
 
 评价时间        事前评价、事中评价和事后评价    事前评价有一定的预测性，
                                         事中评价亦称跟踪评价，
                                         事后评价亦称后评价
 */
#pragma mark    知识点:经济效果评价的程序
/*
 (一)程序
 
     1.熟悉技术方案的基本情况
     2.收集、整理和计算有关技术经济基础数据资料与参数
     3.根据基础财务数据资料编制各基本财务报表
     4.经济效果评价
 
 (二)经济效果评价的具体步骤和分析指标
 
     1.首先进行融资前的盈利能力分析。
 
         不考虑融资方案，从技术方案投资总获利能力的角度，考察方案本身的合理性。
         编制技术方案投资现金流量表，计算技术方案投资内部收益率、净现值和静态投资回收期等指标。
         用于初步投资决策和方案的比选，是融资方案研究的依据和基础。
 
     2.如果第一步分析结论是“可行”的，那么进一步去寻求 适宜的 资金来源和融资方案，进行融资后分析。
         以融资前分析和初步的融资方案为基础，考察技术方案在拟定融资条件下的盈利能力、偿债能力和财务生存能力，判断技术方案在融资条件下的可行性。
         融资后分析用于比选融资方案，帮助投资者做出融资决策。融资后的盈利能力分析包括动态分析和静态分析。
 
         (1)动态分析包括下列两个层次:
             一是技术方案资本金现金流量分析。
                 分析在拟定的融资方案下，从技术方案资本金出资者整体的角度，计算资本金财务内部收益率指标，考察技术方案资本金可获得的收益水平。
             二是投资各方现金流量分析。
                 从投资各方实际收入和支出的角度， 计算投资各方的财务内部收益率指标，考察投资各方可能获得的收益 水平。
         (2)静态分析:依据利润与利润分配表计算技术方案资本金净利润率 和总投资收益率。
 
 */
#pragma mark 知识点:经济效果评价方案

/*
 
 (一)独立型方案
 
     概念: 技术方案间互不干扰、在经济上互不相关的技术方案。
     实质:是在“做”与“不做”之间进行选择。
     评价方法是“绝对经济效果检验”:在经济上是否可接受，取决于技术方案自身的经济性。
     方案可行的标准:技术方案经济指标达到或超过预定的评价标准或水平。
 
 (二)互斥型方案
 
     概念: 各个技术方案彼此可以相互代替，具有排他性。
     实质:选择其中任何一个技术方案，其他技术方案必然被排斥。
     评价方法包括两部分内容:
         一是考察各个技术方案自身的经济效果，即进行“绝对经济效果检验”;
         二是考察哪个技术方案相对 经济效果最优，即“相对经济效果检验”。
     选择方案的标准:不但最优而且可行。
 */
#pragma mark 知识点:技术方案的计算期
/*
 
 概念:技术方案的计算期是指在经济效果评价中为进行动态分析 所设定的期限，包括建设期和运营期。计算期不宜定得太长。
 (一)建设期
     是指技术方案从资金正式投入开始到技术方案建成投产为止所需要 的时间。
 (二)运营期
     运营期分为投产期和达产期两个阶段。
     1.投产期是指技术方案投入生产，但生产能力尚未完全达到设计 能力时的过渡阶段。
     2.达产期是指生产运营达到设计预期水平后的时间。
 
 */
#pragma mark  ***********  1Z101022 经济效果评价指标体系
/*
 
 经济效果评价:
 
     确定性分析
            盈利能力分析
                     静态分析
                            投资收益率
                                    总投资收益率
                                    资本金净利润率
                            静态投资回收期
                     动态分析
                            财务内部收益率
                            财务净现值
            偿债能力分析
                    利息备付率
                    偿债备付率
                    借款偿还期
                    资产负债率
                    流动比率
                    速动比率
 
     不确定性分析
            盈亏平衡分析
            敏感性分析
 */
#pragma mark    知识点:静态分析指标和动态分析指标
/*
 
 静态分析指标的最大特点是不考虑时间因素，计算简便。
 
 适用于:
 (1)对技术方案进行粗略评价;
 (2)对短期投资方案进行评价;
 (3)对逐年收益大致相等的技术方案进行评价。
 
 动态分析指标强调利用复利方法计算资金时间价值，更为客观。
 进行技术方案经济效果评价时，都应该采用。
 
 
 
 1.营业收入
 2.营业税金及附加
 3.总成本费用
         经营成本
                 外购原材料燃料动力费
                 工资及福利费
                 修理费
                 其他费用
         折旧费
         摊销费
         利息
 4.补贴收入
 5.利润总额 (1-2-3+4) ---- 税前利润
 6.弥补以前年度亏损
 
 7.应纳税所得额=利润总额-弥补以前年度亏损
 8.所得税=应纳税所得额 ×所得税率
 9.净利润=利润总额-所得税 ----税后利润
 
 
 息税前利润=利润总额+利息=净利润+所得税+利息
 净收益=息税前利润+折旧+摊销
 
 
 */

#pragma mark  *********** 1Z101023 投资收益率分析
#pragma mark 知识点:投资收益率
/*
 
 (一)概念
     投资收益率是衡量技术方案获利水平的评价指标，它是技术方案建成投产达到设计生产能力后一个正常生产年份的年净收益额与技术方案投资的比率。它表明在正常生产年份中，单位投资每年所创造的年净收益额。
     对生产期内各年的净收益额变化幅度较大的技术方案，可计算生产期年平均净收益额与技术方案投资的比率，其计算公式为:
 
      R = A/I * 100%
    公式中：
         R -- 投资收益率
         A -- 技术方案年净收益额或年平均净收益额
         I -- 技术方案投资
 
 (二)判别准则
     将投资收益率(R)与所确定的基准投资收益率(RC)进行比较。
     若R≥RC，则技术方案可以考虑接受;
     若R≤RC，则技术方案方案是不可行的。
 
 (三)应用式
 
     总投资收益率(ROI)表示总投资的盈利水平。
     计算公式为:
            ROI = EBIT / TI * 100%
    公式中：
            EBIT -- 技术方案正常年份的年息税前利润或运营期内年平均息税前利润
            TI -- 技术方案总投资（包括建设投资、建设期贷款利息和全部流动资金）
 
     总投资收益率是用来衡量整个技术方案的获利能力;应大于行业的平均投资收益率;总投资收益率越高，从技术方案所获得的收益越多。若总投资收益率高于同期银行利率，适度举债是有利的。
 
     资本金净利润率(ROE)表示技术方案资本金的盈利水平。
     计算公式为:
                ROE = NP / EC * 100%
            公式中：NP -- 技术方案正常年份的年净利润或运营期内年平均净利润，净利润=利润总额-所得说
                  EC -- 技术方案资本金
     资本金净利润率衡量技术方案资本金的获利能力。资本金净利润率越高，资本金所获得的利润就越多，权益投资盈利水平也就越高。若资本金净利润率高于同期银行利率，适度举债是有利的。
 
 (四)优劣
 
     优点:经济意义明确、直观，计算简便，在一定程度上反映了投资效果的优劣，可适用于各种投资规模。
 
     不足:1.忽略了资金的时间价值;
         2.主观随意性太强，正常生产年份选取较困难。
     因此，以投资收益率指标作为主要的决策依据不太可靠，其 主要用于技术方案制定的早期阶段或研究过程，且计算期较短、不具备综合分析所需详细资料的技术方案，尤其适用于工艺简单而生产情况变化不大的技术方案的选择和投资经济效果的评价。
 */
#pragma mark  *********** 1Z101024  投资回收期分析

 
 #pragma mark  知识点:投资回收期
 /*
  (一)概念
  
     也称返本期，是反映技术方案投资回收能力的重要指标。分为静态投资回收期和动态投资回收期。通常只进行技术方案静态投资回收期计算分析。
     静态投资回收期在不考虑资金时间价值的条件下，以技术方案的净收益回收其总投资(包括建设投资和流动资金)所需要的时间。静态投资回收期宜从技术方案建设开始年算起，若从技术方案投产开始年算起，应予以特别注明。
  
(二)应用式
  
      1.当技术方案实施后各年的净收益(即净现金流量)均相同时，
          计算公式为:
                   Pt = I / A
          公式： I -- 技术方案总投资
                A -- 技术方案每年的净收益 即 A = （CI - CO）t
  
      2.当技术方案实施后各年的净收益不相同时，静态投资回收期可根据累计净现金流量求得，也就是技术方案投资现金流量表中累计净现金流量由负值变为零的时点。
  
  (三)判别准则
  
      将计算出的静态投资回收期Pt与所确定的基准投资回收期Pc 进行比较。
      若静态投资回收期(Pt)≤ 基准投资回收期(Pc)，表明技术方案投资能在规定的时间内收回，则技术方案可以考虑接受; 若Pt≥Pc，技术方案是不可行的。
  
  (四)优劣
  
      优点:易理解，计算简便;反映了技术方案原始资本的补偿速度和技术方案投资风险性。资本周转速度越快，静态投资回收期越短， 风险越小，技术方案抗风险能力强。适合于技术更新迅速、资金短缺 或未来情况难以预测而投资者又特别关心资金补偿的情况。
      不足:没有全面考虑技术方案在整个计算期内的现金流量，只 考虑了回收之前的效果，没能反映资金回收之后的情况。所以，静态 投资回收期作为技术方案选择和技术方案排队的评价准则是不可靠的， 它只能作为辅助评价指标，或与其他评价指标结合应用。
  
 */

#pragma mark *********** 1Z101025 财务净现值分析

#pragma mark  知识点:财务净现值
/*
 
 (一)概念
 
     财务净现值(FNPV)是反映技术方案在计算期内盈利能力的动态评价指标。是用一个预定的基准收益率(或设定的折现率)ic， 分别把整个计算期间内各年所发生的净现金流量都折现到技术方案 开始实施时的现值之和。
 
     计算公式为:
 
 (二)判别准则
 
    财务净现值是评价技术方案盈利能力的绝对指标。
 
     当 FNPV>0，说明该技术方案除了满足基准收益率要求的盈利之外，还能得到超额收益，财务上可行;
     当 FNPV=0，说明该技术方案基本能满足基准收益率要求的盈利 水平，财务上可行;
     当 FNPV< 0 时，说明该技术方案不能满足基准收益率要求的盈 利水平，财务上不可行。
 
 (三)优劣
 
     优点:考虑资金的时间价值，并全面考虑了技术方案在整个计算期内现金流量的时间分布的状况;经济意义明确直观，能够直接以货币额表示技术方案的盈利水平;判断直观。
     不足:(1)基准收益率取值困难;(2)互斥方案比选时，不同 技术方案需要相同的计算期;(3)不能真正反映单位投资的使用 效率;(4)不能直接说明技术方案在运营期内各年的经营成果; (5)不能反映投资回收的速度。
 
 */

#pragma mark *********** 1Z101026 财务内部收益率分析

#pragma mark  知识点:财务内部收益率
/*
 (一)概念
 
     财务内部收益率(FIRR)也是反映技术方案在计算期内盈利能力的动态评价指标。对常规技术方案，财务内部收益率其实质就是在 计算期内，各年净现金流量的现值累计(FNPV)等于零时的折现率。
     对具有常规现金流量(在计算期内，开始时有支出而后才有收益，且方案的净现金流量序列的符号只改变一次的现金流量)的技术方案，其财务净现值的大小与折现率的高低有直接的关系。
 
 (二)判别准则
 
     财务内部收益率(FIRR)是评价技术方案盈利能力的相对指标。
     若 FIRR≥ic，则技术方案在经济上可以接受;
     若 FIRR< 0 ，则技术方案在经济上应予拒绝。
     技术方案投资财务内部收益率、资本金财务内部收益率和投资各方财务内部收益率可有不同的判别基准。
 
 (三)优劣
 
     优点:考虑了资金的时间价值以及技术方案在整个计算期内的经济状况，不仅能反映投资过程的收益程度，而且FIRR的大小不受 外部参数影响(而只需要知道基准收益率的大致范围即可)，完全取决于技术方案投资过程净现金流量系列的情况(由方案内部决定)。
     不足:计算麻烦;具有非常规现金流量的技术方案，其财务内部收益率在某些情况下甚至不存在或存在多个内部收益率。
 
 (四)FIRR与FNPV比较
 
     对于独立常规技术方案，两者的评价结论一致。
     FNPV指标计算简便，显示出了技术方案现金流量的时间分配，但 得不出投资过程收益程度大小，且受外部参数(i c)的影响。
     FIRR指标计算较为麻烦，但能反映投资过程的收益程度，而FIRR 的大小不受外部参数影响，完全取决于投资过程现金流量。
 
 */

#pragma mark *********** 1Z101027 基准收益率的确定

#pragma mark  知识点:基准收益率
/*
 
 (一)基准收益率的概念
 
     也称基准折现率，是企业或行业投资者以动态的观点所确定的、可接受的技术方案最低标准的收益水平。
     其在本质上体现了投资决策者对技术方案资金时间价值的判断和对技术方案风险程度的估计，它是评价和判断技术方案在财务上是否可行和技术方案比选的主要依据。
     基准收益率是一个重要的经济参数，根据不同角度编制的现金流量表，计算所需的基准收益率应有所不同。
 
 (二)基准收益率的测定
 
     1.政府投资项目，根据政府的政策导向进行确定;
     2.企业投资项目，结合行业特点、行业资本构成情况等因素综合
     测定;
     3.在中国境外投资的技术方案，应首先考虑国家风险因素测定;
     4.投资者自行测定技术方案的最低可接受财务收益率，除了考虑第2条的因素外，还应根据自身的发展战略和经营策略、技术方案的 特点与风险、资金成本、机会成本等因素综合测定。
 
         (1)资金成本。为取得资金使用权所支付的费用，主要包括 筹资费和资金的使用费。基准收益率最低限度不应小于资金成本。
         (2)机会成本。投资者将有限的资金用于拟实施技术方案而 放弃的其他投资机会所能获得的最大收益。基准收益率应不低于单位 资金成本和单位投资的机会成本。
         如果技术方案完全由企业自有资金投资时，可参考的行业平均收益水平，可以理解为一种资金的机会成本。如果技术方案投资资金来源于自有资金和贷款时，最低收益率不应低于行业平均收益率(或新筹集权益投资的资金成本)与贷款利率的加权平均值。
         (3)投资风险。风险越大，则风险补贴率越高。为了限制对风险 大、盈利低的技术方案进行投资，可以采取提高基准收益率的办法来 进行技术方案经济效果评价。
         (4)通货膨胀。通货膨胀率越大、物价指数变化率越大，则基准 收益率越大。
         若技术方案现金流量是按当年价格预测估算的，则应以年通货膨胀率修正基准收益率。若技术方案现金流量是按基年不变价格预测估算的，就不再重复考虑通货膨胀的影响去修正基准收益率。
 
     确定基准收益率的基础是资金成本和机会成本，而投资风险和通货膨胀是必须考虑的影响因素。
 */

#pragma mark *********** 1Z101028 偿债能力分析

#pragma mark  知识点:偿债能力分析

/*
 (一)偿债资金来源
 
     债务清偿能力评价，一定要分析债务资金的融资主体的清偿能力， 而不是“技术方案”的清偿能力。
     偿还贷款的资金来源主要包括可用于归还借款的利润(一般是提取了盈余公积金、公益金后的未分配利润)、固定资产折旧、无形资产及其他资产摊销费和其他还款资金来源(减免的营业税金)。
 
 (二)还款方式及还款顺序
 
     国外(含境外)借款的还款方式:需要按协议的要求计算出在规定的期限内每年需归还的本息总额。
     国内借款的还款方式:一般情况下，按照先贷先还、后贷后还，利息高的先还、利息低的后还的顺序归还。
 
 (三)偿债能力指标
 
     偿债能力指标主要有:借款偿还期、利息备付率、偿债备付率、资产负债率 (见1Z102062)、流动比率(见1Z102062)和速动 比率(见1Z102062)。
 
     1.借款偿还期
         概念:以可作为偿还贷款的收益(未分配利润、折旧、摊销费及其他收益)来偿还技术方案投资借款本金和利息所需要的时间。
         计算:可通过借款还本付息计算表推算，以年表示。
         判别准则:借款偿还期满足贷款机构的要求期限时，即认为技术方案是有借款偿债能力的。
         借款偿还期指标适用于那些不预先给定借款期限，且按最大偿还能力计算还本付息的技术方案。
 
     2.利息备付率
 
         概念:也称已获利息倍数，指在技术方案借款偿还期限内企业 各年可用于支付利息的息税前利润(EBIT)与当期应付利息(PI) 的比值。
         判别准则:利息备付率应分年计算，它从付息资金来源的充裕性 角度反映企业偿付利息的能力，表示企业使用息税前利润偿付利息的 保证倍率。正常情况下，应当大于1，并结合债权人的要求确定。 否则，表示技术方案的付息能力保障程度不足 。我国一般情况下， 不宜低于2。
 
     3.偿债备付率
         概念:在技术方案借款偿还期内，各年可用于还本付息的资金 (企业息税前利润+折旧+摊销-企业所得税)与当期应还本付息金额的比值。
         判别准则:偿债备付率应分年计算，它表示企业可用于还本付息的资金偿还借款本息的保证倍率。。正常情况下，应当大于1，并 结合债权人的要求确定。当指标小于1时，表示企业当年资金来源 不足以偿付当期债务，需要通过短期借款偿付已到期债务。我国 一般情况下，不宜低于1.3。
 
 
 */


#pragma mark  ******************************* 1Z101030 6.技术方案不确定性分析

#pragma mark *********** 1Z101031 不确定性分析

#pragma mark 知识点:不确定性分析
/*
 
 
 不确定性因素很多，在评价中，全面分析这些因素的变化对技术方案经济效果的影响十分困难，实际工作中，着重分析和把握那些对技术方案影响大的关键因素。
 
 对影响方案经济效果的不确定性因素进行的分析称为不确定性分析。
 
 不确定性分析是技术方案经济效果评价中一项重要工作，在拟实施技术方案未作出最终决策之前，均应进行技术方案不确定性分析。
 
 常用的不确定性分析方法有盈亏平衡分析和敏感性分析。
 
 */
#pragma mark ***********  1Z101032 盈亏平衡分析
#pragma mark 知识点:总成本与固定成本、可变成本
/*
 
 1.固定成本:在技术方案一定产量范围内，不随产品产量的增减 发生变化的各项成本费用。如:工资及福利费(计件工资 除外)、 折旧费、修理费、无形资产及其他资产摊销费、其他 费用等。为简化计算，利息也作为固定成本。
 
 2.可变成本:随技术方案产品产量的增减而成正比例变化的 各项成本。如:原材料、燃料、动力费，包装费和计件工资等。
 
 3.总成本:是固定成本与可变成本之和，它与产品产量的关系也可以近似地认为是线性关系。
 
 总成本=固定成本+可变成本
 
 */
#pragma mark 知识点:销售收入与营业税金及附加
/*
 
 1.销售收入:为简化计算，销售收入与销量呈线性关系。
 
 2.营业税金及附加:由于单位产品的营业税金及附加是随产品的 销售单价变化而变化的，为便于分析，将销售收入与营业税金及附加 合并考虑。
 
 经简化后，技术方案的销售收入是销量的线性函数。
 
 
 */
#pragma mark  知识点:量本利模型
/*
 
 量本利模型:是将利润、收入(是销量的线性函数)和成本的关系统一的数学模型。即:
 
    利润=收入(已扣减营业税金及附加)-成本
 
 为简化数学模型，对线性盈亏平衡分析做了如下假设:
 (1) 生产量等于销售量;
 (2) 产销量变化，单位可变成本不变，总成本是产销量的线性函数;
 (3) 产销量变化，销售单价不变，销售收入是产销量的线性函数;
 (4) 只生产单一产品;或者生产多种产品，但可以换算为单一产品计算，不同产品的生产负荷率的变化应保持一致。
 
 盈亏平衡分析:是通过计算技术方案达产年盈亏平衡点，分析技术方案成本与收入的平衡关系，判断技术方案对不确定因素导致产销量变化的适应能力和抗分险能力。
 
 技术方案的盈亏平衡点的表达方式有多种。可以用绝对值表示，也可以用相对值表示。其中以产销量和生产能力利用率表示的盈亏平衡点应用最为广泛。
 
 */
#pragma mark 知识点:产销量(工程量)盈亏平衡分析的方法
/*
 
 */


#pragma mark 知识点:生产能力利用率盈亏平衡分析的方法
/*
 
 */

#pragma mark 盈亏平衡分析的优缺点
/*
 
 
优点:盈亏平衡点反映了技术方案对市场变化的适应能力和抗风险 能力。盈亏平衡点越低，达到此点的盈亏平衡产销量就 越少，技术方案投产后盈利的可能性越大，适应市场变化的能力越强，抗风险能力也越强。
 
不足:盈亏平衡分析虽然能够从市场适应性方面说明技术方案风险的大小，但并不能揭示产生技术方案风险的根源。因此，还需采用其他方法来帮助达到这个目标。

 */
#pragma mark *********** 1Z101033 敏感性分析
#pragma mark 知识点:敏感性分析的内容
/*
 
 概念:敏感性分析就是在技术方案确定性分析的基础上，通过 进一步分析、预测技术方案主要不确定因素的变化对技术方案 经济 效果评价指标(如财务内部收益率、财务净现值等)的影响，从中 找出敏感因素，确定评价指标对该因素的敏感程度和技术方案对其 变化的承受能力。
 
 分类:敏感性分析有单因素敏感性分析和多因素敏感性分析两种。
 
 单因素敏感性分析:假设各个不确定性因索之间相互独立，每次只考察一个因素变动，其他因素保持不变，以分析这个可变因素对经济效果评价指标的影响程度和敏感程度。
 
 */

#pragma mark 知识点:单因素敏感性分析的步骤
/*
 (1) 确定分析指标 如果主要分析方案状态和参数变化对方案投资回收快慢的影响，
     选择静态投资回收期;如果主要分析产品价格波动对方案超额净收益 的影响，选择财务净现值;如果主要分析投资大小对方案 资金回收能力的影响，选择财务内部收益率。
 (2) 选择需要分析的不确定性因素
 (3) 分析每个不确定性因素的波动程度及其对分析指标可能 带来的增减变化情况
 (4) 确定敏感性因素
 (5) 选择方案
     如果进行敏感性分析的目的是对不同的技术方案进行选择，一般选择敏感程度小，承受风险能力强，可靠性大的方案。
 
 */


#pragma mark 知识点:计算敏感度系数确定敏感因素

/*
 
 敏感度系数表示技术方案经济效果评价指标对不确定性因素的敏感程度。
 计算公式为:
            S (AF) = △A/A   / △F/F
 公式中： SAF—敏感度系数
         ΔA/A--不确定性F发生ΔF变化时，评价指标A的相应变化率(%)
        ΔF/F —不确定性因素F的变化率(%)
 
 计算敏感度系数判别敏感因素的方法是一种相对测定法。
 敏感度系数SAF>0，表明评价指标与不确定因素同方向变化;
 敏感度系数SAF<0，表明评价指标与不确定因素反方向变化。
 |SAF|越大，表明评价指标A对不确定因素F越敏感。
 
 */

#pragma mark 知识点:计算临界点确定敏感因素

/*
 
 临界点:是指技术方案允许不确定因素向不利方向变化的极限值。超过极限，技术方案的经济效果指标将不可行。
 利用临界点判别敏感因素的方法是一种绝对测定法。
 
 
 图 1Z101033-1 单因素敏感性分析示意图
 
 每条直线的斜率等于SAF(直线越平缓表示抗风险能力越强);
 斜率越大越敏感;与横轴交点到原点的距离越短越敏感。
 直线与横轴的交点代表临界点(临界点绝对值越大表示抗风险能力越强)。
 
 
 */


#pragma mark 知识点:敏感性分析的优点与不足

/*
 优点:敏感性分析在一定程度上定量描述了不确定因素的变动对技术方案经济效果的影响，有助于搞清技术方案对不确定因素的不利变动所能容许的风险程度，有助于鉴别何者是敏感因素，从而能够及早排除对那些无足轻重的变动因素的注意力。
 
 不足:敏感性分析也有其局限性，它主要依靠分析人员凭借主观经验来分析判断，难免存在片面性。另外在技术方案的计算期内，各不确定性因素相应发生变动幅度的概率不会相同，而敏感性分析在分析某一因素的变动时，并不能说明不确定因素发生变动的可能性是大还是小。对于此类问题，还要借助于概率分析等方法。
 
 */





#pragma mark  ******************************* 1Z101040 5.技术方案现金流量表的编制

#pragma mark *********** 1Z101041 技术方案现金流量表
#pragma mark 知识点:投资现金流量表
/*
 
 编制角度:是以技术方案为一独立系统进行设置的。
 
 内容:以技术方案建设所需的总投资作为计算基础，反映技术方案在整个计算期(包括建设期和生产运营期)内现金的流入和流出。
 
 计算的评价指标:技术方案投资财务内部收益率、财务净现值、财务净现值率和静态投资回收期等。
 
 作用:考察技术方案融资前的盈利能力，为各个方案进行比较建立共同的基础。
 
 注意: 表中的调整所得税根据息税前利润乘以所得税率计算。
 
 */
#pragma mark  知识点:资本金现金流量表

/*
 
 编制角度:是从技术方案权益投资人整体(即项目法人)角度进行设置的。
 
 内容:以技术方案资本金作为计算基础，把借款本金偿还和利息支出作为现金流出。
 
 计算的评价指标:资本金财务内部收益率。
 
 作用:反映在一定融资方案下投资者权益投资的获利能力，用以比选融资方案，为投资者投资决策、融资决策提供依据。
 
 */
#pragma mark 知识点:投资各方现金流量表

/*
 
 编制角度:是分别从技术方案各个投资者的角度进行设置的。
 
 内容:以投资者的出资额作为计算基础。
 
 计算的评价指标:投资各方财务内部收益率。
 
 作用:技术方案投资者中各方有股权之外的不对等的利益分配时，需要计算投资各方的财务内部收益率，以看出各方收益是否均衡，或其非均衡性是否在一个合理的水平，有助于促成技术方案投资各方在合作谈判中达成平等互利的协议。
 
 */
#pragma mark 知识点:财务计划现金流量表
/*
 
 财务计划现金流量表反映技术方案计算期各年的经营活动、投资活动以及筹资活动的现金流入和流出，用于计算累计盈余资金，分析技术方案的财务生存能力。
 
 财务可持续性应首先体现在有足够大的经营活动净现金流量， 这是财务可持续的基本条件;其次各年累计盈余资金不应出现负值 ，这是财务生存的必要条件。
 */

/*
 
      名称                    编制角度                          备注
 投资现金流量表              技术方案 总投资                   不体现偿还本金和利息
 资本金现金流量表            项目法人 资本金                    现金流出中包括偿还本金和利息
 投资各方现金流量表          各个投资者 出资额                  当投资和损益分配比例 不一致 时编制
 财务计划现金流量表          投资、融资及经营活动的现金流量        反映技术方案的财务生存能力
 
 */
#pragma mark ***********  1Z101042 技术方案现金流量表的构成要素

#pragma mark 知识点:营业收入
/*
 
 营业收入是指技术方案实施后各年销售产品或提供服务所获得的收入。是现金流量表中现金流入的主体。
 
 营业收入=产品销售量(或服务量)×产品单价(或服务单价)
 
 补贴收入包括先征后返的增值税、按销量或工作量等依据国家规定的补助定额计算并按期给予的定额补贴，以及属于财政扶持而给予的其他形式的补贴。
 */
#pragma mark 知识点:投资
/*
 
 投资是投资主体为了特定的目的，以达到预期收益价值的垫付行为。
 
 技术方案经济效果评价中的总投资是建设投资、建设期利息和流动资金之和。
 
 (一)建设投资
 
     概念:是指技术方案按拟定建设规模、产品方案、建设内容进行建设所需的投入。
 
     在技术方案建成后按有关规定建设投资中的各分项将分别形成固定资产、无形资产和其他资产。
 
 (二)建设期利息
 
     概念:筹措债务资金时在建设期内发生并按规定允许在投产后计入固定资产原值的利息，即资本化利息。
 
     分期建成投产的技术方案，应按各期投产时间分别停止借款费用的资本化，此后发生的借款利息应计入总成本费用。
 
 (三)流动资金
 
     概念:流动资金系指运营期内长期占用并周转使用的营运资金，不包括运营中需要的临时性营运资金(如短期借款)。
 
     流动资金的估算基础是经营成本和商业信用等，它是流动资产与流动负债的差额。即:
 
     流动资金=流动资产 - 流动负债
     流动资产=存货+现金+应收账款+预付账款
     流动负债=应付账款+预收账款
 
     为了简化计算，技术方案经济效果评价中流动资金可从投产第一年开始安排。
 
 (四)技术方案资本金
 
     特点:
     1.技术方案总投资中，由投资者认缴的出资额，对技术方案 来说是非债务性资金;
     2.技术方案权益投资者整体(即项目法人)不承担这部分资金的任何利息和债务;
     3.投资者可按其出资的比例 依法享有所有者权益，也可转让其出资，但一般不得以任何方式抽回。
 
     出资方式:可以是现金，也可以是实物、工业产权、非专利技术、土地使用权、资源开采权作价出资，但必须经过有资格的资产评估机构评估作价。以工业产权和非专利技术作价出资的比例一般不超过 技术方案资本金总额的20%(经特别批准，部分高新技术企业可以达到35%以上)。
 
 (五)技术方案资本金现金流量表中投资借款的处理
 
     从技术方案投资主体的角度看，技术方案投资借款是现金流入，但同时将借款用于技术方案投资则构成同一时点、相同数额的现金流出，二者相抵，对净现金流量的计算无影响。
 
     因此，在技术方案资本金现金流量表中投资只计技术方案资本金。
 
     应将借款本金的偿还及利息支付计入现金流出。
 
 (六)维持运营投资
 
     根据实际情况有两种处理方式:一种是予以资本化，即计入 固定资产原值;一种是费用化，列入年度总成本。
 
     维持运营投资是否能予资本化，取决于其是否能够为企业带来经济利益且该固定资产的成本是否能够可靠地计量。
 
     如果该投资投入后延长了固定资产的使用寿命，或者使产品 质量 实质性提高，或者成本实质性降低等，那么应予以资本化，即计入固定资产原值，并计提折旧。否则该投资只能费用化， 列入年度 总成本费用。
 
 
 */
#pragma mark 知识点:经营成本
/*
 
 (一)总成本
 
     总成本费用=外购原材料、燃料及动力费+工资及福利费+修理费 +其他费用 +折旧费+摊销费+财务费用(利息支出)
 
     其中，利息支出的估算包括长期借款利息、流动资金借款利息和短期借款利息三部分。
 
     其他费用包括其他制造费用、其他管理费用和其他营业费用这三项费用。
 
 (二)经营成本
 
     概念:是从技术方案本身考察的，在一定期间(通常为一年)内由于生产和销售产品及服务而实际发生的现金支出。
 
     计算公式:
     经营成本=总成本费用 - 折旧费 - 摊销费 - 利息支出
     经营成本=外购原材料、燃料及动力费+工资及福利费+修理费 +其他费用
 
     特点:经营成本与融资方案无关。它是工程经济分析中的专用术语， 用于技术方案财务评价的现金流量分析，作为技术方案现金 流量表中现金流出的主体部分。
 
 */
#pragma mark 知识点:税金
/*
 
 (一)增值税
 
     概念:是对在中国境内销售货物、加工修理修配劳务、服务、无形资产或不动产的单位和个人征收的税金。
     性质:是价外税，纳税人交税，最终由消费者负担。
 
     计算公式:
     应纳增值税额=销项税额-进项税额
     销项税额=不含税销售额×增值税税率
     不含税销售额=含税销售额÷(1+增值税税率)
     可以抵扣的进项税额=[(固定资产、无形资产、不动产净值)/(1+适用税率)]×适用税率
 
     当销项税额小于当期进项税额不足抵扣时，其不足部分可以结转下期继续抵扣。
 
 (二)消费税
 
     概念:是针对特定消费品征收的税金。
 
     计税方法:实行从价定率、从量定额，或者从价定率和从量定额复合的方法计税。
 
 (三)资源税
 
     概念:是国家对开采规定的矿产品或者生产盐的单位和个人 在 应税产品的销售或自用环节征收的税种。
 
     计税方法:根据资源不同分别实行从价定率和从量定额的方法计税。
 
 (四)土地增值税
 
     概念:是对有偿转让房地产取得的增值额征收的税种。
 
     计税方法:按四级超率累进税率计算。
 
 
 (五)附加税
 
     技术方案经济效果评价涉及的附加税主要包括:城市维护建设税和教育费附加、地方教育费附加。
 
     计税方法: 以增值税和消费税为税基乘以相应的税率计算。
 
     (1)城市维护建设税税率根据技术方案所在地不同有三个等级， 即:市区为7%;县城和镇为5%;市区、县城或镇以外为1%。
     (2)教育费附加率为3%。
     (3)地方教育附加率为2%。
 
 (六)关税
 
     概念:是以进出口的应税货物为纳税对象的税种。
 
     计税方法:进口货物关税以从价计征、从量计征或者国家规定的其他方式征收。我国仅对少数货物征收出口关税。
 
 (七)所得税
 
     概念:技术方案经济效果评价中的所得税是指企业所得税，是针对企业应纳所得税额征收的税种。
 
     计税方法:按有关税法扣除所得税前项目计算应纳所得税额，并采取适宜的税率计算。
 
 */



#pragma mark  ******************************* 1Z101050 1.设备更新分析
#pragma mark ***********  1Z101051 设备磨损与补偿
#pragma mark 知识点:设备磨损的类型
/*
 
 (一)有形磨损(又称物质磨损)
 
     种类                  概念                                  结果
     第一种    设备在使用过程中，在外力的作用下                两种有形磨损都造成
              产生的实体磨损。这种磨损的程度与                设备的性能、精度等的
              使用强度和使用时间长短有关                     降低，使得设备的运行
                                                        费用和维修费用增加，
     第二种    设备在闲置过程中受自然力的作用而                效率低下，反映了设备
             产生的实体磨损，这种磨损的与闲置                 使用价值的降低。
             的时间长短和 所处的环境有关 。
             如金属件 生锈、腐蚀、橡胶件老化等。
 
 (二)无形磨损(又称精神磨损、经济磨损)
 
  种类                概念                          结果
 第一种        由于技术进步，同类             现有设备原始价值部分贬值，设备本身的
              设备的再生产价值降              技术特性和功能即使用价值并未发生变化，
              低，设备的市场价格              不会影响现有设备的使用。不产生提前更换
              也降低了。                     现有设备的问题。
 
 第二种        由于技术进步，出现            不仅使原有设备价值降低，而且技术更先进
              更先进的新型设备。            的新设备的发明和应用会使原有设备的使用
                                        价值局部或全部丧失，这就产生了是否用
                                        新设备代替现有 陈旧落后设备的问题。

 (三)设备的综合磨损
 
     概念:是指同时存在有形磨损和无形磨损的损坏和贬值的综合情况。
 
     对任何特定的设备来说，这两种磨损必然同时发生和同时互相影响。
 
 
 */
#pragma mark 知识点:设备磨损的补偿方式
/*
 
 方式:分为局部补偿和完全补偿。
 
 设备有形磨损的局部补偿是修理，设备无形磨损的局部补偿是现代化改装。设备有形磨损和无形磨损的完全补偿是更新。
 
 设备磨损形式:
    可消除性的有形磨损（可以修理、更新）
    不可消除性的有形磨损 （更新）
    第二种：无形磨损（现代化改装、更新）
 */
#pragma mark *********** 1Z101052 设备更新方案的比选原则
#pragma mark 知识点:设备更新的概念
/*
 
 概念:设备更新是对旧设备的整体更换。
 
 分类:原型设备更新和新型设备更新。
 
 原型设备更新:是简单更新，就是用结构相同的新设备去更换有形磨损严重而不能继续使用的旧设备。主要解决设备的损坏问题，不具有更新技术的性质。
 
 新型设备更新:是以结构更先进、技术更完善、效率更高、 性能更好、能源和原材料消耗更少的新型设备来替换那些技术上 陈旧、 在经济上不宜继续使用的旧设备。
 
 通常所说的设备更新主要指新型设备更新，它是技术发展的 基础。就实物形态而言，设备更新是用新的设备替换陈旧落后的设备 ;就 价值形态而言，设备更新是设备在运动中消耗掉的价值的重新 补偿。
 */
#pragma mark 知识点:设备更新策略
/*
 
 通常优先考虑更新的设备是:
 (1) 设备损耗严重，大修后性能、精度仍不能满足规定工艺要求的;
 (2) 设备耗损虽在允许范围之内，但技术已经陈旧落后，能耗高、使用操作条件不好、对环境污染严重，技术经济效果很不好的;
 (3) 设备役龄长，大修虽然能恢复精度，但经济效果上不如更新的。
 
 */
#pragma mark 知识点:设备更新方案的比选原则

/*
 
 1.站在客观的立场分析
 
     设备更新的要点是站在客观的立场上，不是站在旧设备的立场上分析问题。若要保留旧设备，首先要付出相当于旧设备当前市场价值的投资，才能取得旧设备的使用权。
 
 2.不考虑沉没成本
 
    沉没成本是既有企业过去投资决策发生的、非现在决策能改变(或不受现在决策影响)、已经计入过去投资费用回收计划的费用。在进行设备更新方案比选时，原设备的价值应按目前实际价值计算，而不考虑其沉没成本。
        沉没成本=设备账面价值-当前市场价值
     或: 沉没成本 =(设备原值-历年折旧费)-当前市场价值
 
 3.逐年滚动比较
 
     是指在确定最佳更新时机时，应首先计算比较现有设备的剩余经济寿命和新设备的经济寿命，然后利用逐年滚动计算方法比较。
 
 */


#pragma mark *********** 1Z101053 设备更新方案的比选方法
#pragma mark 知识点:设备寿命的概念
/*
 
 自然寿命 (物质寿命)  设备从投入使用开始，直到因物质磨损严重而不能继续使用、报废为止所经历的全部时间，主要是由设备的有形磨损所决定的。不能成为设备更新的估算依据。
 技术寿命(有效寿命)   设备从投入使用到因技术落后而被淘汰所延续的时间，也即是指设备在市场上维持其价值的时间，故又称有效寿命。一般比自然寿命短，主要是无形磨损造成。
 经济寿命           设备从投入使用开始，到继续使用在经济上不合理而被更新所经历的时间。由有形磨损和无形磨损共同决定。
 
 设备年度费用曲线
 
 设备从开始使用到其年平均使用成本最小(或年盈利最高)的 使用年限N0年是设备的经济寿命，也就是从经济观点(即成本观点或收益观点)确定的设备更新的最佳时刻。
 
 */
#pragma mark 知识点:设备经济寿命的估算
/*
 
 (一)设备经济寿命的确定原则
 
    1.使设备在经济寿命内平均每年净收益(纯利润)达到最大;
    2.使设备在经济寿命内一次性投资和各种经营费总和达到最小。
 
 (二)设备经济寿命的确定方法
 
    1.静态模式下，使设备年平均使用成本为最小的N0,就是设备的经济寿命。
 
     式中
     P——设备目前实际价值，如果是新设备包括购置费，如果是旧设备包括旧设备现在的市场价值和继续使用旧设备追加的投资;
     Ct——第t年的设备运行成本，包括人工费、材料费、能源费、 维修费、停工损失费、废次品损失等;
     LN——第N年末的设备净残值。
     第一项为设备的平均年度资产消耗成本，
     第二项为设备的平均年度运行成本。
 
    2.低劣化数值法
 
        如果设备的维护修理费用逐年递增量是均等的，即每年劣化呈线性增长，那么经济寿命的计算公式可简化为:
 
        式中
            N0——设备的经济寿命;
            λ——设备的低劣化值。
 

 
 
 */
#pragma mark 知识点:设备更新方案的比选

/*
 
 
 概念:就是对新设备方案和旧设备方案进行比较分析，也就是决定现在马上购置新设备、淘汰旧设备，还是至少保留使用旧设备一段时间，再用新设备替换旧设备。
 
 方法:一般情况要进行逐年比较。
 
 步骤:
 1.计算新旧设备不同使用年限的静态年平均使用成本和经济寿命。
 2.确定设备更新的时机。
 
 
 设备更新分析还应包括更新时机选择的问题:
 
 (1)如果旧设备继续使用1年的年平均使用成本低于新设备的年平均使用成本，即:
 
     此时，不更新旧设备，继续使用旧设备1年。
 
 (2)当新旧设备方案出现:旧设备继续使用1年的年平均使用成本大于新设备的年平均使用成本
 
     此时，应更新现有设备，这即是设备更新的时机。

 */


#pragma mark  ******************************* 1Z101060 2.设备租赁与购买方案的比选分析
#pragma mark *********** 1Z101061 设备租赁与购买的影响因素

#pragma mark 知识点:设备租赁的概念
/*
 
 概念:设备租赁是设备使用者(承租人)按照合同规定，按期向设备所有者(出租人)支付一定费用而取得设备使用权的一种经济活动。
 
 方式:融资租赁和经营租赁。
 
 融资租赁:租赁双方承担确定时期的租让和付费义务，而 不得 任意中止和取消租约，贵重的设备(如重型机械设备等)宜采用这种 方法。
 
 经营租赁:租赁双方的任何一方可以随时以一定方式在通知对方后的规定期限内取消或中止租约，临时使用的设备(如车辆、仪器等)通常采用这种方式。
 
 */

#pragma mark 知识点:设备租赁的优点与不足
/*
 
 1.设备租赁的优点(对于承租人而言)
     1. 在资金短缺的情况下,既可用较少资金获得生产急需的设备，也可以引进先进设备，加速技术进步的步伐;
     2.可获得良好的技术服务;
     3.可以保持资金的流动状态，防止呆滞，也不会使企业资产负债状况恶化;
     4.可避免通货膨胀和利率波动的冲击，减少投资风险;
     5.经营租赁设备租金可在所得税前扣除，能享受税费上的利益。
 
 2.设备租赁的不足(对于承租人而言)
     1.在租赁期间承租人对租用设备无所有权，只有使用权，故承租人无权随意对设备进行改造，不能处置设备，也不能用于担保、抵押贷款;
     2.承租人在租赁期间所交的租金总额一般比直接购置设备的费用要高 ;
     3.长年支付租金，形成长期负债;
     4.融资租赁合同规定严格，毁约要赔偿损失，罚款较多等。
 */


#pragma mark *********** 1Z101062 设备租赁与购买方案的比选分析
#pragma mark 知识点:设备租赁与购置方案分析的步骤
/*
 
 1.根据企业生产经营目标和技术状况，提出设备更新的投资建议。
 
 
 2.拟定若干设备投资、更新方案，包括:购置(一次性付款和 分期付款购买)方案和租赁方案。
 
 3.定性分析筛选方案，包括:分析企业财务能力，分析设备技术 风险、使用维修特点。
 
     (1)分析企业财务能力，如果企业不能一次筹集并支付全部设备 价款，则去掉一次付款购置方案。
     (2)对技术过时风险大、保养维护复杂、使用时间短的设备，可以 考虑经营租赁方案;对技术过时风险小、使用时间长的大型专用设备 则融资租赁方案或购置方案均是可以考虑的方式。
 
 4.定量分析并优选方案，结合其他因素，作出租赁还是购买的 投资决策。
 
 */

#pragma mark 知识点:设备租赁与购置方案的经济比选方法

/*
 
 (一)设备经营租赁方案的净现金流量
 
     净现金流量=营业收入-租赁费-经营成本-与营业相关的税金-所得税率×(营业收入-租赁费-经营成本-与营业相关的税金)
     式中，租赁费用主要包括:租赁保证金、租金、担保费。
 
     1.租赁费用的组成
 
         (1)租赁保证金:当租赁合同结束时，租赁保证金将被退还给承租人或在偿还最后一期租金时加以抵消。一般按合同金额的一定比例计，或是某一基期数的金额(如一个月的租金额)。
         (2)担保费:当承租人付不起租金时，由担保人代为支付租金。 一般情况下，承租人需要付给担保人一定数目的担保费。
         (3)租金:出租人从租金中获得补偿和收益;承租人比照租金 核算成本。租金的计算主要有附加率法和年金法。
 
     2.租金的计算方法
 
         (1)附加率法:在租赁资产的设备货价或概算成本上，加上一个 特定的比率来计算租金。每期租金R表达式为:
                R=P/N+P×i+P×r
         式中 P——租赁资产的价格;
            N——租赁期数，可按月、季、半年、年计;
            i——与租赁期数相对应的利率;
            r——附加率。
 
         (2)年金法:将一项租赁资产价值按动态等额分摊到未来各租赁 期间内的租金计算方法。
 
             年金法计算有期末支付和期初支付租金之分。
 
             1.期末支付方式是在每期期末等额支付租金。其支付方式的现金流量图
 
                 期末支付租金Ra的表达式为: Ra = P(A/P,i,n) = P ( i* (1+i)N次方 ) / ( (1+i)N次方 - 1 )
                 式中 Ra——每期期末支付的租金额;
                    P——租赁资产的价格;
                    N——租赁期数，可按月、季、半年、年计;
                    i——与租赁期数相对应的利率或折现率。
 
             2.期初支付方式是在每期期初等额支付租金。
 
                 其支付方式的现金流量 如下图所示:
 
                 期末支付租金Rb的表达式为:Rb=Ra/(1+i)
 
                 式中 Rb——每期期初支付的租金额;
                    Ra——每期期末支付的租金额;
                    i——与租赁期数相对应的利率或折现率。
 
 (二)购买设备方案的净现金流量
 
     净现金流量=营业收入-设备购置费-经营成本-贷款利息-与营业相关的税金-所得税率×(营业收入 -经营成本-折旧-贷款利息-与营业相关的税金)
 
 (三)设备租赁与购置设备方案的经济比选
 
         在工程经济互斥方案分析中，为了简化计算，常常只需比较它们之间的差异部分。
         设备租赁:所得税率×租赁费-租赁费
         设备购置:所得税率×(折旧+贷款利息)-设备购置费-贷款利息
 
         在充分考虑各种方式的税收优惠影响下，应该选择税后收益更大或税后成本更小的方案。
 */

#pragma mark  ******************************* 1Z101070 3.价值工程在工程建设中的应用
#pragma mark *********** 1Z101071 提高价值的途径
#pragma mark 知识点:价值工程的概念
/*
 
 (一)价值工程的含义
 
     价值工程是以提高产品(或作业)价值和有效利用资源为目的，通过有组织的创造性工作，寻求用最低的寿命周期成本，可靠地实现使用者所需功能，以获得最佳的综合效益的一种管理技术。
     公式为:
            V = F / C
 
     式中 V——价值;
         F——研究对象的功能，是指产品或作业的功用和用途;
         C——成本，即寿命周期成本。
 
     “价值工程中的价值”是指作为某种产品所具有的功能与获得该 功能的全部费用的比值。它不是对象的使用价值，也不是对象的交换 价值，而是对象的比较价值。
 
 (二)价值工程与其他管理技术的区别
 
     价值工程不同于一般的工业工程和全面质量管理技术。价值工程改变过去以物品或结构为中心的思考方法，从产品的功能出发，在设计过程中，重新审核图纸，对产品作设计改进，把与用户需求无关的构配件消除掉，更改具有过剩功能的材质和构配件，设计出价值更高的产品。
 
     价值工程与一般的投资决策理论也不同。价值工程是研究如何以最少的人力、物力、财力和时间获得必要功能的技术经济分析方法，强调的是产品的功能分析和功能改进。
 
     价值工程废弃了会计制度上沿用的事后成本和与产品费用无关的计算成本方法，采用以产品功能为中心分析成本的事前成本计算方法，保证了成本的正确可靠性。
 
 
 */

#pragma mark 知识点:价值工程的特点
/*
 
 (一)价值工程的目标是以最低的寿命周期成本，使产品具备它所必须具备的功能。
 
     产品的寿命周期成本C 由生产成本(即用户购买产品的费用) C1和使用及维护C2组成。
 
     在一定范围内，产品的生产成本与使用和维护成本存在此消彼长 的关系。随着产品功能提高，产品的生产成本C1增加，使用及维护 成本C2降低。
 
     产品功能与成本关系图
 
     在F0点，产品功能既能满足用户的需求，产品的生产成本C1 和使用及维护成本C2两条曲线叠加所对应的寿命周期成本为最小 值Cmin，体系了比较理想的功能与成本的关系。
 
 (二)价值工程的核心，是对产品进行功能分析
 
     价值工程分析产品，首先不是分析它的结构，而是分析它的功能，是在分析功能的基础之上，再去研究结构、材质等问题，以达到保证用户所需功能的同时降低成本，实现价值提高的目的。
 
     对于一个具体的产品来说，“它是干什么用的?”问题答案就是 产品的功能。
 
 (三)价值工程将产品价值、功能和成本作为一个整体同时来考虑
 
     价值工程并不是单纯追求低成本水平，也不片面追求高功能、多功能水平，而是力求正确处理好功能与成本的对立统一关系，提高它们之间的比值水平，研究产品功能和成本的最佳配置。因此，价值工程对价值、功能、成本的考虑，不是片面和孤立的，而是在确保产品功能的基础上综合考虑生产成本和使用及维护成本，兼顾生产者和用户的利益，创造出总体价值最高的产品。
 
 (四)价值工程强调不断改革和创新
 
     开拓新构思和新途径，获得新方案，创造新功能载体，从而简化产品结构，节约原材料，提高产品的技术经济效益。
 
 (五)价值工程要求将功能定量化
 
     即，将功能转化为能够与成本直接相比的量化值。
 
 (六)价值工程是以集体的智慧开展的有计划、有组织有领导的管理活动
 
     价值工程研究的问题涉及产品的整个寿命周期，涉及面广，研究过程复杂。这不能靠个别人员和个别部门，必须集中人才，以适当的组织形式组成一个智力结构合理的集体，共同研究，博采众长，有计划、有领导、有组织地开展活动，以达到提高方案价值的目的。
 
 */

#pragma mark 知识点:提高价值工程的途径
/*
 
 1.双向型:在提高产品功能的同时，又降低成本，这是提高价值 最为理想途径，也是对资源最有效利用。
 
     对生产者要求较高，往往要借助技术的突破和管理的改善才能 实现。例如:重庆轻轨项目，运用“墩梁并举”的技术与管理模式， 大幅缩短了工期;精度高质量好;降低了工程总造价;同时减少了 占用城市道路施工的时间，减少了堵车，既节省宝贵资源，又降低了 环境污染。
 
 2.改进型:在产品成本不变的条件下，通过改进设计，提高功能， 达到提高产品价值的目的。
 
     例如:人防工程，若在设计时，考虑战时能发挥隐蔽功能， 平时 能发挥多种功能，则可将人防工程平时利用为地下商场、地下 停车场 等。这些都大大提高了人防工程的功能，并增加了经济效益。
 
 3.节约型:在保持产品功能不变的条件下，通过降低成本达到提 高价值的目的。
 
     例如:某市一电影院，夏季气温高，需设计空调系统降温。经研究决定采用人防地道风降温系统替代机械制冷系统。在满足电影院空调要求的前提下，不仅降低了造价，而且节约了运行费和维修费。
 
 4.投资型:产品功能有较大提高，产品成本有较少提高。
 
     例如:电视塔，主要功能是发射电视和广播节目。若设计时，考虑 利用塔的高度，在塔的上部增加观景厅和旋转餐厅等，工程造价虽然 增加了一些，但功能大增，每年的游览收入显著增加，既可加快投资 回收，又可实现“以塔养塔”。
 
 5.牺牲型:在产品功能略有下降、 成本大幅度降低的情况下，也 可达到提高产品价值的目的。
 
     这是一种灵活的企业经营策略，去除一些用户不需要的功能，从而较大幅度地降低费用，能够更好地满足用户的需求。例如:老年人手机，在保证接听拨打电话这一基本功能的基础上，采用保留或增加大字体、大按键、大音量、一键求教、监护定位、助听等功能，减少办公、游戏、多媒体娱乐、数据应用等功能，整体生产成本大大下降了。在实际中，对这种牺牲型途径要持慎重态度。
 
     在产品形成的各个阶段都可以应用价值工程提高产品的价值，但在不同阶段应用价值工程，其经济效果的提高幅度却是大不相同的。

     对于建设工程，应用价值工程的重点是在规划和设计阶段，因为这两个阶段是提高技术方案经济效果的关键环节。
 
 */
#pragma mark *********** 1Z101072 价值工程在工程建设应用中的实施步骤
#pragma mark 知识点:价值工程的工作程序
/*
 
 工作阶段       设计程序                                 工作步骤                               对应问题
                                            基本步骤            详细步骤
 
 准备阶段       制定工作计划                 确定目标             1.工作对象选择             1.价值工程的研究对象是什么
                                                            2.信息资料搜集
 
 分析阶段       功能评价                    功能分析           3.功能定义                   2.这是干什么用的
                                                          4.功能整理
 
                                        功能评析           5.功能成本分析                 3.成本是多少
 
                                                         6.功能评价                     4.价值是多少
                                                        7.确定改进范围
 创新阶段       初步设计                    制定创新方案      8.方案创造                      5.有无其他方法实现同样功能
            评价各设计方案，改进、优化方案                    9.概略评价                      6.新方案的成本是多少
                                                        10.调整完善
                                                        11.详细评价
            方案书面化
                                                         12.提出方案                    7.新方案能满足功能的要求吗
 实施阶段   检查实施情况并评价活动成果   方案实施与成果评价        13.方案审批                    8.偏离目标了吗
                                                         14.方案实施与检查
                                                         15.成果评价
 
 */

#pragma mark 知识点:价值工程准备阶段
/*
 
 (一)对象选择
 
     价值工程的对象选择过程就是收缩研究范围的过程，最后明确分析研究的目标即主攻方向。
 
     一般来说，从设计、施工生产、市场和成本等方面考虑价值工程对象的选择。
 
     价值工程对象选择的方法有很多，常用的有因素分析法、ABC 分析法、强制确定法、百分比法、价值指数法等。
 
 (二)信息资料收集
 
     对于一般工程产品(或作业)分析来讲，应收集用户、市场、技术、经济、本企业、环境保护、外协、政府和社会有关部门的法规、条例等方面的信息资料。
 
     收集的信息资料要求准确可靠，并且要求经过归纳、分析、整理，剔除无效资料，使用有效资料，以利于价值工程活动的分析研究。
 
 */

#pragma mark 知识点:价值工程分析阶段
/*
 
 价值工程分析阶段主要工作是功能定义、功能整理与功能评价。
 
 (一)功能定义
 
     1.功能分类
 
         功能的分类不是功能分析的必要步骤，而是用以分辨确定各种功能的性质、关系和其重要的程度。可以说价值工程是以功能为中心，在可靠地实现必要的功能基础上来考虑降低产品成本的。
 
         分类标准                   内容                              具体表现
 
         功能的重要程度        基本功能和辅助功能          承重外墙的基本功能是承受荷载，室内间壁墙的基本功能是分隔空间。墙体的隔声、隔热就是墙体的辅助功能。
 
         功能的性质           使用功能和美学功能          住宅的使用功能是提供人们居住的空间，桥梁的使用功能是交通，美学功能是产品外观(造型、色彩，图案)等。
 
         用户的需求           必要功能和不必要功能        必要功能:使用功能、美学功能、基本功能、辅助功能
                                                    不必要功能:多余功能、重复功能、过剩功能
 
         功能的量化标准        过剩功能与不足功能         过剩功能:在数量上超过了用户要求或标准的功能
                                                    不足功能:整体功能或构配件功能在数量上低于标准
 
         总体与局部           总体功能和局部功能         二者是目的与手段的关系，局部功能是实现总体功能的基础，而总体功能又是产品各局部功能要达到的目的
 
         功能整理逻辑关系      并列功能和上下位功能        住宅保温、采光、通风等功能之间是并列关系，住宅的居住是上位功能，是目的，而通风是手段，是下位功能
 
     2.功能定义
 
         概念:根据收集到的信息资料，透过对象产品或构配件的物理特征 (或现象)，找出其效用或功用的本质东西，并逐项加以区分和 规定， 以简洁的语言描述出来。如采光、隔热。
 
         功能定义的目的是:
         (1) 明确对象产品和组成产品各构配件的功能，借以弄清产品的特性;
         (2) 便于进行功能评价，通过评价弄清哪些是价值低的功能和有问题的 功能，实现价值工程的目的;
         (3) 便于构思方案，定义功能的过程实际上也是为对象产品改进设计的 构思过程，为价值工程的方案创造工作阶段作了准备。
 
 (二)功能整理
 
     概念:用系统的观点将已经定义了的功能加以系统化，找出各局部功能相互之间的逻辑关系，并用图表形式表达，以明确产品的功能系统，从而为功能评价和方案构思提供依据。
 
 (三)功能评价
 
     概念:在功能定义和功能整理完成之后，在已定性确定问题的基础上进一步作定量的确定，即评定功能的价值。
 
     功能价值V的计算方法:功能成本法和功能指数法。
 
     下面仅介绍功能成本法。
 
     1.功能评价的程序
 
         价值工程的成本有两种:
         一种是现实成本，是指目前的实际成本;
         另一种是目标成本，是指实现功能的最低费用。
 
         功能评价就是找出目标成本，计算功能价值(是目标成本与功能现实成本的比值)，计算改善期望值(是功能现实成本与目标成本的差异值)，然后选择功能价值低、改善期望值大的功能作为价值工程活动的重点对象。
 
     2.功能现实成本的计算
 
         功能现实成本的计算是以对象的功能为单位，而传统的成本核算是以产品或构配件为单位。
 
         当一个构配件只有一个功能时，该构配件的成本就是它本身的功能成本;当一项功能要由多个构配件共同实现时，该功能的成本就等于这些构配件的成本之和;当一个构配件具有多项功能或同时与多项功能有关时，就需要将构配件成本分摊给各项有关功能。
 
     3.功能评价值F的计算
 
         对象的功能评价值F(目标成本)可以看成是企业预期的、理想 的成本目标值，常用功能重要性系数评价法计算。
 
     4.计算功能价值V，分析成本功能的合理匹配程度应用功能成本法计算功能价值V的表达式是:
 
            Vi = Fi / Ci
 
         式中 Vi——第i个评价对象的价值系数
             Fi——第i个评价对象的功能评价值(目标成本)
             Ci——第i个评价对象的现实成本
 
         功能的价值系数有以下结果:
 
         Vi=1，表示功能评价值等于功能现实成本，说明评价对象的 价值为最佳，一般无须改进。
 
         Vi<1，表明功能评价值小于功能现实成本，说明评价对象的现实成本偏高，而功能要求不高，一种可能就是功能存在过剩;另一种可能就是功能虽无过剩，但实现功能的条件或方法不佳，以致使实现功能的成本大于功能的实际需要。
 
         Vi>1，表明功能评价值大于功能现实成本，说明评对象的功能 比较重要，但分配的成本较少。应具体分析，可能功能与成本的分配 已较理想，或者有不必要的功能，或是应提高成本。
 
     5.确定价值工程对象的改进范围
 
         (1)Vi=Fi/Ci值低的功能
 
             Vi小于1的功能区域，基本上都应该予以改进， 特别是比1小的 较多的功能区域，力求使Vi=1。
 
         (2)成本降低期望值ΔCi=(Ci-Fi)值大的功能
 
             当n个功能区域的价值系数同样低时，就要优先选择ΔCi数值大的功能区域作为重点对象。
 
         (3)复杂的功能

             通常复杂的功能区域其价值系数也较低。
 
         (4)问题多的功能。
 
             越接近功能系统图的前端，功能改进就可以越大。
 
 */

#pragma mark 知识点:创新阶段
/*
 
 (一)方案创造
 
     概念:是从提高对象的功能价值出发，在正确的功能分析和评价的基础上，针对改进的具体目标，通过创造性的思维活动，提出能够可靠地实现必要功能的新方案。
 
     方案创造的理论依据是功能载体具有替代性。
 
     方案创造的方法有很多，如:头脑风暴法、哥顿法(模糊目标法)、专家意见法(德尔菲法)、专家检查法等。
 
 (二)方案评价
 
     概念:是在方案创造的基础上对若干个新构思的方案进行经济、技术、社会和环境效果等方面的评价，以便于选择最佳方案。
 
     方案评价分为概略评价和详细评价两个阶段。
 
     概略评价是对新构思方案进行初步研究，其目的是从众多的方案在进行粗略的筛选，以减少详细评价的工作量，使精力集中于优秀方案的评价。
 
     详细评价是对经过筛选后的少数方案再具体化，通过进一步的调查、研究和评价，最后选出最令人满意的方案。其评价结论是方案审批的依据。
 
     不论概略评价和详细评价都包括技术评价、经济评价、社会评价和环境评价四方面。
 
 评价方面       围绕范围                            评价内容                            备注
 技术评价        功能             方案能否实现所需功能以及实现程度(性能、质量、寿命等)        最后进行
 经济评价       经济效果                    以成本为代表的经济可行性                      综合评价，
 社会评价       社会效果                   方案对社会有利或有害的影响                       选出
 环境评价       环境效果                        方案对环境的影响                        最佳方案

 
 
  */


#pragma mark 知识点:价值工程实施阶段
/*
 
 通过综合评价选出的方案，送决策部门审批后便可实施。
 
 为了保证方案顺利实施，应做到组织落实、经费落实、物质落实和时间落实。
 
 在方案实施过程中，应该对方案的实施情况进行检查，发现问题及时解决。
 
 方案实施完成后，要进行总结评价和验收。
 
 */

#pragma mark  ******************************* 1Z101080 4.新技术、新工艺和新材料应用方案的技术经济分析方法
#pragma mark *********** 1Z101081 新技术、新工艺、新材料应用方案的选择原则
/*
 
 */
#pragma mark 知识点:技术上先进、可靠、适用、合理

/*
 
 选择先进、可靠、适用、合理的新技术方案可以取得多方面的效果。主要表现在:降低物质消耗，缩短工艺流程，提高劳动生产率，有利于保证和提高产品质量，提高自动化程度，有益于人身安全，减轻工人的劳动强度，减少污染、消除公害，有助于改善环境。同时，有利于缩小与国外先进水平的差距。
 */

#pragma mark 知识点:经济上合理
/*
 
     就是要综合考虑投资、成本、质量、工期、社会经济效益等因素，选择经济上合算的方案。
 
     一般地说，在保证功能和质量、不违反劳动安全与环境保护的原则下，经济合理应是选择新技术方案的主要原则。
 
 
 */
#pragma mark ***********  1Z101082 新技术、新工艺、新材料应用方案的技术分析
#pragma mark 知识点:新技术应用方案的技术经济分析方法分类
/*
 
 新技术应用方案技术经济分析方法的分类依据及类别如下表所示:
 
 分类依据               类别
 按照分析的时间    事前和事后的技术经济分析
 按照分析的阶段    设计阶段和施工阶段的技术经济分析
 按照分析的内容    技术分析、经济分析和综合分析
 按照分析的方法    定性分析和定量分析
 
 
 */

#pragma mark 知识点:新技术应用方案的技术分析
/*
 
 概念:是指对其方案的技术特性和条件指标进行对比与分析。
 
 反映技术特性的指标如，结构工程中混凝土工艺方案的技术性指标可用现浇混凝土强度、现浇工程总量、最大浇筑量等表示;安装 工程则可用安装“构件”总量、最大尺寸、最大重量、最大 安装 高度等表示。
 
 反映技术条件的指标可用:方案占地面积;所需的主要材料、 构配件等资源是否能保证供应;采用的方案对工程质量的保证程度， 对社会运输能力的要求及能否得到服务;采用的方案要求的技术复杂 程度和难易程度以及对技术准备工作的要求，施工的安全性; 采用 的方案对前道工序的要求和为后续工序创造的条件等表示。
 
 */
#pragma mark *********** 1Z101083 新技术、新工艺、新材料应用方案的经济分析
#pragma mark 知识点:增量投资收益率法
/*
 
 
 概念:增量投资所带来的经营成本(或生产成本)上的节约与增量投资之比。
 
 设I1、 I2分别为旧、新方案的投资额，C1、C2为旧、新方案的 经营成本(或生产成本)。
 如:I2>I1，C2<C1，则增量投资收益率R(2- 1)为:
 R（2-1） = (C1-C2) / (I2-I1)
 当R(2-1)大于或等于基准投资收益率时，表明投资额大的方案是可行 的; 当R(2-1)小于基准投资收益率时，表明投资额小的方案是可行的。
 
 */

#pragma mark 知识点:折算费用法
/*
 
 1.当方案有用成果相同时，一般可通过比较费用的大小，来决定优劣。
 
     (1)采用新方案需要增加投资时，可通过下式比较各方案折算费用的 大小选择方案，即:
 
            Zj = Cj + Pj*Rc
        公式中：
         Zj -- 第j方案的折算费用
         Cj -- 第j方案的生产成本
         Pj -- 用于第j方案的投资额（包括建设投资和流动资金）
         Rc -- 基准投资收益率
 
        在多方案比较时，可以选择折算费用最小的方案。
 
     (2)采用方案不增加投资时，可通过下式比较各方案生产成本的 大小选择方案，即:
 
            Zj = Cj = Cfj + CujQ
         公式中：
             Cfj --第j方案固定费用（固定成本）总额
             Cuj -- 第j方案单位产量的可变费用（可变成本）
             Q -- 生产的数量
 
         在多方案比较时，可以选择生产成本最小的方案。
 
 2.当方案的有用成果不相同时，一般可通过方案费用的比较来决定方案的使用范围，进而取舍方案。
     方法如下:
     (1)列出对比方案的生产成本
     (2)绘制生产成本与产量的关系曲线
     (3)计算临界点产量
     (4)选择相应的适宜方案
     实际产量小于临界点产量，选择固定成本较低的方案;
     实际产量大于临界点产量，选择固定成本较高的方案;
 */

#pragma mark 知识点:其他指标分析
/*
 
 
 1.劳动生产率指标
 2.缩短工期节约固定费用
 3.缩短工期的生产资金节约额
 4.缩短工期提前投产的经济效益
 
 */

#pragma mark - ****************************************************************** 1Z102000 工程财务(25个考点) 【 70页，22~25分】
#pragma mark  ******************************* 1Z102010 1.财务会计基础
#pragma mark *********** 1Z102011 财务会计的职能
#pragma mark 知识点:财务会计的内涵
/*
 
 内涵:对企业已经发生的交易或事项，通过确认、计量和报告程序进行加工处理，并借助以财务报表为主要内容的财务报告形式，向企业外部的利益关系集团提供以财务信息为主的经济信息。这种信息以货币作为主要计量尺度并结合文字说明来表达，反映了企业过去的资金运动或经济活动历史。
 
 会计信息的作用:是投资者和债权人作出合理决策的重要依据;是考评企业经营者经营企业资源的责任和绩效的依据;还是国家、政府部门进行宏观经济管理的重要信息来源。
 
 */

#pragma mark 知识点:财务会计的职能
/*
 
 1.核算职能
 
     从价值量方面反映企业已经发生或完成的客观经济活动情况。
 
 2.监督职能
 
     会计监督包括事前、事中和事后监督。
     财务会计的两项基本职能是核算和监督。二者是不可分割的。核算是基本的、首要的，核算是监督的前提和基础。会计监督是会计 核算的保证。现代会计的预测、决策、评价等职能是建立在 这两项 基本职能的基础之上的。
 
 */

#pragma mark *********** 1Z102012 会计核算的原则

#pragma mark 知识点:会计要素的计量属性
/*
 
 
 1.历史成本:资产按照购置时支付的现金或者现金等价物的金额， 或者按照购置资产时所付出的代价的公允价值计算;负债按照因承担 现时义务而实际收到的款项或合同金额计量。
 
 2.重置成本:资产按照现在购买相同或者相似资产所需支付的现金 或者现金等价物的金额计量。负债按照现在偿付该项债务所需支付的 现金或者现金等价物的金额计量。
 
 3.可变现净值:资产按照其现在正常对外销售所能收到现金或者 现金等价物的金额，扣减该资产至完工时估计要发生的成本、估计的 销售费用以及相关税费后的金额计量。
 
 4.现值:资产按照预计从其持续使用和最终处置中所产生的未来 净现金流入量的折现金额计量。负债按照预计期限内需要偿还的未来 净现金流出量的折现金额计量。
 
 5.公允价值:资产和负债按照市场参与者在计量日发生的有序交易 中，出售资产所能收到或者转移负债所需支付的价格计量。
 
 【注意】 企业在对会计要素进行计量时，一般应当采用历史成本。 采用其他会计要素计量属性计量时，应当保证所确定的会计要素金额 能够取得并可靠计量。
 */

#pragma mark 知识点:会计信息的质量要求
/*
 
 
 1.以实际发生的交易或者事项为依据进行会计确认、计量和报告， 保证会计信息真实可靠、内容完整。
 2.应当与财务会计报告使用者的经济决策需求相关。
 3.应当清晰明了。
 4.应当具有可比性。同一企业不同时期发生的相同或者类似的交易或者事项，应当采用一致的会计政策，不得随意变更。确需变更的，应当在会计报表附注中说明。
 5.应当按照交易或者事项的经济实质进行会计确认、计量和报告， 不应仅以交易或者事项的法律形式为依据。这是会计核算中实质重于 形式原则的要求。
 6.应当反映与企业财务状况、经营成果和现金流量等有关的所有 重要交易或者事项。
 7.不应高估资产或者收益、低估负债或者费用。
 8.对于已经发生的交易或者事项，应当及时进行会计确认、计量 和报告，不得提前或者延后。
 */


#pragma mark *********** 1Z102013 会计核算的基本前提
#pragma mark 知识点:会计核算的基本假设
/*
 
 
 1.会计主体假设:从空间上界定会计工作的具体核算范围，会计 主体不一定是法人。
 
 2.持续经营假设:假设企业将长期以现时的形式和目标不断经营 下去，即假定企业在可预见的未来不会面临破产和清算。
     该假设旨在解决企业的资产计价和费用分配等问题。
     企业会计确认、计量和报告应当以持续经营为前提。
 
 3.会计分期假设:规定了会计对象的时间界限。是指将企业连续 不断的经营活动分割为一个个连续的、间隔相等的若干较短时期， 以及时提供会计信息，是正确计算收入、费用和损益的前提。
    我国通常以日历年作为企业的会计年度，即以公历1月1日至12月 31日为一个会计年度。
 
 4.货币计量假设:规定了会计的计量手段，指出企业的生产经营 活动及其成果可以通过货币反映。
    我国通常选择人民币作为记账本位币。
 
 */
#pragma mark 知识点:会计核算的基础

/*
 
 1.收付实现制
 
    以相关货币收支时间为基础，以收到或支付的现金作为确认收入和费用等的依据。
 
 2.权责发生制
 
    凡是当期已经实现的收入和已经发生或应当负担的费用，无论款项是否收付，都作为当期的收入和费用，计入利润表。凡是不属于当期的收入和费用，即使款项已经收付，也不应作为当期的收入和费用。
 
    权责发生制以会计分期和持续经营为前提的会计基础。
 
    我国《企业会计准则》规定，企业应当以权责发生制为基础进行会计确认、计量和报告。
 */

#pragma mark *********** 1Z102014 会计要素的组成和会计等式的应用
#pragma mark 知识点:会计要素的组成
/*
 
 (一)资产
 
    概念:指企业过去的交易或事项所形成的，由企业所拥有或控制的、预期会给企业带来经济利益的资源。
 
     1.资产的特征
 
         (1)是现实中的资产而不是预期的资产。
         (2)该项资源必须为企业所拥有或控制。
         (3)该资源能给企业带来经济利益。
         (4)该资源的成本或价值能够可靠地计量。
 
     2.资产的分类
 
         (1)流动资产:可在一年内或超过一年的一个营业周期内变现、 耗用的资产。如现金、银行存款、应收账款、短期投资、存货等。
         (2)非流动资产(长期资产):指变现期间或使用寿命超过一年或 长于一年的一个营业周期的资产。包括长期投资、固定资产、无形 资产、 其他资产。
 
             1.长期投资:准备持有一年以上，不随时变现的股票、债券和其他 投资。
             2.固定资产:使用期限较长，单位价值较高，并且在使用过程中 保持原有实物形态的资产。如房屋建筑物、机器设备等。
             3.无形资产:指企业为生产商品或者提供劳务、出租给他人，或 为管理目的而持有的、没有实物形态的非货币性长期资产。如专利权、 商标权、土地使用权、非专利技术和商誉等。
             4.其他资产:除上述资产以外的资产，如长期待摊费用、银行冻结 财产、诉讼中的财产等。
 
 (二)负债
 
     概念:由于过去的交易或事项所形成的现时义务，履行该义务会导致经济利益流出企业。
 
     1.负债的特征
 
         (1)是指在现行条件下已承担的义务或者说经济责任，其清偿会导致经济利益流出企业。
         (2)是过去的交易或事项形成的。
         (3)流出的经济利益的金额能够可靠地计量。
         (4)有确切的债权人和偿还日期，或者债权人和偿还日期可以合理加以估计。
 
     2.负债的分类
 
         (1)流动负债:在一年内或超过一年的一个营业周期内偿还的 债务。如短期借款、应付款项、应付工资、应交税金等。
         (2)非流动负债(长期负债):在一年以上或超过一年的一个 营业周期以上偿还的债务。如应付债券、长期借款、长期应付款等。
 
 (三)所有者权益
 
    概念:是企业投资者对企业净资产的所有权，是企业资产扣除负债后由所有者享有的剩余权益。所有者权益表明了企业的产权关系，即企业归谁所有。
 
     1.所有者权益的特征
 
         (1)无须偿还。除非发生减资、清算，企业不需偿还所有者权益。
         (2)企业清算时，接受清偿在负债之后，所有者权益是对企业净资产的要求权。
         (3)可分享企业利润。所有者能凭借所有者权益参与利润的分配。
 
     2.所有者权益的内容
 
         (1)实收资本:所有者按出资比例实际投入到企业的资本。
         (2)资本公积:投资者投入但不构成实收资本，或从其他非收益 来源取得，由全体所有者共同享有的资金，包括资本溢价、资产评 估增值、接受捐赠、外币折算差额等。
         (3)盈余公积:按规定从企业的税后利润中提取的公积金。主要 用来弥补企业以前的亏损和转增资本。
         (4)未分配利润:本年度没有分配完的利润，可以留待下一年度 进行分配。
 
 (四)收入
 
     概念:是指企业在销售商品、提供劳务及他人使用本企业资产等日常经营活动中所形成的，会导致所有者权益增加的，与所有者投入资本无关的经济利益的总流入。包括主营业务收入和其他业务收入。
 
 (五)费用
 
     概念:是指企业在生产和销售商品、提供劳务等日常经济活动中所发生的，会导致所有者权益减少的，与向所有者分配利润无关的经济利益的总流出。
 
 (六)利润
 
     概念:是企业在一定会计期间的经营成果，包括收入减去费用后的净额以及直接计入当期利润的利得和损失等。通常反映利润的指标有两个，一是利润总额，二是净利润。
 
 资产、负债和所有者权益是反映企业某一时点财务状况的会计要素，称为静态会计要素。
 
 收入、费用和利润是反映某一时期经营成果的会计要素，称为动态会计要素。
 */
#pragma mark 知识点:会计等式的应用
/*
 
 1.静态会计等式的应用
 
     静态会计等式是反映企业在某一特定日期财务状况的会计等式，是由静态会计要素(资产、负债和所有者权益)组合而成。
 
    其公式为:“资产=负债+所有者权益”
 
     它表明了企业在某一特定时点所拥有的各种资产以及债权人和投资者对企业资产要求权的基本状况，表明企业所拥有的全部资产，都是由投资者和债权人提供的。
 
    静态会计等式是编制资产负债表的重要依据。
 
 2.动态会计等式的应用
 
     动态会计等式是反映企业在一定会计期间经营成果的会计等式，是由动态会计要素(收入、费用和利润)组合而成。
 
     其公式为:“收入-费用=利润”
 
     动态会计等式揭示了企业在某一特定期间的经营成果，也称财务成果等式，它是编制利润表的重要依据。
 
 
 在静态会计等式和动态会计等式的基础上，还可以组合成综合会计等式。
 
     其公式为:“资产=负债+(所有者权益+收入-费用)”
 
 它综合了企业利润分配前财务状况等式和经营成果等式之间的关系，揭示了企业财务状况与经营成果之间的相互联系。
 
 */

#pragma mark  ******************************* 1Z102020 2.成本与费用
#pragma mark ***********  1Z102021 费用与成本的关系

#pragma mark 知识点:费用的特点
/*
 
 概念:是指企业在生产和销售商品、提供劳务等日常经济活动中所发生的，会导致所有者权益减少的，与向所有者分配利润无关的经济利益的总流出。
 
 费用的特点:
 
     1.费用是企业日常活动发生的经济利益的流出，而不是偶发的。
 
     2.费用本质上是一种企业资源的流出，是资产的耗费，其目的是为了取得收入。
 
     3.费用将引起所有者权益的减少，但与向企业所有者分配利润时的支出无关。
 
     4.费用只包括本企业经济利益的流出，而不包括为第三方或客户代付的款项及偿还债务支出，并且经济利益的流出能够可靠计量。
 
 */

#pragma mark 知识点:费用和成本的区别和联系
/*
 
 (一)生产费用和期间费用的划分
 
     费用按经济用途划分:生产费用和期间费用。
 
     1.生产费用是指为生产产品而发生的、与产品生产直接相关的费用，如生产产品所发生的原材料费用、人工费用等。
 
         在财务会计中，生产费用与生产成本不是完全相同的概念，计入生产产品的生产费用才是生产成本。
 
         生产费用计入生产成本要明确两个前提:
 
         (1)明确生产费用的具体承担者(即成本核算对象)，例如:购买生产原材料10万元，用于生产A、B两种产品，其中A产品消耗 4万元，B产品消耗6万元，则生产费用为10万元，计入A产品生产 成本4万元，计入B产品生产成本6万元。
 
         (2)明确生产费用和生产成本的归属期，这里又分为两种情况， 第一种情况是生产费用已经发生但应由以后多个会计期间承担的生产 成本，例如:企业年初支出18万元，用于支付租期为6个月的周转 材料的租金，则生产费用为18万元，若平均分摊则每月生产成本为 3万元;第二种情况是按照权责发生制和收益费用匹配的原则，生产 费用应当计入生产成本但费用并没有实际支付，例如:企业经营租赁 方式租赁的生产用固定资产，租期6个月，每月租金5万元，租赁期 结束时一次支付30万元租金，则每月应计入生产成本5万元，而生产 费用30万元在租赁期末才实际支出。
 
         另外，生产费用的支出(含应付未付的部分)，经过生产过程计入生产成本，在会计期末资产负债表日，还应根据产品的完工情况和销售情况，分别进入产品成本和销售成本。
 
     2.期间费用是指与一定期间相联系，会计核算中不分摊到某一成本核算对象中去，而直接从企业当期销售收入中扣除的费用。主要包括营业费用、管理费用和财务费用三类。当期的期间费用是全额从当期损益中扣除，它不影响下一个会计期间。
 
         与生产成本相比较，期间费用的特点:
 
         1.与产品生产的关系不同。期间费用是为产品生产提供正常的 条件和管理的需要，而与产品生产并不直接相关;生产成本是与 产品生产直接相关的成本，应直接或分配计入有关产品成本中去。
         2.与会计期间的关系不同。期间费用只与费用发生的当期有关， 不影响或不分摊到其他会计期间; 生产成本中当期完工部分当期 转为产品成本，未完工部分则结转下一期继续加工，与前后会计 期间都有联系。
         3.与会计报表的关系不同。期间费用直接列入当期利润表， 计算当期损益;生产成本完工部分转为产成品，已销售产成品的 生产成本再转入利润表列作产品销售成本，而未售产品和未完工 产品都应作为存货列入资产负债表。因此也可把生产成本称为 可盘存成本，把期间费用称为不可盘存成本。
 
         产品生产过程中发生的直接材料、直接人工和制造费用等计入生产成本，待产品销售时与销售收入相配比，这符合配比原则。
 
         诸如企业支付的广告费等期间费用，由于它不能提供明确的未来收益，在这些费用发生时采用立即确认的办法处理，这符合谨慎性原则。
 
 (二)成本与费用的联系
 
     1.都是支出的构成部分;
     2.都是经济资源的耗费;
     3.生产费用经过对象化后进入生产成本，但在期末应将当期已销产品的成本结转进入当期的费用(损益核算时)。
 
 
 (三)成本与费用的区别
 
     1.成本是对象化的费用，其所针对的是一定的成本计算对象;
     2.费用是针对一定的期间而言的。包括生产费用和期间费用。生产费用是企业在一定时期发生的耗费，经过对象化后，才能转化为产品成本。期间费用不进入产品生产成本，而直接从当期损益中扣除。
 
 */
#pragma mark 知识点:工程成本和费用
/*
 
 1.工程成本
 
     生产成本是指构成产品实体、计入产品成本的那部分费用。施工企业的生产成本即工程成本，是施工企业为生产产品、提供劳务而发生的各种施工生产费用。
 
 2.期间费用
 
     是指企业当期发生的，与具体产品或工程没有直接联系，必须从 当期收入中得到补偿的费用。施工企业的期间费用主要包括管理 费 用和财务费用。
 
 */


#pragma mark *********** 1Z102022 工程成本的确认和计算方法
#pragma mark 知识点:成本费用的确认

/*
 
 支出的范围比费用大。只有收益性支出能确认为费用。
 
 分类                     含义                                                              内容
 
 
资本性支出    其效益及于几个会计年度的支出，应予以资本化，不能作为当期的费用。       企业购置和建造固定资产、无形资产及其他资产的支出、长期投资支出等
 
收益性支出    其效益仅及于本会计年度的支出，在一个会计期间内确认为费用。          外购材料、工资及其他支出，管理费用营业费用、财务费用，生产经营过程中缴纳的税金、有关费用等。
 
营业外支出    与其生产经营无直接关系的各项支出。                              固定资产盘亏、处置固定资产净损失、债务重组损失、计提资产减值准备、罚款、捐赠支出、非常损失等。
 
利润分配支出  利润分配环节发生的支出。                                        股利分配支出等。
 
 */

#pragma mark 知识点:成本费用的计量

/*
 
 (一)间接费用分摊
 
     对于直接发生的人工费、材料费用、机械使用费用等，通常能够在发生时即明确其收益对象，发生时直接计入合同成本。
 
     间接费用一般按直接费的百分比(水电安装工程、设备安装工程按人工费的百分比)，进行施工间接费的分配或者按间接费定额加权分配各合同的间接费用。
 
     考虑间接费按定额加权时，方法是:先计算本期实际发生的施工间接费用对该施工间接费用定额计算的施工间接费用的百分比，再将各项工程按定额计算的施工间接费用进行调整，即:
 
 
 
     不考虑间接费按定额加权分配时，采用的计算公式为:
 
        间接费用分配率 = 当期实际发生全部间接费用 / 当期各项合同实际发生的直接费用之和
 
     某项合同当期应负担的间接费用 =该合同当期实际发生的直接费用(或人工费)×间接费用分配率
 
 (二)固定资产折旧
 
     1.固定资产折旧的影响因素
 
         (1)固定资产原价
         (2)预计净残值
         (3)固定资产使用寿命
 
     2.固定资产折旧方法
 
         企业可选用的折旧方法包括平均年限法、工作量法、双倍余额递减法和年数总和法。
 
         (1)平均年限法
 
             是指将固定资产按预计使用年限平均计算折旧均衡分摊到各期的一种方法。采用这种方法计算的每期(年、月) 折旧额都是相等的。

             在不考虑减值准备的情况下，计算公式为:

                 固定资产年折旧额=固定资产应计折旧额/固定资产预计使用年限
                 固定资产月折旧额=固定资产年折旧额/12

             每年固定资产折旧额与固定资产原值之比称为固定资产年折旧率。
 
         (2)工作量法
 
             是指按照固定资产预计可完成的工作量计提折旧额的一种方法。
 
             在不考虑减值准备的情况下，计算公式为:
 
                 单位工作量折旧额=应计折旧额/预计总工作量
 
                 某项固定资产月折旧额 =该项固定资产当月工作量×单位工作量折旧额
 
             施工企业常用的工作量法有行驶里程法和工作台班法。
 
                 1.行驶里程法
 
                     是指按照行驶里程平均计算折旧的方法。它适用于车辆、船舶等运输设备计提折旧。
 
                     其计算公式为:
 
                         单位里程折旧额=应计折旧额/总行驶里程
 
                         某项固定资产月折旧额 =该项固定资产当月行驶里程×单位里程折旧额
 
                 2.工作台班法
 
                     是按照工作台班数平均计算折旧的方法。它适用于机器设备等计提折旧。
 
                     其计算公式为:
 
                         每工作台班折旧额=应计折旧额/总工作台班
 
                         某项固定资产月折旧额 =该项固定资产当月工作台班×每工作台班折旧额
 
         (3)双倍余额递减法
 
             是在不考虑固定资产预计净残值的情况下，根据每年年初固定资产净值和双倍的直线法折旧率计提折旧的一种方法。
 
             计算公式为:
 
                 固定资产年折旧额=账面价值(余额、净值)×双倍折旧率
 
             固定资产账面余额随着折旧的计提逐年减少，而折旧率不变，因此，各期计提的折旧额必然逐年减少。双倍余额递减法是加速折旧的方法，是在不缩短折旧年限和不改变净残值率的情况下，改变固定资产折旧额在各年之间的分布，在固定资产使用前期提取较多的折旧，而在使用后期则提取较少的折旧。
 
         (4)年数总和法
 
             是将固定资产的原值减去净残值后的净额乘以一个逐年递减的分数计算每年折旧额的一种方法。
 
             计算公式为:
 
                 固定资产年折旧额=(固定资产原值-净残值)×(尚可使用年数/年数总和)
 
             采用年数总和法计提折旧，各年提取的折旧额必然逐年递减，因此也是加速折旧的方法。
 
 
     固定资产的折旧方法一经确定，不得随意变更。
 
     企业应当对所有固定资产计提折旧。但是，已提足折旧仍继续使用的固定资产和单独计价入账的土地除外。
 
 
 (三)无形资产摊销
 
     企业应将入账的使用寿命有限的无形资产的价值在一定年限内摊销，其摊销金额计入管理费用，并同时冲减无形资产的账面价值。

     无形资产摊销包括摊销期、摊销方法和应摊销金额的确定。
 */

#pragma mark 知识点:工程成本的计算方法
/*
 
     工程成本是按对象归集了的费用，并在收入实现时结转成本。
 
     工程成本的计算方法一般应根据工程价款的结算方式来确定，包括:工程成本竣工结算法、工程成本月份结算法、工程成本分段结算法。
 
     会计结算期总是按月进行的，所以，工程成本的结算期不论定期或不定期，当月发生的生产费用必须在会计结算期按照成本核算对象和成本项目进行归集和分配。
 
 */
#pragma mark ***********  1Z102023 工程成本的核算
#pragma mark 知识点:工程成本及其核算的内容
/*
 
 根据《企业会计准则第15号—建造合同》，工程成本包括从建造 合同签订开始至合同完成止所发生的、与执行合同有关的直接费用 和间接费用。
 
 1.直接费用
 
     是指为完成合同所发生的、可以直接计入合同成本核算对象的各项费用支出。包括:
     (1)耗用的人工费用
     (2)耗用的材料费用(包括可多次使用的周转材料)
     (3)耗用的机械使用费
     (4)其他直接费用(包括施工过程中发生的材料二次搬运费、临时 设施摊销费、生产工具用具使用费、工程定位复测费、工程点交费、 场地清理费等)
 
 2.间接费用
 
     是指企业下属的施工单位或生产单位为组织和管理施工生产活动而发生的费用，不包括企业行政管理部门为组织和管理生产经营活动而发生的费用。因订立合同而发生的有关费用，应当计入当期损益。
 
     间接费用是为完成工程所发生的、不易直接归属于工程成本对象而应分配计入有关工程成本对象的各项费用支出。包括临时设施摊销费，施工单位管理人员工资、奖金、职工福利费，固定资产折旧费及修理费等。
     “下属施工单位”是建筑安装企业的工区、施工队、项目经理部等。
 
 */

#pragma mark 知识点:工程成本核算的对象
/*
 
 确定成本核算对象是工程成本核算的第一步。
 
 《企业会计准则》规定:企业通常应当按照单项建造合同进行会计处理。
 
 工程成本核算对象的确定方法有:
 (1)以单项建造(施工)合同作为施工工程成本核算对象;
 (2)对合同分立以确定施工工程成本核算对象;
 (3)对合同合并以确定施工工程成本核算对象。
 
 施工企业应在工程开工前确定成本核算对象，且一经确定不得随意变更。
 */
#pragma mark 知识点:工程成本核算的任务和基本要求
/*
 
 (一)工程成本核算的任务
 
     1.执行国家有关成本开支范围，费用开支标准，工程预算定额和 企业施工预算，成本计划的有关规定，控制费用，促使项目合理、 节约地使用人力、物力和财力。这是工程项目成本核算的先决前提和 首要任务。
     2.正确及时地核算施工过程中发生的各项费用，计算施工项目的 实际成本。这是项目成本核算的主体和中心任务。
     3.反映和监督施工项目成本计划的完成情况，为项目成本预测， 项目施工生产、技术和经营决策提供可靠的成本报告和有关资料， 促进项目改善经营管理，降低成本，提高经济效益。这是施工项目 成本核算的根本目的。
 
 (二)施工项目成本核算的要求
 
     1.划清成本、费用支出和非成本、费用支出的界限
     2.正确划分各种成本、费用的界限
     3.加强成本核算的基础工作
 
 */

#pragma mark 知识点:工程成本核算的程序

/*
 
 
 1.确定成本核算对象，设置成本核算科目，开设成本明细账
 2.核算与分配各项生产费用
 3.计算期末工程成本(施工生产费用)
 4.计算年度合同费用(按“完工百分比法”确认工程收入和结转成本费用)
 5.计算竣工单位工程的实际成本和预算成本，编制单位工程竣工成本决算
 
 */
#pragma mark *********** 1Z102024 期间费用的核算
#pragma mark 知识点:管理费用
/*
 
 是指建筑安装企业行政管理部门为管理和组织经营活动而发生的各项费用，包括:
 1.管理人员工资
 2.办公费
 3.差旅交通费
 4.固定资产使用费
 5.工具用具使用费
 6.劳动保险和职工福利费
 7.劳动保护费
 8.检验试验费
 9.工会经费
 10.职工教育经费
 11.财产保险费
 12.税金
 13.其他:包括技术转让费、技术开发费、业务招待费、绿化费、广告费、公证费、法律顾问费、审计费、咨询费、保险费等。
 */

#pragma mark 知识点:财务费用

/*
 
 
 是指企业为施工生产筹集资金或提供预付款担保、履约担保、职工工资支付担保等所发生的费用，包括:
 1.利息支出
 2.汇兑损失
 3.相关手续费:企业发行债券支付的手续费、银行手续费、调剂外汇手续费等，但不包括发行股票所支付的手续费等。
 4.其他财务费用:包括融资租入固定资产发生的融资租赁费用等。
 */

#pragma mark  ******************************* 1Z102030 3.收入
#pragma mark *********** 1Z102031 收入的分类及确认

#pragma mark 知识点:收入的概念及特点

/*
 
 广义上的收入包括营业收入、投资收益、补贴收入和营业外收入。
 
 狭义上的收入，即营业收入，是指在销售商品、提供劳务及让渡资产使用权等日常活动中形成的经济利益的总流入，包括主营业务收入和其他业务收入，不包括为第三方或客户代收的款项。
 
 收入的特点:
 1.收入是企业日常活动中产生的，而不是偶发的。
 2.收入可能表现为企业资产的增加，也可能表现为负债的减少，或二者兼而有之。
 3.收入能导致所有者权益的增加，收入是与所有者投入无关的经济利益的总流入。
 4.收入只包括本企业经济利益的流入，不包括为第三方或客户代收的款项。
 
 */

#pragma mark 知识点:收入的分类
/*
 
 按收入的性质分类
 
 类别                             含义                              内容
 建造(施工)合同收入      签订建造(施工) 合同而取得的收入  建筑企业为设计和建造房屋、道路等建筑物等按合同要求取得的施工合同收入
 销售商品收入           销售产品或商品而取得的收入       产品销售:自行加工的碎石、商品 混 凝土、各种门窗制品等; 材料销售:原材料、低值易耗品、 周转 材料、包装物等
 提供劳务收入           提供劳务作业而取得的收入        机械作业、运输服务、设计业务、产品安装、餐饮住宿等
 让渡资产使用权收入      让渡资产所有权而取得的收入      金融企业发放贷款取得的收入，企业让渡无形资产使用权取得的收入等
 
 
 按营业的主次分类
 
 类别                             含义                                            内容
 主营业务收入    也称基本业务收入，根据企业营业执照上注明的主营业务范围来确定       建筑业企业主要是建造(施工)合同收入
 其他业务收入    也称附营业收入， 是企业非经常性的、兼营的业务所产生的收入         产品销售收入、材料销售收入 、机械作业收入、 无形资产出租收入、固定资产出租收入等
 */
#pragma mark 知识点:收入的确认原则

/*
 
 (一)销售商品收入的确认
 
     1.企业已将商品所有权上的主要风险和报酬转移给购货方;
     2.企业既没有保留通常与所有权相联系的继续管理权，也没有对已售出的商品实施控制;
     3.收入的金额能够可靠地计量;
     4.与交易相关的经济利益很可能流入企业;
     5.相关的已发生或将发生的成本能够可靠地计量。
 
 (二)提供劳务收入的确认
 
     根据劳务结果能否可靠的估计，劳务收入采用不同的方式予以确认。
 
     1.企业在资产负债表日提供劳务交易的结果能够可靠估计的，应当采用完工百分比法确认提供劳务收入。
 
         提供劳务交易的结果能够可靠估计的4个条件:
         (1)收入的金额能够可靠地计量;
         (2)相关的经济利益很可能流入企业;
         (3)相关的完工进度能够可靠地确定;
         (4)交易中已发生的和将要发生的成本能够可靠地计量。
 
     2.企业在资产负债表日提供劳务交易结果不能可靠估计的， 应当 分别按下列情况处理:
 
         (1)已经发生的劳务成本预计能够得到补偿的，按照已发生劳务 成本金额确认收入，按相同金额结转成本;
         (2)已经发生的劳务成本预计不能够得到补偿的，应当将已发生 的劳务成本计入当期损益，不确认提供劳务收入。
 
 (三)让渡资产使用权收入的确认
 
     让渡资产使用权收入包括利息收入和使用费收入等。
     让渡资产使用权收入，同时满足下列条件时，才能予以确认:
     (1)与交易相关的经济利益很可能流入企业;
     (2)收入的金额能够可靠地计量。
 
 */


#pragma mark *********** 1Z102032 建造(施工)合同收入的核算
#pragma mark 知识点:建造合同概述
/*
 
 (一)建造(施工)合同的特征
     
     1.针对性强，现有买主(客户)，后有标的(即资产)，建造资产的工程范围、建设工期、工程质量和工程造价等内容在签订合同时已经确定;
     2.建设周期长，资产的建造一般需要跨越一个会计年度，有的 长达数年;
     3.建造的资产体积大，造价高;
     4.建造合同一般是不可撤销合同。
 
 (二)固定造价合同和成本加成合同
 
     1.固定造价合同 :是指按照固定的合同价或固定单价确定工程价款的建造合同。合同的风险主要由承包人承担。
 
     2.成本加成合同:也称成本加酬金合同，是指以合同约定或其他方式议定的成本为基础，加上该成本的一定比例或定额费用确定工程 价款的建造(施工)合同。 合同的风险主要由发包人承担。
 
 */
#pragma mark 知识点:合同的分立与合并
/*
 
 1.建造合同的分立
 
     一项包括建造数项资产的建造合同，同时满足下列条件的，每项 资产 应当分立为单项合同:
     (1)每项资产均有独立的建造计划;
     (2)与客户就每项资产单独进行谈判，双方能够接受或拒绝与每项 资产有关的合同;
     (3)每项资产的收入和成本可以单独辨认。
 
 2.建造合同的合并
 
     一组合同无论对应单个客户还是多个客户，同时满足下列条件的，应当合并为单项合同:
     (1)该组合同按一揽子交易签订;
     (2)该组合同密切相关，每项合同实际上已构成一项综合利润率工程的组成部分;
     (3)该组合同同时或依次履行。
 
 3.追加资产的建造合同处理
 
     追加资产的建造合同，满足下列条件之一的，应当作为单项合同:
     (1)该追加资产在设计、技术或功能上与原合同包括的一项或数项资产存在重大差异。
     (2)议定该追加资产的造价时，不需要考虑原合同价款。
 
 
 */

#pragma mark 知识点:合同收入的内容

/*
 
 建造合同的收入包括两部分:合同规定的初始收入和因合同变更、索赔、奖励等形成的收入。
 
 建造承包商不能随意确认因合同变更、索赔、奖励而形成的收入，只有在符合一定条件时才构成合同总收入。
 
 */

#pragma mark 知识点:建造(施工)合同收入的确认

/*
 
 (一)合同结果能够可靠估计
 
     1.合同结果能够可靠估计的标准
 
         (1)固定造价合同结果能够可靠估计，需同时具备以下条件:
 
             1.合同总收入能够可靠地计量;
             2.与合同相关的经济利益很可能流入企业;
             3.实际发生的合同成本能够清楚地区分和可靠地计量;
             4.合同完工进度和为完成合同尚需发生的成本能够可靠地确定。
 
         (2)成本加成合同的结果能够可靠估计，需同时具备以下条件:
 
             1.与合同相关的经济利益很可能流入企业;
             2.实际发生的合同成本能够清楚地区分和可靠地计量。
 
     2.完工百分比法:根据合同完工进度来确认合同收入的方法
 
         确定建造(施工)合同完工进度的三种方法:
 
         1.根据累计实际发生的合同成本占合同预计总成本的比例确定
         2.根据已经完成的合同工作量占合同预计总工作量的比例确定
         3.根据已完成合同工作的技术测量确定
 
         1.根据累计实际发生的合同成本占合同预计总成本的比例确定
 
             该方法是一种投入衡量法，是确定合同完工进度常用的方法，
 
             其计算公式为:
 
                 完工进度=(累计实际发生的合同成本/合同预计总成本)×100%
 
             注意:累计实际发生的合同成本不包括施工中尚未安装或使用的材料成本等与合同未来活动相关的合同成本，也不包括在分包工程的工作量完成之前付给分包单位的款项。
 
         2.根据已经完成的合同工作量占合同预计总工作量的比例确定
 
             该方法是一种产出衡量法，适用于合同工作量容易取得的建造(施工)合同，如道路工程、土石方工程等，其计算公式为:
 
                 完工进度=(已经完成的合同工程量/合同预计总工程量)×100%
 
         3.根据已完成合同工作的技术测量确定
 
            该方法是是在上述两种方法无法确定合同完工进度时所采用的一种特殊的技术测量方法，适用于一些特殊的建造(施工)合同，如水下施工工程等。
 
            这种技术测量应由专业人员现场进行科学测定，而不是由建筑企业自行随意测定。
 
     3.当期完成建造(施工)合同收入的确认
 
         当期确认的合同收入=实际合同收入-以前会计期间累计已确认收入
 
     4.资产负债表日建造(施工)合同收入的确认
 
         当期不能完成的建造(施工)合同，在资产负债表日，应确认的当期
 
         合同收入为:
 
             当期确认的合同收入=合同收入×完工进度-以前会计期间累计已确认收入
 
         注意:公式中的完工进度是指累计完工进度。
 
 (二)合同结果不能可靠地估计时建造(施工)合同收入的确认
 
     1.合同成本能够回收的，合同收入根据能够收回的实际合同成本来确认，合同成本在其发生的当期确认为费用。
 
     2.合同成本不能回收的，应在发生时立即确认为费用，不确认收入。 合同预计总成本超过合同总收入的，应当将预计损失确认为当期费用。
 
 */

#pragma mark  ******************************* 1Z102040 4.利润和所得税费用
#pragma mark *********** 1Z102041 利润的计算

#pragma mark 知识点:利润的概念
/*
 
 利润是企业在一定会计期间的经营活动所获得的各项收入抵减各项支出后的净额以及直接计入当期利润的利得和损失等。
 
 利得和损失分为两大类:一类是不计入当期损益，而直接计入所有者权益的利得和损失，如接受捐赠、变卖固定资产等，都可以直接计入资本公积。另一类是应当直接计入当期损益的利得和损失，如投资收益、投资损失等。
 
 */

#pragma mark 知识点:利润的计算
/*
 
 根据《企业会计准则》，可以将利润分为以下三个层次的指标。
 
 (一)营业利润
 
     营业利润是企业利润的主要来源。
 
     计算公式为:
 
        营业利润=营业收入-营业成本(或营业费用)
                -销售费用-管理费用-财务费用
                -资产减值损失 +公允价值变动收益(损失为负) +投资收益(损失为负)
 
     式中，营业收入包括主营业务收入和其他业务收入。
          营业成本包括主营业务成本和其他业务成本。
 
 
 (二)利润总额
 
     利润总额=营业利润+营业外收入-营业外支出
 
     式中，营业外收入(或支出)是指企业发生的与其生产经营活动没有直接关系的各项收入(或支出)。
 
     营业外收入包括固定资产盘盈、处置固定资产净收益、处置无形资产净收益、罚款净收入等。
 
     营业外支出包括固定资产盘亏、处置固定资产净损失、处置无形资产净损失、债务重组损失、罚款支出、捐赠支出、非常损失等。
 
 (三)净利润
 
     净利润=利润总额-所得税费用
 
     式中，所得税费用是指企业应计入当期损益的所得税费用。
 
 */
#pragma mark 知识点:利润分配
/*
 
 (一)税后利润的分配原则
 
     1.按法定顺序分配的原则。这既是公司税后利润分配的基本原则，也是公司税后利润分配的基本出发点。
     2.非有盈余不得分配原则。这一原则强调的是公司向股东分配的前提条件。
     3.同股同权、同股同利原则。
     4.公司持有的本公司股份不得分配利润。
 
 (二)税后利润的分配顺序
 
     1.弥补公司以前年度亏损。
     2.提取法定公积金。法定公积金又称强制公积金，公司分配当年税后利润时，应提取利润的10%列入公司法定公积金。公司法定公积金 累计额为公司注册资本的50%以上的，可以不再提取。
 
         法定公积金有 专门的用途，一般包括:
         1.弥补亏损。资本公积金不得弥补公司的亏损。
         2.扩大公司生产经营。
         3.增加注册资本。法定公积金转为资本时，所留存的该项公积金不得少于转增前公司注册资本的25%。
 
     3.经股东会或者股东大会决议提取任意公积金。
     4.向投资者分配的利润或股利。
     5.未分配利润。未分配利润可留待以后年度进行分配。
 
 */
#pragma mark *********** 1Z102042 所得税费用的确认

#pragma mark 知识点:所得税的概念
/*
 
     所得税是指企业就其生产、经营所得和其他所得按规定交纳的税金，是根据应纳税所得额计算的，包括企业以应纳税所得额为基础的各种境内和境外税额。应纳税所得额是企业年度的收入总额减去准予扣除项目后的余额。

     企业所得税的税率为25%，非居民企业的适用税率为20%。
 
 */


#pragma mark 知识点:所得税的计税基础
/*
 
 应纳税所得额是指企业每一纳税年度的收入总额，减除不征税收入、免税收入、各项扣除以及允许弥补的以前年度亏损后的余额。
 
 应纳税所得额的计算，以权责发生制为原则。
 
 (一)收入总额
 
     是指企业以货币形式和非货币形式从各种来源取得的收入，包括:
 
     1.销售货物收入。
     2.提供劳务收入。
     3.转让财产收入。
     4.股息、红利等收益性投资收益。
     5.利息收入。
     6租金收入。
     7.特许权使用收入。
     8.接受捐赠收入。
     9.其他收入，包括企业资产溢余收入、逾期未退包装物抵押金收入、确实无法偿付的应付款项、已作坏账损失处理后又收回的应收款项、债务重组收入、补贴收入、违约金收入、汇兑收益等。
 
     收入总额中，下列收入为不征税收入:
     (1)财政拨款;
     (2)依法收取并纳入财政管理的行政事业性收费、政府性基金;
     (3)国务院规定的其他不征税收入。
 
 
 (二)扣除
 
     1.企业实际发生的与取得收入有关的、合理的支出，包括成本、 费用、税金、损失和其他支出，准予在计算应纳税所得额时扣除。
 
     2.企业发生的公益性捐赠支出，在年度利润总额12%以内部分，准予在计算应纳税所得额时扣除。 在计算应纳税所得额时，下列支出不得扣除:
 
         (1)向投资者支付的股息、红利等权益性投资收益款项;
         (2)企业所得税税款;
         (3)税收滞纳金;
         (4)罚金、罚款和被没收财物的损失;
         (5)《企业所得税法》第九条规定以外的捐赠支出;
         (6)赞助支出;
         (7)未经核定的准备金支出;
         (8)与取得收入无关的其他支出。
 
     3.企业按照规定计算的固定资产折旧，准予扣除。
     4. 企业按照规定计算的无形资产摊销，准予扣除。
     5.企业按照规定发生的长期待摊费用，准予扣除。
     6.企业对外投资期间，投资资产的成本不得扣除。
     7.企业使用或者销售存货，按照规定计算的存货成本，准予扣除。
     8.企业转让资产，该项资产的净值，准予扣除。
     9.企业境外营业机构的亏损不得抵减境内营业机构的盈利。
     10.企业纳税年度发生的亏损，准予向以后年度结转，用以后年度的所得弥补，但结转年限最长不得超过5年。
 
 */

#pragma mark 知识点:所得税费用的确认
/*
 
 《企业所得税法》规定的所得税应纳税额的计算公式为: 应纳税额 =应纳税所得额×适用税率-减免税额-抵免税额
 
 */
#pragma mark 知识点:税收优惠
/*
 
 企业的下列收入为免税收入:
 
 (1)国债利息收入;
 (2)符合条件的居民企业之间的股息、红利等权益性投资收益;
 (3)在中国境内设立机构、场所的非居民企业从居民企业取得与机构、场所有实际联系的股息、红利等权益性投资收益;
 (4)符合条件的非营利性组织的收入。
 
 企业的下列所得，可以免征、减征企业所得税:
 
 (1)从事农、林、牧、渔项目的所得;
 (2)从事国家重点扶持的公共基础设施项目投资经营的所得;
 (3)从事符合条件的环境保护、节能节水项目的所得;
 (4)符合条件的技术转让所得;
 (5)《企业所得税法》第三条第三款规定的所得。
 
 符合条件的小微企业，减按20%的税率征收企业所得税。
 国家重点扶持的高新技术企业，减按20%的税率征收企业所得税。
 
 企业的下列支出，可以在计算应纳税所得额时加计扣除:
 (1)开发新技术、新产品、新工艺发生的研究开发费用;
 (2)安置残疾人员及国家鼓励安置的其他就业人员所支付的工资。
 
 */

#pragma mark  ******************************* 1Z102050 5.企业财务报表

#pragma mark *********** 1Z102051 财务报表的构成

#pragma mark 知识点:财务报表列报的基本要求
/*
 
 1.企业应当以持续经营为基础编制财务报表。
 2.财务报表项目的列报应当在各个会计期间保持一致，不得随意变更。
 3.重要项目单独列报。
 
     重要性从项目的性质和金额大小判定。
 
 4.报表列示项目不应相互抵消。

     资产项目按扣除减值准备后的净额列示，不属于抵消。非日常活动 产生的损益，以收入扣减费用后的净额列示，不属于抵消 。
 
 5.当期报表列报项目与上期报表列报项目应当具有可比性。
 6.其他相关要求，主要包括以下两点:
 
     (1)企业应当在财务报表的显著位置至少披露下列各项:
 
         1.编制企业的名称;
         2.资产负债表日或财务报表所涵盖的会计期间;
         3.人民币金额单位;
         4.如果是合并会计报表的，应当予以标明。
 
     (2)企业应当至少按年编制财务报表。
 */

#pragma mark 知识点:财务报表的构成
/*
 
 1.资产负债表是反映企业在某一特定日期财务状况的静态报表。
 
 2.利润表是反映企业在一定会计期间经营成果的动态报表。
 
 3.现金流量表是反映企业在一定会计期间现金和现金等价物流入、流出情况的动态报表。
 
 4.所有者权益变动表是反映构成所有者权益(或股东权益)的各组成部分当期增减变动情况的财务报表。
 
 5.财务报表附注是对在资产负债表、利润表、现金流量表和所有者权益变动表等报表中列示项目的文字描述或明细资料，以及对未能在这些报表中列示项目的说明等。
 
 */

#pragma mark ***********  1Z102052 资产负债表的内容和作用
#pragma mark 知识点:资产负债表的内容和结构
/*
 
 (一)资产负债表的内容
 
     资产负债表根据资产、负债、所有者权益之间的关系，即“资产=负债+所有者权益”，按照一定的分类标准和顺序， 把 企业一定日期的资产、负债和所有者权益各项目进行适当排列。
 
     资产负债表的主要内容包括企业资产、负债以及所有者权益的总体规模和结构。详细内容见下表:
 
     1.流动资产
 
         资产满足下列条件之一的，应当归类为流动资产:
 
         (1)预计在一个正常营业周期中变现、出售或耗用。
         (2)主要为交易目的而持有。
         (3)预计在资产负债表日起一年内(含一年，下同)变现。
         (4)自资产负债表日起一年内，交换其他资产或清偿负债的能力不受限制的现金或现金等价物。
 
     2.非流动资产 流动资产以外的资产应归类为非流动资产，并按其性质分类列示。
 
     3.流动负债
 
         负债满足下列条件之一的，应当归类为流动负债:
 
         (1)预计在一个正常营业周期中清偿。
         (2)主要为交易目的而持有。
         (3)自资产负债表日起一年内应予以清偿。
         (4)企业无权自主地将清偿推迟至资产负债表日后一年以上。
 
     4.非流动负债
 
         流动负债之外的负债应当归类为非流动负债。
 
         值得注意的是:
 
            对于在资产负债表日起一年内到期的负债，企业预计能够自主地将清偿义务展期至资产负债表日后一年以上的，应当归类为非流动负债;不能自主地将清偿义务展期的，即使在资产负债表日后、财务报告批准报出日前签订了重新安排清偿计划协议，该负债仍应归类为流动负债。
 
            企业在资产负债表日或之前违反了长期借款协议，导致贷款人可随时要求清偿的负债，应当归类为流动负债。贷款人在资产负债表日或之前同意提供在资产负债表日后一年以上的宽限期，企业能够在此期限内改正违约行为，且贷款人不能要求随时清偿，该项负债应当归类为非流动负债。
 
     5.所有者权益
 
         应当至少单独列示反映实收资本(或股本);资本公积;盈余公积和未分配利润。
 
         所有者权益受企业资产影响，如果企业资产出现损失，例如应收账款没有收回，作为坏账被注销，而债务不变，则股东权益将减少。
 
 (二)资产负债表的结构
 
     企业的资产负债表一般采用账户式资产负债表，该表为左右结构，左边列示资产，右边列示负债和所有者权益。
 
 */

#pragma mark 知识点:资产负债表的作用
/*
 
 1.资产负债表能够反映企业在某一特定日期所拥有的各种资源 总量及其分布情况，可以分析资产构成，以便及时进行调整;
 2.资产负债表能够反映企业的偿债能力，可以提供某一日期的 负债总额及其结构，表明企业未来需要用多少资产或劳务清偿债务 以及清偿时间;
 3.资产负债表能够反映企业在某一特定日期企业所有者权益的 构成情况，可以判断资本保值、增值的情况以及对负债的保障程度。
 
 */

#pragma mark 知识点:所有者权益变动表的内容和作用
/*
 
 
 (一)所有者权益变动表的内容
 
     所有者权益变动表至少应当包括以下单列项目:
 
     1.净利润;
 
     2.直接计入所有者权益的利得和损失项目及其总额;
 
     3.会计政策变更和差错更正的累积影响金额;
 
     4.所有者投入资本和向所有者分配利润等;
 
     5.按照规定提取的盈余公积;
 
     6.实收资本(或股本)、资本公积、盈余公积、未分配利润的期初和期末余额及其调节情况。
 
 (二)所有者权益变动表的作用
 
     所有者权益变动表全面反映了企业的所有者权益在年度内的变化情况，便于会计信息使用者深入分析企业所有者权益的增减变化情况，并进而对企业的资本保值增值情况作出正确判断，从而提供对决策者有用的信息。
 
 */
#pragma mark *********** 1Z102053 利润表的内容和作用
#pragma mark 知识点:利润表的内容和结构
/*
 
 (一)利润表的内容
 
     利润表是反映企业在一定会计期间的经营成果的财务报表。利润表的列报必须反映企业经营业绩的主要来源和构成。利润表主要反映以下几方面的内容:
     (1)营业收入。由主营业务收入和其他业务收入组成。
     (2)营业利润。营业收入减去营业成本、营业税金及附加、销售 费用、管理费用、财务费用、资产减值损失，加上公允价值变动 收益、投资收益即为营业利润。
     (3)利润总额。营业利润加上营业外收入，减去营业外支出，即为 利润总额。
     (4)净利润。利润总额减去所得税费用，即为净利润。
 
 (二)利润表的结构
 
     我国采用的是多步式利润表。
 
     利润表的结构如下表所示。
 
 */

#pragma mark 知识点:利润表的作用
/*
 
 利润表是财务报表的主要报表，其作用主要表现在:
 1.利润表能反映企业在一定期间的收入和费用情况以及获得利润 或发生亏损的数额，表明企业投入与产出之间的关系;
 2.通过利润表提供的不同时期的比较数字，可以分析判断企业 损益发展变化的趋势，预测企业未来的盈利能力;
 3.通过利润表可以考核企业的经营成果以及利润计划的执行情况， 分析企业利润增减变化原因。
 
 */
#pragma mark *********** 1Z102054 现金流量表的内容和作用
#pragma mark 知识点:现金流量表的编制基础
/*
 
 现金流量表是反映企业一定会计期间现金和现金等价物流入和流出的财务报表。
 
 现金流量表以现金为编制基础，现金包括库存现金、可以随时用于支付的存款、其他货币资金以及现金等价物。
 
 现金等价物，是指企业持有的期限短(三个月内)、流动性强、易于转换为已知金额的现金、价值变动风险小的交易性金融资产。
 
 
 现金等价物必须同时满足以下四个条件:
 1.期限短;
 2.流动性强;
 3.易于转换为已知金额的现金;
 4.价值变动风险小。

    因此，通常从购买日起三个月到期或清偿的国库券、货币市场基金、可转换定期存单、商业本票及银行承兑汇票等都可列为现金等价物。企业短期购入的可流通的股票不属于现金等价物。
 
 */

#pragma mark 知识点:现金流量表的内容
/*
 
     现金流量表的内容应当包括经营活动、投资活动和筹资活动产生的现金流量。
 
 (一)经营活动产生的现金流量
 
    经营活动是指企业投资活动和筹资活动以外的所有交易和事项。施工企业的经营活动主要包括:承发包工程、销售商品、提供劳务、经营性租赁、购买材料物资、接受劳务、支付税费等。
 
     经营活动产生的现金流量主要包括:
     1.销售商品、提供劳务收到的现金;
     2.收到的税费返还;
     3.收到其他与经营活动有关的现金;
     4.购买商品、接受劳务支付的现金;
     5.支付给职工以及为职工支付的现金;
     6.支付的各项税费;
     7.支付其他与经营活动有关的现金。
 
 (二)投资活动产生的现金流量
 
     投资活动是指企业长期资产的购建和不包括在现金等价物范围的投资及其处置活动。
 
     投资活动产生的现金流量主要包括:
     1.收回投资收到的现金;
     2.取得投资收益收到的现金;
     3.处置固定资产、无形资产和其他长期资产收回的现金净额;
     4.处置子公司及其他营业单位收到的现金;
     5.收到其他与投资活动有关的现金;
     6.购建固定资产、无形资产和其他长期资产支付的现金;
     7.投资支付的现金;
     8.取得子公司及其他营业单位支付的现金净额;
     9.支付其他与投资活动有关的现金。
 
 (三)筹资活动产生的现金流量
 
     筹资活动是指企业资本及债务规模和构成发生变化的活动。
     筹资活动产生的现金流量主要包括:
     1.吸收投资收到的现金;
     2.取得借款收到的现金;
     3.收到其他与筹资活动有关的现金;
     4.偿还债务支付的现金;
     5.分配股利、利润或偿付利息支付的现金;
     6.支付其他与筹资活动有关的现金。
 
 */

#pragma mark 知识点:现金流量表的结构
/*
 
 现金流量表由正表和补充资料两部分组成。
 
 正表有五项:
 
     1.经营活动产生的现金流量;
     2.投资活动产生的现金流量;
     3.筹资活动产生的现金流量;
     4.汇率变动对现金的影响;
     5.现金及等价物净增加额。
 
 补充资料有三项:
 
     1.将净利润调节为经营活动产生的现金流量， 即在补充资料中采用间接法报告经营活动产生的现金流量信息;
     2.不涉及现金收支的重大投资和筹资活动;
     3.现金及现金等价物净增加情况。
 
 正表第一项经营活动产生现金流量净额，与补充资料第一项经营活动产生的现金流量净额，应当核对相符。
 
 正表中的第五项，与补充资料中的第三项，存在句稽关系，即金额应当一致。
 
 正表中的数字是流入与流出的差额，补充资料中的数字是期末数与期初数的差额，计算依据不同，但结果应当一致，两者应当核对相符。
 
 
 */

#pragma mark 知识点:现金流量表的作用

/*
 
 1.现金流量表提供企业的现金流量信息，有助于使用者对企业 整体财务状况做出客观评价;
 2.现金流量表有助于评价企业的支付能力、偿债能力和周转 能力;
 3.现金流量表有助于使用者预测企业未来的发展情况。
 
 */

#pragma mark *********** 1Z102055 财务报表附注表的内容和作用

#pragma mark 知识点:财务报表附注表的主要内容
/*
 
 《企业会计准则(2006)》规定，附注一般按下列顺序披露:
 1.财务报表的编制基础。
 2.遵循企业会计准则的声明。
 3.重要会计政策的说明，包括财务报表项目的计量基础和会计政策的确定依据等。
 4.重要会计估计的说明，包括下一会计期间内很可能导致资产、负债账面价值重大调整的会计估计的确定依据等。
 5.会计政策和会计估计变更以及差错更正的说明。
 6.对已在资产负债表、利润表、现金流量表和所有者权益变动 表中列示的重要项目的进一步说明，包括终止经营税后利润的金额 及其构成情况等。
 7.或有和承诺事项、资产负债表日后非调整事项、关联方关系 及其交易等需要说明的事项。
 
 由于财务报表中所规定的内容具有一定的固定性和规定性，只能提供定量的会计信息，其所能反映的会计信息受到一定的限制。财务报表附注是对财务报表的补充。
 
 */


#pragma mark  ******************************* 1Z102060 6.财务分析
#pragma mark ***********  1Z102061 财务分析方法

#pragma mark 知识点:趋势分析法
/*
 
 又称水平分析法，通过对比两期或连续数期财务报告中相同指标，确定其增减变化的方向、数额和幅度，来说明企业财务状况、经营成果和现金流量的变动趋势。分为定基指数和环比指数两种方法。
 
 定基指数是各个时期的指数都是以某一固定时期为基期来计算。
 
     定基指数 = 分析期数额 / 固定基期数额 * 100%
 
 环比指数是各个时期的指数以前一期为基期来计算。
 
     环比指数 = 分析期数额 / 前一期数额 * 100%
 
 趋势分析法通常采用定基指数，其优点是简便、直观。应重点分析某些有显著变化的指标，研究其变动原因，以采取对策，趋利避害。
 
 */
#pragma mark 知识点:比率分析法
/*
 
 是通过计算各种比率来确定经济活动变动程度的分析方法。
 
 比率分析法是财务分析最基本、最重要的方法。
 
 常用的比率有:
 1.构成比率，反映部分与总体的关系，如流动资产占资产总额的比率;
 2.效率比率，反映投入与产出的关系，如投资收益率;
 3.相关比率，反映有关联的经济活动的相互关系，如流动比率。
 
 比率分析法的优点是计算简便，计算结果比较容易判断，而且可以使某些指标在不同规模企业之间进行比较。
 
 因素分析法是依据分析指标与其影响因素之间的关系，按照一定的程序和方法确定各因素对分析指标差异的影响程度。
 
 因素分析法的分析思路是，当有若干因素对分析指标产生影响时，在假设其他各因素都不变的情况下，顺序确定每个因素单独变化对分析指标产生的影响。
 
 因素分析法可分为连环替代法和差额计算法两种。
 
 (一)连环替代法
 
     是将分析指标分解为各个可计量的因素，并根据各个因素之间的依存关系，顺序用各因素的比较值(通常为实际值)替代基准值 (通常为标准值或计划值)，据以测定各因素对指标的影响。
 
 (二)差额计算法
 
     是连环替代法的一种简化形式，它是利用各因素的实际数与基准值之间的差额，计算各因素对分析指标的影响。
 
 */
#pragma mark   ***********   1Z102062 基本财务比率的计算和分析
/*
 
 */

#pragma mark 知识点:偿债能力比率
/*
 
 1.资产负债率
 
     资产负债率是企业总负债与总资产之比，它既能反映企业利用债权人提供资金进行经营活动的能力，也能反映企业经营风险的程度，是综合反映企业长期偿债能力的重要指标。
 
     其计算公式为:
 
         资产负债率=(总负债/总资产)×100%
 
     从企业债权人角度看，资产负债率越低，说明企业偿债能力越强，债权人的权益就越有保障。从企业所有者和经营者角度看，通常希望 该指标高些，这有利于利用财务杠杆增加所有者获利能力。但资产负 债率过高，企业财务风险也会增大。因此，一般地说，该指标为50% 比较合适，有利于风险与收益的平衡。
 
 2.流动比率
 
     流动比率是企业流动资产与流动负债的比率，主要反映企业短期偿债能力。
 
     其计算公式为:
 
         流动比率=流动资产/流动负债
 
     通常认为生产性行业合理的最低流动比率为2。
 
     如果流动比率过高，则要检查其原因，是否是由资产结构不合理造成的，或者是募集的长期资金没有尽快投入使用，或者是其他原因。如果流动比率过低，企业近期可能会有财务方面的困难。偿债困难会使企业的风险加大。
 
 3.速动比率
 
     速动比率是企业速动资产与流动负债的比率，反映企业短期偿债能力。
 
     其计算公式为:
 
         速动比率=速动资产/流动负债
 
     速动资产是指能够迅速变现为货币的各类流动资产，通常有两种计算方法:
 
         速动资产=流动资产-存货
 
         速动资产=货币资金+交易性金融资产+应收票据+应收账款+其他应收款
 
 经验认为，速动比率为1就说明企业有偿债能力，低于1则说明 企业偿债能力不强，该指标越低，企业的偿债能力越差。在企业的 流动资产中，存货的流动性最小。在发生清偿事件中，存货蒙受的 损失将大于其他流动资产。因此一个企业不依靠出售库存资产来 清偿债务的能力是非常重要的。
 
 */
#pragma mark 知识点:营运能力比率
/*
 
 营运能力比率是用于衡量公司资产管理效率的指标。
 
 常用的指标有总资产周转率、流动资产周转率、存货周转率、应收账款周转率等。
 
 1.总资产周转率
 
     是指企业在一定时期内主营业务收入与总资产的比率。
 
     其计算公式为:
 
         总资产周转率(次)=主营业务收入/资产总额
 
     式中，资产总额一般取期初资产总额和期末资产总额的平均值计算。
 
     总资产周转率表明一年中总资产周转的次数，或者说明每1元总资产支持的主营业务收入。周转率越高，反映企业销售能力越强。
 
 2.流动资产周转率
 
     是指企业在一定时期内主营业务收入与平均流动资产总额的比率，通常用周转次数和周转天数来表示。
 
     其计算公式分别为:
 
         流动资产周转次数=主营业务收入/流动资产平均值
 
         流动资产周转天数=计算期天数/流动资产周转次数
 
     式中，流动资产平均值一般取期初流动资产和期末流动资产的平均值。
 
     流动资产周转次数表明1年中流动资产周转的次数，或者说明 1元流动资产支持的营业收入。流动资产周转天数表明流动资产 周转1次需要的时间，也是将流动资产转换成现金需要的时间。
 
 3.存货周转率
 
     是指企业在一定时期内存货占用资金可周转的次数，或存货每周转一次所需要的天数，通常用存货周转次数和存货周转天数来表示。
 
     其计算公式分别为:
 
         存货周转次数=营业成本/存货
         存货周转天数=计算期天数/存货周转次数
 
     式中，存货一般取期初存货和期末存货的平均值。
 
 
     一般情况下，存货周转率越高、周转天数越短，说明该指标越好。提高存货周转率可提高企业的变现能力。存货周转分析的目的是从不同的角度和环节找出存货管理中的问题，使存货管理在保证生产经营连续性的同时，尽可能少占用资金，增强企业短期偿债能力。
 
 4.应收账款周转率
 
     是指企业在某一时期营业收入和同期应收账款之间的比率，通常用应收账款周转次数和应收账款周转天数来表示。
 
     其计算公式分别为:
 
         应收账款周转次数=营业收入/应收账款
         应收账款周转天数=365/应收账款周转次数
 
     式中，应收账款一般取期初应收账款和期末应收账款的平均值。
 
     应收账款周转率通常用来测定企业在某一特定时期内收回赊销账款的能力，它既可以反映企业应收账款的变现速动，又可以反映企业的管理效率。一般认为应收账款周转率越高、周转天数越短越好。
 */
#pragma mark 知识点:盈利能力比率
/*
 
 1.净资产收益率
 
     是指企业本期净利润和净资产的比率，是反映企业盈利能力的核心指标。
 
     其计算公式为:
 
         净资产收益率=(净利润/净资产)×100%
 
     式中，净利润是指企业当期税后利润;净资产是指企业期末资产减负债后的余额，通常取期初净资产和期末净资产的平均值。
 
     净资产收益率指标越高，净利润越多，说明企业盈利能力越好。该指标越高，表明资产的利用效率越高，说明企业在增加收入和节约资金使用方面取得了良好的效果。
 
 2.总资产净利率
 
     是指企业运用全部资产的净收益率，它反映企业全部资产运用的总成果。
 
     其计算公式为:
 
         总资产净利率=(净利润/资产总额)×100%
 
     式中，资产总额可以取期初资产总额和期末资产总额的平均值。
 
     总资产净利率反映公司资产的利用效率，是个综合性很强的指标。该指标越高，表明企业资产的利用效率越高，同时也意味着企业资产的盈利能力越强，该指标越高越好。
 
 */


#pragma mark 知识点:发展能力比率
/*
 
 1.营业增长率
 
     是指企业本期营业收入增长额同上期营业收入总额的比率。
 
     其计算公式为:
 
         营业增长率=(本期营业收入增加额/上期营业收入)×100%
 
     营业增长率是评价企业成长状况和发展趋势的重要指标。该指标是衡量企业经营状况和市场占有能力、预测企业经营业务拓展趋势的重要标志，也是企业扩张资本的重要前提。该指标若大于零，表明企业本期的营业收入有所增长，指标值越高，表明增长速度越快，市场前景越好;反之则说明企业市场份额萎缩。
 
 
 2.资本积累率
 
     是指企业本年所有者权益增长额同年初所有者权益的比率。

     其计算公式为:
 
         资本积累率=(本年所有者权益增长额/年初所有者权益)×100%
 
     资本积累率是企业当年所有者权益总的增长率，反映了企业所有者权益在当年的变动水平。该指标体现了企业资本的积累能力，是评价企业发展潜力的重要指标，也是企业扩大再生产的源泉。
 
     资本积累率反映了投资者投入企业资本的保全性和增长性，该指标越高，表明企业的资本积累越多，企业资本保全性越强，应付风险、持续发展的能力越大;该指标如为负值，表明企业资本受到侵蚀，所有者权益受到损害，应予以充分重视。
 
 */

#pragma mark 知识点:财务指标综合分析——杜邦财务分析体系
/*
 
 在财务指标综合分析方法中，比较典型的是杜邦财务分析体系，简称杜邦分析，是利用各主要财务比率指标之间的内在联系对企业财务状况和经营成果进行综合系统评价的方法。
 
 该体系是以净资产收益率为核心指标，以总资产净利率和权益乘数为两个方面，重点揭示企业获利能力及权益乘数对净资产收益率的影响，以及各相关指标之间的相互作用关系。
 
 杜邦财务分析是一个多层次的财务比率分解体系。
 
 */

#pragma mark  ******************************* 1Z102070 7.筹资管理
#pragma mark *********** 1Z102071 资金成本的作用及其计算

#pragma mark 知识点:资金成本的概念
/*
 
 是指企业为筹措和使用资本而付出的代价，包括资金筹资费用和资金占用费两个部分。
 
 资金筹资费用是指在资金筹集过程中支付的各项费用，如借款手续费，发行债券支付的印刷费、代理发行费、律师费、公证费、广告费等。它通常在筹措资金时一次性支付，在使用资金的过程中不再发生。因此，筹资费用可看作资金成本的固定费用，一般视为筹资数额的一项扣除。
 
 资金占用费是指企业占用资金支付的费用，如银行借款利息、债券利息、支付给股东的股息、红利等。资金占用费用和筹集资金的数额、资金占用时间的长短有直接关系，可看作是资金成本的变动费用。
 
 资金成本(率) 和筹资总额、筹资费用和资金占用费之间的关系式为:
 
     资金成本率=资金占用费/筹资净额
 
 其中，筹资净额=筹资总额-筹资费=筹资总额×(1-筹资费率)
 
 【注】分子指的是一年的资金占用费;资金成本率也是年成本率。
 
 */

#pragma mark 知识点:资金成本的计算
/*
 
 常用的资金成本有个别资金成本和综合资金成本。
 
 1.个别资金成本
 
     是单种筹资方式的资金成本，包括长期借款资金成本、长期债券资金成本、优先股资金成本、普通股资金成本和留存收益资金成本。其中，前两种称为债务资金成本，后三种称为权益资金成本或自有资金成本。
 
     个别资金成本一般用于比较和评价各种筹资方式。
 
 2.综合资金成本
 
     是对各种个别资金成本进行加权平均而得的结果，因此，也称为加权平均资金成本。它是以个别资金成本为基数，以各种来源资本占全部资本的比重为权数计算的以各种方式筹集的全部长期资金的总成本。
 
     企业有多种筹资方案且每一方案又有多种筹资方式时，由于个别资金成本有高低差异时需要计算综合资金成本，在不考虑其他因素的情况下，通常选择综合资金成本最低的方案。
 
 */
#pragma mark 知识点:资金成本的作用
/*
 
 1.选择资金来源、确定筹资方案的重要依据
 
     从筹资决策角度来讲，企业力求选择资金成本最低的筹资方式。
 
 2.评价投资项目、比较投资方案和进行投资决策的经济标准
 
     从企业投资决策角度来讲，通常将资金成本率视为一个投资项目的最低收益率或必要报酬率。
 
 3.评价企业经营业绩的基准
 
     资金成本还可用作衡量企业经营业绩的尺度，即全部投资的利润率应高于资金成本，否则表明业绩欠佳，需要改善经营管理。
 
 */

#pragma mark *********** 1Z102072 短期筹资的特点和方式
#pragma mark 知识点:短期筹资的特点
/*
 
 短期筹资是指为满足企业临时性流动资金需要而进行的筹资活动，一般是在一年以内或超过一年的一个营业周期内到期，常用的方式是通过流动负债方式取得，因此，也称为流动负债筹资或短期负债筹资。
 
 其特点如下:
 1.筹资速度快。
 2.筹资弹性好。
 3.筹资成本较低。 4.筹资风险高:短期筹资需要在短期内偿还;短期筹资的利率通常波动较大。
 
 */

#pragma mark 知识点:短期筹资策略
/*
 
 企业的流动资产分为临时性资产和永久性资产两部分。与此相对应，企业的资本也分为临时性资本需求和永久性资本需求两部分。
 
 1.配合型筹资策略
 
     对于临时性流动资产，运用临时性负债筹集资金满足其资金需要;
 
     对于永久性流动资产和固定资产(统称为永久性资产) ，运用长期负债、 商业信用和权益资本筹集资金满足其资金需要。这种策略是一种理想 的筹资策略，较难在现实经济活动中得以圆满地实现。
 
 2.激进型筹资策略
 
     短期筹资不但融通临时性流动资产的资金需要，还解决部分永久 性资产的资金需要。 这是收益性和风险性均较高的筹资策略。
 
 3.稳健型筹资策略
 
     短期筹资只融通部分临时性流动资产的资金需要。 这是风险性和 收益性均较低的筹资策略。
 
 */

#pragma mark 知识点:短期筹资的方式
/*
 
 短期负债筹资最常用的方式是商业信用和短期借款。
 
 (一)商业信用
 
     是指在商品交易中由于延期付款或预收货款所形成的企业间的借贷关系，具体形式有应付账款、应付票据、预收账款。
 
     1.应付账款
 
         概念:是企业购买货物而欠对方的账项，即卖方允许买方在购货后一定时期支付货款的一种形式。
 
         性质:卖方利用这种方式促销，而买方则等于向卖方借用资金购进商品，可以满足短期的资金需要。
 
         应付账款有付款期、折扣等信用条件。免费信用，即买方企业在规定的折扣期内享受折扣而获得的信用;有代价信用，即买方企业放弃折扣付出代价而获得的信用;展期信用，即买方企业超过规定的信用期推迟付款而强制获得的信用。
 
     2.应付票据
 
         概念:是企业进行延期付款商品交易时开具的反映债权债务关系的票据。
 
         分类:根据承兑人的不同，分为商业承兑汇票和银行承兑汇票。
 
         特点:支付期最长不超过6个月。一般比银行的借款利率低。延期归还要付罚金。
 
     3.预收账款
 
         概念:是卖方企业在交付货物之前向买方预先收取部分或全部货款的信用形式。
 
         性质:卖方向买方借用资金后用货物抵偿。一般用于生产周期长、资金需要量大的货物销售。
 
     4.商业信用筹资的特点
 
         最大的优越性在于容易取得。
 
         首先，对于多数企业来说，商业信用是一种持续性的信用形式，且无须正式办理筹资手续。
 
         其次，如果没有现金折扣或使用不带息票据，商业信用筹资不负担成本。
 
         其缺陷在于期限较短，在放弃现金折扣时所付出的成本较高。
 
 (二)短期借款

     1.短期借款的主要方式
 
         (1) 信贷限额
 
             是银行对借款人规定的无担保贷款的最高额。信贷限额的有效 期限通常为1年，但根据情况也可延期1年。一般来讲，企业在批准 的信贷限额内，可随时使用银行借款。但是，银行并不承担必须 提供全部信贷限额的义务。
 
         (2) 周转信贷协定
 
             是银行具有法律义务地承诺提供不超过某一最髙限额的贷款协定。在协定的有效期内，只要企业的借款总额未超过最高限额，银行必须满足企业任何时候提出的借款要求。企业享用周转信贷协定，通常要就贷款限额的未使用部分付给银行一笔承诺费。
 
         (3) 补偿性余额
 
             银行要求借款企业在银行中保持按贷款限额或实际借用额一定百分比 (一般为10%~20%)的最低存款余额。从银行的角度讲，补偿性余额 可降低贷款风险，补偿遭受的贷款损失。对于借款企业来讲，补偿性余额 则提高了借款的实际利率。
 
         (4) 担保贷款
 
             银行向财务风险较大的企业或者对其信誉不甚有把握的企业发放贷款，需要由借款人或第三方提供担保而获得的贷款。担保一般包括保证责任、财务抵押、财产质押。由此，担保贷款包括保证贷款、抵押贷款和质押贷款。
 
     2.短期借款利息的支付方法
 
         (1) 收款法:借款到期时向银行支付利息的方法。名义利率等于实际利率。
 
         (2) 贴现法:银行向企业发放贷款时，先从本金中扣除利息部分，而到期时借款企业则要偿还全部本金的一种计息方法。企业可利用的贷款额只有本金减去利息部分后的余额，因此贷款的实际利率高于名义利率。
 
         (3) 加息法:分期等额偿还贷款时计息的方法。这种情况下，银行将根据名义利率计算的利息加到贷款本金上，计算出贷款的本息和， 要求企业在贷款期内分期偿还本息之和的金额。由于贷款分期均衡 偿还，借款企业实际上只平均使用了借款本金的半数，却支付全额利息。这样，企业所负担的实际利率便高于名义利率大约1倍。
 
     3.企业对银行的选择
 
         企业选择银行时，重要的是要选用适宜的借款种类、借款成本和借款条件，
 
         此外还应考虑下列有关因素:
         (1) 银行对贷款风险的政策。
         (2) 银行对企业的态度。
         (3) 贷款的专业化。
         (4) 银行的稳定性。
 
     4.短期借款筹资的特点
 
         短期借款的重要性仅次于商业信用。
 
         短期借款可随企业的需要安排，便于灵活使用，且取得亦较方便。
 
         突出的缺点是短期内要归还，特别是带有诸多附加条件的情况下更是风险加剧。
 */
#pragma mark *********** 1Z102073 长期筹资的特点和方式
#pragma mark 知识点:长期负债筹资
/*
 
 (一)长期借款筹资
 
     长期借款是企业向银行或其他非银行金融机构借入的使用期超过1年的借款，主要用于购建固定资产和满足长期流动资金占用的需要。
 
     企业在申请长期贷款时应具备的条件有:按计划发放、择优扶植、有物资保证、按期归还。
 
     长期借款的保护性条款包括一般性保护条款和特殊性保护条款。
 
     长期借款的偿还方式不一，包括:定期支付利息、到期一次性偿还本金的方式(加大借款到期时的还款压力);定期等额偿还方式(提高了实际利率);平时逐期偿还小额本金和利息、期末偿还余下的大额部分的方式。
 
     与其他长期负债筹资相比，长期借款筹资的特点为:
     (1) 筹资速度快。长期借款的手续比发行债券简单。
     (2) 借款弹性较大。企业与银行直接交涉，谈判以及再协商。
     (3) 借款成本较低。 长期借款利率一般低于债券利率，且筹资费用也较少。
     (4) 限制性条款较多，制约着借款的使用。
 
 (二)长期债券筹资
 
     是指期限超过1年的公司债券，发行目的通常是为建设大型项目筹集大笔长期资金。
 
     公司债券的发行价格通常有三种:平价、溢价和折价。
 
     公司公开发行债券通常需要由债券评信机构评定等级。
 
     与其他长期负债筹资方式相比，发行债券的突出优点在于筹资对象广、市场大。缺点是成本高、风险大、限制条件多。
 
 (三)融资租赁
 
     典型的融资租赁是长期的、完全补偿的、不可撤销的、由承租人负责维护的租赁。融资租赁最主要的外部特征就是租期长。
 
     1.融资租赁的特点
 
         (1) 承租人向出租人申请，出租人购买设备，设备的质量和技术上的检验由承租方负责。融资租赁的主要目的在于融通资金。
         (2) 租赁期限长。租赁期超过租赁资产经济寿命的75%以上。
         (3) 租赁期内，出租方不提供维修和保养服务。
         (4) 租赁合同稳定，租赁双方不得提前解除租赁合同。
         (5) 租赁期满后，承租方可退还，也可买下租赁物，还可以续租。
 
     2.融资租赁的优点
 
         (1) 融资与融物相结合，能够迅速获得长期资产的使用权;
         (2) 避免长期借款筹资所附加的限制性条款，具有较强的灵活性;
         (3) 减少设备引进费，从而降低设备取得成本;
         (4) 租赁费中的利息、手续费以及融资租赁设备的折旧费均可在税前支付，可以减轻所得税负担。
 
     融资租赁的出租人不能将融资租赁资产列入资产负债表，也不能对租赁资产提取固定资产折旧。承租人作为融资活动的债务人，应当采用与自有固定资产相一致的折旧政策计提租赁资产折旧。
 
     3.融资租赁的租金
 
         融资租赁的租金包括三大部分。
 
         (1) 租赁资产的成本:租赁资产的成本大体由资产的购买价、 运杂费、运输途中的保险费等项目构成;
         (2) 租赁资产成本的利息:即出租人向承租人所提供资金的利息;
         (3) 租赁手续费:包括出租人承办租赁业务的费用以及出租人 向承租人提供租赁服务所赚取的利润。
 
 (四)可转换债券筹资
 
     概念:可转换债券是一种允许持有人在规定的时间内按规定的价格转换为发行公司或其他公司普通股股票的有价证券。
 
     特点: 与普通债券相比，可转换债券可以根据债权人的选择在规定的时间转换为普通股股票，具有更大的灵活性，对投资者的吸引力较大。
 */
#pragma mark  知识点:长期股权筹资

/*
 
 (一)优先股股票筹资
 
     优先股较普通股而言具有一定的优先权。
 
     优先股筹资的优点有:
 
         1.优先股是公司的永久性资金。公司不必考虑偿还本金，这极大地减轻了公司的财务负担;
         2.优先股的股利标准是固定的，但支付却有一定的灵活性;
         3.优先股的发行，不会改变普通股股东对公司的控制权;
         4.发行优先股能够提高公司的举债能力。
 
 (二)普通股股票筹资
 
     普通股股票是股份有限公司发行的无特别权利的股份，是最基本的、标准的股票。
 
     普通股筹资与负债筹资方式相比，具有如下优点:
 
         1.普通股没有到期日，不需归还，是公司的一种永久性资金;
         2.每年分配给普通股股东的股利，取决于公司当年的盈利水平和所采取的股利分配政策，因此普通股没有固定的股利负担;
         3.普通股筹集的资本是公司最基本的资金来源，是公司举债的基础，并能够反映公司的实力，增强公司的举债能力;
         4.公司通过发行普通股可以起到对外宣传的作用，从而扩大公司的影响，提高公司的信誉和知名度。
 
 (三)认股权证筹资
 
     概念:认股权证是指由发行人所发行的附有特定条件的一种有价证券，它允许持有人按某一特定价格在规定的期限内购买既定数量的标的资产。
 
     从本质上看，认股权证的交易是一种期权的买卖，是以股票或其他证券为标的物的一种长期买进期权。
 
 */

#pragma mark  ******************************* 1Z102080 8.流动资产财务管理

#pragma mark *********** 1Z102081 现金和有价证券的财务管理

#pragma mark 知识点:现金和有价证券的概念
/*
 
 现金是企业流动性最强的资产。
 
 包括:库存现金、各种形式的银行存款、银行本票、银行汇票等。
 
 有价证券是现金的一种转换形式，其变现能力强，可以随时兑换成现金。
 
 有价证券是现金的替代品，获取收益是企业持有有价证券的原因。
 
 */

#pragma mark 知识点:现金管理的目标
/*
 
 企业置存现金的原因，主要是满足交易性、预防性和投机性需要。
 
 企业现金管理的目标，就是要在资产的流动性和盈利能力之间做出抉择，以获取最大的长期利益。
 
 */
#pragma mark 知识点:现金收支管理
/*
 
 现金收支管理的目的在于提高现金使用效率。
 
 应当做好以下工作:
 
     1.力争现金流量同步。
 
         企业要尽量使现金流入和现金流出发生的时间趋于一致。
 
     2.使用现金浮游量。
 
         从企业开出支票，到收票人收到支票并存入银行，至银行将款项划出企业账户，中间需要一段时间。现金在这段时间的占用称为现金浮游量。
 
     3.加速收款。
 
         主要是指缩短应收账款的时间。
 
     4.推迟应付款的支付。
 
 */
#pragma mark 知识点:最佳现金持有量
/*
 
 常用的确定现金持有量的方法有成本分析模式、存货模式和随机模式三种。
 
 成本分析模式是通过分析持有现金的成本，寻找持有成本最低的现金持有量。
 
 企业持有的现金，将会有三种成本:
 
     (1) 机会成本:企业占用资金的代价，与现金持有量之间呈 正比例关系。
     (2) 管理成本:是一种固定成本，与现金持有量之间无明显的比例关系。
     (3) 短缺成本:是因缺乏必要的资金，不能应付业务开支需要，而使企业 蒙受损失或为此付出的代价，与现金持有量呈反向变化。
 
 上述三项成本之和最小的现金持有量，就是最佳现金持有量。
 
 */


#pragma mark  *********** 1Z102082 应收账款的财务管理


#pragma mark 知识点:应收账款管理的目标
/*
 
 企业发生应收账款的主要原因是扩大销售，增强竞争力，那么其管理的目标就是求得利润。
 
 企业需要在应收账款信用政策所增加的盈利和这种政策的成本之间做出权衡。
 
 如果应收账款赊销有着良好的盈利前景，就应当放宽信用条件增加赊销量。
 
 */

#pragma mark 知识点:信用政策的确定
/*
 
 信用政策包括:信用期间、信用标准和现金折扣。
 
 信用期间是企业允许顾客从购货到付款之间的时间。延长信用期，会使销售额增加，与此同时，应收账款、收账费用和坏账损失都会增加。
 
 信用标准是指顾客获得企业的交易信用应具备的条件。通过“5C”系 统来评估某一顾客赖账的可能性。所谓“5C”系统， 是指评估顾客信用 品质的五个方面，即品质、能力、资本、条件和抵押。
 
 现金折扣是企业对顾客在商品价格上所做的扣减。主要目的 在于 吸引顾客为享受优惠而提前付款，缩短企业的平均收款期。另外， 也可借此扩大销售量。
 
 */

#pragma mark 知识点:应收账款的收账
/*
 
 一般来讲，应收账款拖欠时间越长，款项收回的可能性越小。形成坏账的可能性越大。对此，企业应实施严密的监督，随时掌握回收情况。实施对应收账款回收情况的监督，可以通过编制账龄分析表进行。
 
 企业的收账政策就是对各种不同过期账款制定不同的催收方式，包括准备为此付出的代价。
 
 */
#pragma mark *********** 1Z102083 存货的财务管理
#pragma mark 知识点:存货管理的目标

/*
 
 
 存货是指企业在生产经营过程中为销售或耗用而储备的物资，包括材料、燃料、低值易耗品、在产品、半成品、产成品、协作件、商品等。
 
 进行存货管理，就要尽力在各种存货成本与存货效益之间做出权衡，达到两者的最佳结合。这也就是存货管理的目标。
 
 */

#pragma mark 知识点:储备存货的有关成本
/*
 
 (一)取得成本
 
     取得成本指为取得某种存货而支出的成本。又分为订货成本和购置成本。
 
     订货成本指取得订单的成本，如办公费、差旅费、邮资、电报电话费等。订货成本中与订货次数无关的成本，如常设采购机构的基本开支等，称为订货的固定成本;与订货次数有关的成本，如差旅费、邮资等，称为订货的变动成本。
 
     购置成本指存货本身的价值，经常用数量与单价的乘积来确定。
 
         取得成本=订货成本+购置成本
                =订货固定成本+订货变动成本+购置成本
 
 (二)储存成本
 
     储存成本指为保持存货而发生的成本，包括存货占用资金所 应计的利息、仓库费用、保险费用、存货破损和变质损失等。
 
     储存成本也分为固定成本和变动成本。固定成本与存货数量的多少无关，如仓库折旧、仓库职工的固定月工资等。变动成本与存货的数量有关，如存货资金的应计利息、存货的破损和变质损失、存货的保险费用等。
 
     储存成本=储存固定成本+储存变动成本
 
 (三)缺货成本
 
     缺货成本指由于存货供应中断而造成的损失，包括材料供应中断造成的停工损失、产成品库存缺货造成的拖欠发货损失和丧失 销售机会的损失(还应包括需要主观估计的商誉损失); 如果生产 企业以紧急采购代用材料解决库存材料中断之急，那么缺货成本 表现为紧急额外购入成本(紧急额外购入的开支会大于正常采购的 开支)。
 
     存货的总成本=取得成本+储存成本+缺货成本
 
 */

#pragma mark 知识点:存货决策
/*
 
 存货的决策涉及四项内容:决定进货项目、选择供应单位、决定进货时间和决定进货批量。
 
 决定进货项目和选择供应单位是销售部门、采购部门和生产部门的职责。财务部门的职责是决定进货时间和进货批量。
 
 使存货的总成本最低的批量叫做经济订货量或经济批量。
 
 经济批量的理论模型推导结果为:
 
     Q' = (2KD/K2)开平方
 
 式中:
 Q’——经济订货量
 K ——每次定货的变动成本;
 D ——存货年需要量;
 K2 ——单位储存成本。
 
 */

#pragma mark 知识点:存货管理的ABC分析法
/*
 
 企业的存货划分为A、B、C三类。
 
 分类的标准主要有两个:一是金额标准;二是品种数量标准。
 
 A、B、C三类存货分别实行分品种重点管理、分类别一般控制 和按总额灵活掌握的存货管理方法。
 
 从财务管理的角度来看， A类存货虽然种类较少，但占用资金 较多，应集中主要精力，对其经济批量进行认真规划，实施严格控制;C类存货虽然种类繁多，但占用资金很少，可凭经验确定进货量; B类存货介于A类和C类之间，管理中根据实际情况采取灵活措施。
 
 */

#pragma mark - ****************************************************************** 1Z103000 建设工程估价(44个考点)【158页，52~55分】
#pragma mark 建设工程全过程的十个价格
/*
 
 
 项目建议书、可行性研究阶段     初步设计阶段     技术设计阶段    施工图设计阶段     发承包阶段                   施工阶段        竣工阶段
 
 投资估算                   工程概算         修正概算        施工图预算      招标控制价、投标价、合同价       中间结算        竣工结算、决算
 估算指标                   概算指标        概算定额          预算定额       预算定额、企业定额
 
 
 
 */
#pragma mark  ******************************* 1Z103010 1.建设工程项目总投资
#pragma mark *********** 1Z103011 建设工程项目总投资的组成

#pragma mark 知识点:建设工程项目总投资的概念
/*
 
 建设项目总投资
     建设投资
         工程费用
             建筑安装工程费
             设备及工器具购置费
         工程建设其他费
             土地使用费
             与项目建设有关的费用
             与企业未来生产经营有关的费用
         预备费
             基本预备费
             涨价预备费
         建设期利息
     铺底流动资金(全部流动资金的30%)
 
 建设投资分为静态投资部分和动态投资部分。
 静
 态投资部分由建筑安装工程费、设备及工器具购置费、工程建设其他费和基本预备费构成。
 
 动态投资部分是指在建设期内，因建设期利息和国家新批准的税费、汇率、利率变动以及建设期价格变动引起的建设投资增加额，包括涨价预备费、建设期利息等。
 
 
 */

#pragma mark *********** 1Z103012 设备及工器具购置费的组成

#pragma mark 知识点:设备购置费的组成和计算
/*
 
 设备购置费是指为建设工程项目购置或自制的达到固定资产标准的设备、工具、器具的费用。
 
 固定资产标准是指使用年限在一年以上，单位价值在国家或各主管部门规定的限额以上。
 
 设备购置费包括设备原价和设备运杂费，即:
 
     设备购置费=设备原价或进口设备抵岸价+设备运杂费
 
 式中，设备原价是指国产标准设备、非标准设备的原价。设备运杂费是指设备原价中未包括的包装和包装材料费、运输费、装卸费、采购及 仓库保管费、供销部门手续费等。 如果设备是由设备成套公司供应的， 成套公司的服务费也应 计入设备运杂费中。
 
 (一)国产标准设备原价
 
     国产标准设备原价一般指的是设备制造厂的交货价， 即出厂价。如设备由设备成套公司供应，则以订货合同价为设备原价。在计算设备原价时，一般按带有备件的出厂价计算。
 
 (二)国产非标准设备
 
     非标准设备原价有多种不同的计算方法，如成本计算估价法、系列设备插入估价法、分部组合估价法、定额估价法等。但无论哪种方法都应该使非标准设备计价的准确度接近实际出厂价，并且计算方法要简便。
 
 (三)进口设备抵岸价的构成及其计算
 
     进口设备抵岸价是指抵达买方边境港口或边境车站且交完关税以后的价格。
 
     1.进口设备的交货方式
 
         进口设备的交货方式可分为内陆交货类、目的地交货类和装运港交货类。
 
         1.内陆交货类即卖方在出口国内陆的某个地点完成交货任务。在交货地点，卖方及时提交合同规定的货物和有关凭证，并承担交货前的一切费用和风险;买方按时接受货物，交付货款，承担接货后的一切费用和风险，并自行办理出口手续和装运出口。货物的所有权也在交货后由卖方转移给买方。
 
         2.目的地交货类即卖方要在进口国的港口或内地交货，包括目的港船 上交货价，目的港船边交货价 (FOS) 和目的港码头交货价(关税已付)及 完税后交货价(进口国目的地的指定地点)。
 
             它们的特点是买卖双方承担的责任、费用和风险是以目的地约定交货点为分界线，只有当卖方在交货点将货物置于买方控制下方算交货，方能向买方收取货款。这类交货价对卖方来说承担的风险较大，在国际贸易中卖方一般不愿意采用这类交货方式。
 
         3.装运港交货类即卖方在出口国装运港完成交货任务。
             主要有装运港船上交货价 (FOB) ，习惯称为离岸价;
             运费在内价 (CFR) ;运费、保险费在内价 (CIF) ，习惯称为到岸价。
             它们的特点主要是:卖方按照约定的时间在装运港交货，只要卖方把合同规定的货物装船后提供货运单据便完成交货任务，并可凭单据收回货款。
 
             采用装运港船上交货价 (FOB) 时卖方的责任是:负责在合同规定 的装运港口和规定的期限内，将货物装上买方指定的船只并及时 通知买方;负责货物装船前的一切费用和风险;负责办理出口手续; 提供出口国政府或有关方面签发的证件;负责提供有关装运单据。
             买方的责任是:负责租船或订舱，支付运费，并将船期、船名 通知卖方;承担货物装船后的一切费用和风险;负责办理保险及 支付保险费，办理在目的港的进口和收货手续; 接受卖方提供的 有关装运单据，并按合同规定支付货款。
 
     2.进口设备抵岸价的构成
 
         进口设备如果采用装运港船上交货价 (FOB) ，其抵岸价构成为:
 
         进口设备抵岸价=货价+国外运费+国外运输保险费 +银行财务费+外贸手续费+进口关税+增值税+消费税
 
         (1) 进口设备货价=离岸价(FOB价)×人民币外汇牌价
         (2) 国外运费=离岸价×运费率
             国外运费=运量×单位运价
         (3) 运输保险费=(FOB+国外运费)×国外运输保险费率/(1-国外运输保险费率)
             运输保险费=[FOB+国际运费+运输保险费]×保险费率
         (4) 银行财务费=离岸价×人民币外汇牌价×银行财务费率
         (5) 外贸手续费=进口设备到岸价×人民币外汇牌价×外贸手续费率
             式中，进口设备到岸价 (CIF)= 离岸价+国外运费+国外运输保险费
         (6) 进口关税=到岸价(CIF)×人民币外汇牌价×进口关税率
         (7) 消费税=(CIF×人民币外汇牌价+关税)×消费税率/(1-消费税率)
             消费税=[CIF×人民币外汇牌价+关税+消费税]×消费税率
         (8) 进口产品增值税额=组成计税价格×增值税率
             组成计税价格=到岸价×人民币外汇牌价+进口关税+消费税
 
 (四)设备运杂费
 
     1.设备运杂费的构成
 
         (1) 国产标准设备由设备制造厂交货地点起至工地仓库(或施工组织设计指定的需要安装设备的堆放地点)止所发生的运费和装卸费。进口 设备则由我国到岸港口、边境车站起至工地仓库(或施工组织 设计指定的 需要安装设备的堆放地点)止所发生的运费和装卸费。
         (2) 在设备出厂价格中没有包含的设备包装和包装材料器具费;在设备 出厂价或进口设备价格中如已包括了此项费用，则不应重复计算。
         (3) 供销部门的手续费，按有关部门规定的统一费率计算。
         (4) 建设单位(或工程承包公司)的采购与仓库保管费。它是指采购、 验收、保管和收发设备所发生的各种费用，包括设备采购、保管和 管理人员工资、工资附加费、办公费、差旅交通费、设备供应部门 办公和仓库所占固定资产使用费、工具用具使用费、劳动保护费、 检验试验费等。这些费用可按主管部门规定的采购保管费率计算。
 
     2.设备运杂费的计算
 
         设备运杂费=设备原价×设备运杂费率
 
         式中，设备运杂费率按各部门及省、市等的规定计取。
 
         一般来讲，沿海和交通便利的地区，设备运杂费率相对低一些;内地和交通不便利的地区就要相对高一些，边远省份则要更高一些。对于非标准设备来讲，应尽量就近委托设备制造厂，以大幅度降低设备运杂费。进口设备由于原价较高，国内运距较短，因而运杂费比率应适当降低。
 
 
 */
#pragma mark 知识点:工器具及生产家具购置费的构成和计算
/*
 
 工器具及生产家具购置费是指新建项目或扩建项目初步设计规定 所必须购置的不够固定资产标准的设备、仪器、工卡模具、器具、 生产家具和备品备件的费用。其计算公式一般为:

     工器具及生产家具购置费=设备购置费×定额费率
 
 */

#pragma mark *********** 1Z103013 工程建设其他费的组成
#pragma mark 知识点:土地使用费
/*
 
 (一)农用土地征用费
 
     农用土地征用费由土地补偿费、安置补助费、土地投资补偿费、土地管理费、耕地占用税等组成，并按被征用土地的原用途给予补偿。
 
     征用耕地的补偿费用包括土地补偿费、安置补助费以及地上附着物和青苗的补偿费。
 
 (二)取得国有土地使用费
 
     取得国有土地使用费包括土地使用权出让金、城市建设配套费、房屋征收与补偿费等。
 
 */

#pragma mark 知识点:与项目建设有关的其他费用
/*
 
 (一)建设管理费
 
     建设管理费是指建设单位从项目筹建开始直至工程竣工验收合格或交付使用为止发生的项目建设管理费用。
 
     费用内容包括:
 
         1.建设单位管理费
 
             建设单位管理费是指建设单位发生的管理性质的开支。如建设管理采用工程总承包方式，其总包管理费由建设单位与总包单位根据总包工作范围在合同中商定，从建设管理费中支出。
 
                 建设单位管理费=工程费用×建设单位管理费费率
 
             工程费用是指建筑安装工程费用和设备及工器具购置费用之和。
 
         2. 工程监理费
 
             工程监理费是指建设单位委托工程监理单位实施工程监理的费用。由于工程监理是受建设单位委托的工程建设技术服务，属建设管理范畴。如采用监理，建设单位部分管理工作量转移至监理单位。监理费应根据委托的监理工作范围和监理深度在监理合同中商定或按当地或所属行业部门有关规定计算。
 
         3. 工程质量监督费
 
             工程质量监督费是指工程质量监督检验部门检验工程质量而收取的费用。
 
 (二)可行性研究费
 
     可行性研究费是指在建设工程项目前期工作中，编制和评估项目 建议书(或预可行性研究报告)、可行性研究报告所需的费用。
 
 (三)研究试验费
 
     研究试验费是指为本建设工程项目提供或验证设计数据、资料等进行必要的研究试验及按照设计规定在建设过程中必须进行试验、验证所需的费用。研究试验费按照研究试验内容和要求进行编制。
 
     研究试验费不包括以下项目:
     1.应由科技三项费用(即新产品试制费、中间试验费和重要科学研究 补助费)开支的项目。
     2. 应在建筑安装费用中列支的施工企业对建筑材料、构件和建筑物 进行一般鉴定、检查所发生的费用及技术革新的研究试验费。
     3. 应由勘察设计费或工程费用中开支的项目。
 
 (四)勘察设计费
 
     勘察设计费是指委托勘察设计单位进行工程水文地质勘察、
 
     工程设计所发生的各项费用。包括:
     1.工程勘察费;
     2. 初步设计费(基础设计费)、施工图设计费(详细设计费) ;
     3. 设计模型制作费。
 
 (五)环境影响评价费
 
     环境影响评价费是指按照规定，为全面、详细评价建设工程项目对环境可能产生的污染或造成的重大影响所需的费用。
     包括编制环境影响报告书(含大纲)、环境影响报告表和评估环境 影响报告书(含大纲)、评估环境影响报告表等所需的费用。
 
 (六)劳动安全卫生评价费
 
     劳动安全卫生评价费是指按照规定，为预测和分析建设工程项目存在的职业危险、危害因素的种类和危险危害程度，并提出先进、科学、合理行的劳动安全卫生技术和管理对策所需的费用。
 
     包括编制建设工程项目劳动安全卫生预评价大纲和劳动安全卫生预评价报告书以及为编制上述文件所进行的工程分析和环境现状调查等所需费用。
 
 (七)场地准备及临时设施费
 
     场地准备及临时设施费是指建设场地准备费和建设单位临时设施费。
 
     1.场地准备费是指建设工程项目为达到工程开工条件所发生的场地 平整和对建设场地遗留的有碍于施工建设的设施进行拆除清理的费用。
 
     2.临时设施费是指为满足施工建设需要而供到场地界区的，未列入工程费用的临时水、电、路、信、气等其他工程费用和建设单位的 现场临时建(构)筑物的搭设、维修、拆除、摊销或建设期间租赁费用， 以及施工期间专用公路或桥梁的加固、养护、维修等费用。此项费用 不包括已列入建筑安装工程费用中的施工单位临时设施费用。
 
     场地准备及临时设施应尽量与永久性工程统一考虑。建设场地的大型土石方工程应进入工程费用中的总图运输费用中。
 
     新建项目的场地准备和临时设施费应根据实际工程量估算，或按工程费用的比例计算。
 
     改扩建项目一般只计拆除清理费。
 
         场地准备和临时设施费=工程费用×费率+拆除清理费
 
     发生拆除清理费时可按新建同类工程造价或主材费、设备费的比例计算。凡可回收材料的拆除工程采用以料抵工方式冲抵拆除清理费。
 
 (八)引进技术和进口设备其他费
 
     引进技术及进口设备其他费用，包括出国人员费用、国外工程技术人员来华费用、技术引进费、分期或延期付款利息、担保费以及进口设备检验鉴定费。
 
 (九)工程保险费
 
     工程保险费是指建设工程项目在建设期间根据需要对建筑工程、安装工程、机器设备和人身安全进行投保而发生的保险费用。
 
     包括建筑安装工程一切险、进口设备财产保险和人身意外伤害险等。不包括已列入施工企业管理费中的施工管理用财产、车辆保险费。不投保的工程不计取此项费用。
 
 (十)特殊设备安全监督检验费
 
     特殊设备安全监督检验费是指在施工现场组装的锅炉及压力容器、压力管道、消防设备、燃气设备、电梯等特殊设备和设施，由安全监察部门按照有关安全监察条例和实施细则以及设计技术要求进行安全检验，应由建设工程项目支付的，向安全监察部门缴纳的费用。
 
     特殊设备安全监督检验费按照建设工程项目所在省(市、自治区) 安全监察部门的规定标准计算。无具体规定的，在编制技资估算和 概算时可按受检设备现场安装费的比例估算。
 
 (十一)市政公用设施建设及绿化补偿费
 
     市政公用设施建设及绿化补偿费是指使用市政公用设施的建设工程项目，按照项目所在地省级人民政府有关规定建设或缴纳的市政公用设施建设配套费用，以及绿化工程补偿费用。
 
     该项费用按工程所在地人民政府规定标准计列;不发生或按规定免征项目不计取。
 */

#pragma mark 知识点:与未来企业生产经营有关的其他费用
/*
 
 (一)联合试运转费
 
     联合试运转费是指新建项目或新增加生产能力的项目，在交付生产前按照批准的设计文件所规定的工程质量标准和技术要求，进行整个生产线或装置的负荷联合试运转或局部联动试车所发生的费用净支出(试运转支出大于收入的差额部分费用)。
 
     试运转支出包括试运转所需原材料、燃料及动力消耗、低值易耗品、其他物料消耗、工具用具使用费、机械使用费、保险金、施工单位参加试运转人员工资以及专家指导费等;试运转收入包括试运转期间的产品销售收入和其他收入。
 
     联合试运转费不包括应由设备安装工程费用开支的调试及试车费用，以及在试运转中暴露出来的因施工原因或设备缺陷等发生的处理费用。
 
     不发生试运转或试运转收入大于(或等于)费用支出的工程，不列此项 费用。
 
     当联合试运转收入小于试运转支出时:
 
         联合试运转费=联合试运转费用支出-联合试运转收入
 
 (二)生产准备费
 
     生产准备费是指新建项目或新增生产能力的项目，为保证竣工交付使用进行必要的生产准备所发生的费用。
 
     费用内容包括:
 
     (1)生产职工培训费。自行培训、委托其他单位培训人员的工资、工资'性补贴、职工福利费、差旅交通费、学习资料费、学费、劳动 保护费。
 
     (2) 生产单位提前进厂参加施工、设备安装、调试等以及熟悉 工艺流程及设备性能等人员的工资、工资性补贴、职工福利费、 差旅交通费、劳动保护费等。
 
         新建项目按设计定员为基数计算，改扩建项目按新增设计定员 为基数计算: 生产准备费=设计定员×生产准备费指标(元/人)
 
 (三)办公和生活家具购置费
 
     办公和生活家具购置费是指为保证新建、改建、扩建项目初期正常生产、使用和管理所必须购置的办公和生活家具、用具的费用。
 
     改建、扩建项目所需的办公和生活用具购置费，应低于新建项目。其范围包括办公室、会议室、资料档案室、阅览室、文娱室、食堂、浴室、理发室和单身宿舍等。
 
     这项费用按照设计定员人数乘以综合指标计算。
 */

#pragma mark  *********** 1Z103014 预备费的组成


#pragma mark 知识点:基本预备费
/*
 
 基本预备费是指在项目实施中可能发生难以预料的支出，需要预先 预留的费用，又称不可预见费。主要指设计变更及施工过程中可能 增加工程量的费用。计算公式为:
 
     基本预备费=(设备及工器具购置费+建筑安装工程费+工程建设其他费) ×基本预备费率
 
 */

#pragma mark 知识点:涨价预备费
/*
 
 涨价预备费是指建设工程项目在建设期内由于价格等变化引起 投资增加，需要事先预留的费用。涨价预备费以建筑安装工程费、 设备及工器具购置费之和为计算基数。计算公式为:
 
    PC = （It[(1+f)t次方 - 1 ]）n期求和
 
 公式中
     PC -- 涨价预备费
     It -- 第t年的建筑安装工程费、设备及工器具购置费之和
     n  -- 建设期
     f  -- 建设期价格上涨指数
 */
#pragma mark ***********  1Z103015 建设期利息的计算
#pragma mark 知识点:建设期利息的计算
/*
 
 
 建设期利息是指项目借款在建设期内发生并计入固定资产的利息。 为了简化计算，在编制投资估算时通常假定借款均在每年的年中 支用，借款第一年按半年计息，其余各年份按全年计息。
 
 计算公式为:
 
     各年应计利息=(年初借款本息累计+本年借款额/2) ×年利率
 
 */

#pragma mark  ******************************* 1Z103020 3.建筑安装工程费用项目的组成与计算
#pragma mark *********** 1Z103021 按费用构成要素划分的建筑安装工程费用项目组成

/*
 
 按照费用构成要素划分，建筑安装工程费由人工费、材料(包含 工程设备，下同)费、施工机具使用费、企业管理费、利润、规费和 税金组成。
 
 其中人工费、材料费、施工机具使用费、企业管理费和利润 包含 在分部分项工程费、措施项目费、其他项目费中。
 
 
 建筑安装工程费
 
     人工费
         1.计时工资或计件工资 2.奖金 3.津贴补贴 4.加班加点工资 5.特殊情况下支付的工资
     材料费
         1.材料原价 2.运杂费 3.运输损耗费 4.采购及保管费
     施工机具使用费
         1.施工机械使用费 1折旧费 2大修理费 3经常修理费 4安拆费及场外运费 5人工费 6燃料动力费 7税费
         2.仪器仪表使用费
     企业管理费
         1.管理人员工资 2.办公费 3.差旅交通费 4.固定资产施工费 5.工具用具使用费  6.劳动保险和职工福利费 7.劳动保护费 8.检验试验费 9.工会经费 10.职工教育经费
         11.财产保险费 12.财务费 13.税金 14 .城市维护建 设税 15.教育费附加 16.地方教育附加 17.其他
     利润
     规费
         1.社会保险费 2.住房公积金 3.工程排污费
     税金
 
 
 */

#pragma mark  知识点:人工费
/*
 
 人工费是指按工资总额构成规定，支付给从事建筑安装工程施工 的生产工人和附属生产单位工人的各项费用。内容包括:
 1.计时工资或计件工资:是指按计时工资标准和工作时间或对已做 工作按计件单价支付给个人的劳动报酬。
 2. 奖金:是指对超额劳动和增收节支支付给个人的劳动报酬。如 节约奖、劳动竞赛奖等。
 3. 津贴补贴:是指为了补偿职工特殊或额外的劳动消耗和因其他 特殊原因支付给个人的津贴，以及为了保证职工工资水平不受物价 影响支付给个人的物价补贴。如流动施工津贴、特殊地区施工津贴、 高温(寒) 作业临时津贴、高空津贴等。
 4. 加班加点工资是指按规定支付的在法定节假日工作的加班工资和 在法定日工作时间外延时工作的加点工资。
 5. 特殊情况下支付的工资:是指根据国家法律、法规和政策规定， 因病、工伤、产假、计划生育假、婚丧假、事假、探亲假、定期休假、 停工学习、执行国家或社会义务等原因按计时工资标准或计时工资 标准的一定比例支付的工资。
 
 */
#pragma mark 知识点:材料费
/*
 
 材料费是指施工过程中耗费的原材料、辅助材料、构配件、零件、半成品 或成品、工程设备的费用。内容包括:
 
     1. 材料原价:是指材料、工程设备的出厂价格或商家供应价格。
     2. 运杂费:是指材料、工程设备自来源地运至工地仓库或指定堆放地点所 发生的全部费用。
     3. 运输损耗费:是指材料在运输装卸过程中不可避免的损耗。
     4. 采购及保管费:是指为组织采购、供应和保管材料、工程设备的过程中 所需要的各项费用。包括采购费、仓储费、工地保管费、仓储损耗。
 
 工程设备是指构成或计划构成永久工程一部分的机电设备、金属结构设备、仪器装置及其他类似的设备和装置。
 
 */
#pragma mark 知识点:施工机具使用费
/*
 
 施工机具使用费是指施工作业所发生的施工机械、仪器仪表使用费或其租赁费。内容包括:
 
 1.施工机械使用费:以施工机械台班耗用量乘以施工机械台班单价表示， 施工机械台班单价应由下列七项费用组成:
 
     (1) 折旧费是指施工机械在规定的使用年限内，陆续收回其原值的费用。
     (2) 大修理费是指施工机械按规定的大修理间隔台班进行必要的大修理， 以恢复其正常功能所需的费用。
     (3) 经常修理费是指施工机械除大修理以外的各级保养和临时故障排除 所需的费用。包括为保障机械正常运转所需替换设备与随机配备工具附具 的摊销和维护费用，机械运转中日常保养所需润滑与擦拭的材料费用及机 械停滞期间的维护和保养费用等。
     (4) 安拆费及场外运费:安拆费指施工机械(大型机械除外)在现场进 行安装与拆卸所需的人工、材料、机械和试运转费用以及机械辅助设施 的折旧、搭设、拆除等费用;场外运费指施工机械整体或分体自停放地 点 运至施工现场或由一施工地点运至另一施工地点的运输、装卸、辅助 材料及架线等费用。
     (5) 人工费是指机上司机(司炉)和其他操作人员的人工费。
     (6) 燃料动力费是指施工机械在运转作业中所消耗的各种燃料及水、 电等产生的费用。
     (7) 税费是指施工机械按照国家规定应缴纳的车船使用税、保险费及 年检费等。
 
 2. 仪器仪表使用费是指工程施工所需使用的仪器仪表的摊销及维修 费用。
 
 */


#pragma mark 知识点:企业管理费
/*
 
 企业管理费是指建筑安装企业组织施工生产和经营管理所需的费用。
 
 内容包括:
 
     1.管理人员工资:是指按规定支付给管理人员的计时工资、奖金、 津贴补贴、加班加点工资及特殊情况下支付的工资等。
     2. 办公费:是指企业管理办公用的文具、纸张、账表、印刷、邮电、 书报、办公软件、现场监控、会议、水电、烧水和集体取暖降温(包括 现场临时宿舍取暖降温)等费用。
     3. 差旅交通费:是指职工因公出差调动工作的差旅费、住勤补助费， 市内交通费和误餐补助费，职工探亲路费，劳动力招募费，职工退休、 退职一次性路费，工伤人员就医路费，工地转移费以及管理部门使用的 交通工具的油料、燃料等费用。
     4. 固定资产使用费:是指管理和试验部门及附属生产单位使用的 属于固定资产的房屋、设备、仪器等的折旧、大修、维修或租赁费。
     5. 工具用具使用费:是指企业施工生产和管理使用的不属于固定 资产的工具、器具、家具、交通工具和检验、试验、测绘、消防用具 等的购置、维修和摊销费。
     6. 劳动保险和职工福利费:是指由企业支付的职工退职金、按规定 支付给离休干部的经费，集体福利费、夏季防暑降温费、冬季取暖补 贴、上下班交通补贴等。
     7. 劳动保护费:是企业按规定发放的劳动保护用品的支出。如工作 服、手套、防暑降温饮料以及在有碍身体健康的环境中施工的保健费 用等。
     8. 检验试验费:是指施工企业按照有关标准规定，对建筑以及材料、 构件和建筑安装物进行一般鉴定、检查所发生的费用，包括自设试验室 进行试验所耗用的材料等费用。不包括新结构、新材料的试验费，对 构件做破坏性试验及其他特殊要求检验试验的费用和发包人委托检测 机构进行检测的费用，对此类检测发生的费用，由发包人在工程建设 其他费用中列支。但对施工企业提供的具有合格证明的材料进行检测 其结果不合格的，该检测费用由施工企业支付。
     9. 工会经费是指企业按《工会法》规定的全部职工工资总额比例 计提的工会经费。
     10. 职工教育经费是指按职工工资总额的规定比例计提，企业为 职工进行专业技术和职业技能培训，专业技术人员继续教育、职工 职业技能鉴定、职业资格认定以及根据需要对职工进行各类文化教育 所发生的费用。
     11.财产保险费是指施工管理用财产、车辆等的保险费用。
     12. 财务费是指企业为施工生产筹集资金或提供预付款担保、履约 担保、职工工资支付担保等所发生的各种费用。
     13. 税金是指企业按规定缴纳的房产税、车船使用税、土地使用税、 印花税等。
     14. 城市维护建设税是指为了加强城市的维护建设，扩大和稳定 城市维护建设资金的来源，规定凡缴纳消费税、增值税的单位和个人， 都应当依照规定缴纳城市维护建设税。城市维护建设税税率如下: 1)纳税人所在地在市区的，税率为 7%;2) 纳税人所在地在县城、 镇的，税率为 5%; 3) 纳税人所在地不在市区、县城或镇的，税率为 1%。
     15. 教育费附加:是对缴纳增值税、消费税的单位和个人征收的一种 附加费。其作用是为了发展地方性教育事业，扩大地方教育经费的资金 来源。以纳税人实际缴纳的增值税、消费税的税额为计费依据，教育费 附加的征收率为 3%。
     16. 地方教育附加:按照《关于统一地方教育附加政策有关问题的 通知》 (财综 [2010]98 号)要求，各地统一征收地方教育附加，地方 教育附加征收标准为单位和个人实际缴纳的增值税和消费税税额的 2%。
     17. 其他:包括技术转让费、技术开发费、投标费、业务招待费、 绿化费、广告费、公证费、法律顾问费、审计费、咨询费、保险费等。
 
 */

#pragma mark 知识点:利润
/*
 
 利润是指施工企业完成所承包工程获得的盈利。
 
 */

#pragma mark 知识点:规费
/*
 
 规费是指按国家法律、法规规定，由省级政府和省级有关权力部门
 
 规定必须缴纳或计取的费用。包括:
 
 1.社会保险费
 
     (1) 养老保险费:是指企业按照规定标准为职工缴纳的基本养老保险费。
     (2) 失业保险费:是指企业按照规定标准为职工缴纳的失业保险费。
     (3) 医疗保险费:是指企业按照规定标准为职工缴纳的基本医疗保险费。
     (4) 生育保险费:是指企业按照规定标准为职工缴纳的生育保险费。
     (5) 工伤保险费:是指企业按照规定标准为职工缴纳的工伤保险费。
 
 2. 住房公积金:是指企业按规定标准为职工缴纳的住房公积金。
 3. 工程排污费:是指按规定缴纳的施工现场工程排污费。
 
 其他应列而未列入的规费，按实际发生计取。
 */

#pragma mark 知识点:增值税
/*
 
 增值税是以商品(含应税劳务)在流转过程中产生的增值额作为计税 依据而征收的一种流转税。从计税原理上说，增值税是对商品生产、 流通、劳务服务中多个环节的新增价值或商品的附加值征收的一种 流转税。
 
 建筑业营改增后，工程造价按"价税分离"计价规则计算，具体要素 价格适用增值税税率执行财税部门的相关规定。
 
 税前工程造价为人工费、材料费、施工机具使用费、企业管理费、 利润和规费之和，各费用项目均以不包含增值税(可抵扣进项税额)的 价格计算。
 
 */
#pragma mark ***********  1Z103022 按造价形成划分的建筑安装工程费用项目组成
/*
 建筑安装工程费按照工程造价形成由分部分项工程费、措施项目费、其他项目费、规费、税金组成。
 
 分部分项工程费、措施项目费、其他项目费包含人工费、材料费、施工机具使用费、企业管理费和利润。
 
 建筑安装工程费

     分部分项工程费
         1.房屋建筑与装饰工程 1土石方工程 2桩基工程······
         2.仿古建筑工程
         3.通用安装工程
         4.市政工程
         5.园林绿化工程
         6.矿山工程
         7.构筑物工程
         8.城市轨道交通工程
         9.爆破工程
         ······
     措施项目费
         1.安全文明施工费 2.夜间施工增加费 3.二次搬运费 4.冬雨季施工增加费 5.已完工程及设备保护费 6.工程定位复测费 7.特殊地区施工增加费 8.大型机械进出场及安拆费 9.脚手架工程费 ······
     其他项目费
         1.暂列金额 2.计日工 3.总承包服务费
     规费
         1.社会保险费  2.住房公积金 3.工程排污费
     税金——增值税
 
 */
#pragma mark 知识点:分部分项工程费
/*
 
 分部分项工程费是指各专业工程的分部分项工程应予列支的各项费用。
 
 1.专业工程:是指按现行国家计量规范划分的房屋建筑与装饰工程、 仿古建筑工程、通用安装工程、市政工程、园林绿化工程、矿山工程、 构筑物工程、城市轨道交通工程、爆破工程等各类工程。
 2. 分部分项工程:指按现行国家计量规范对各专业工程划分的项目。 如房屋建筑与装饰工程划分的土石方工程、地基处理与桩基工程、砌筑 工程、钢筋及钢筋混凝土工程等。
 
 各类专业工程的分部分项工程划分见现行国家或行业计量规范。
 
 */

#pragma mark 知识点:措施项目费
/*
 
 措施项目费是指为完成建设工程施工，发生于该工程施工前和施工 过程中的技术、生活、安全、环境保护等方面的费用。内容包括:
 
 1.安全文明施工费
 
     (1) 环境保护费是指施工现场为达到环保部门要求所需要的各项 费用。
     (2) 文明施工费是指施工现场文明施工所需要的各项费用。
     (3) 安全施工费是指施工现场安全施工所需要的各项费用。
     (4) 临时设施费是指施工企业为进行建设工程施工所必须搭设的生活和生产用的临时建筑物、构筑物和其他临时设施费用。包括临时设施的搭设、维修、拆除、清理费或摊销费等。
 
 2. 夜间施工增加费:是指因夜间施工所发生的夜班补助费、夜间 施工降效、夜间施工照明设备摊销及照明用电等费用。
 3. 二次搬运费:是指因施工场地条件限制而发生的材料、构配件、 半成品等一次运输不能到达堆放地点，必须进行二次或多次搬运所 发生的费用。
 4. 冬雨季施工增加费:是指在冬季或雨季施工需增加的临时设施、 防滑、排除雨雪，人工及施工机械效率降低等费用。
 5. 已完工程及设备保护费:是指竣工验收前，对已完工程及设备 采取的必要保护措施所发生的费用。
 6. 工程定位复测费:是指工程施工过程中进行全部施工测量放线和 复测工作的费用。
 7. 特殊地区施工增加费是指工程在沙漠或其边缘地区、高海拔、高 寒、原始森林等特殊地区施工增加的费用。
 8. 大型机械设备进出场及安拆费是指机械整体或分体自停放场地运 至施工现场或由一个施工地点运至另一个施工地点，所发生的机械进 出场运输及转移费用及机械在施工现场进行安装、拆卸所需的人工费、 材料费、机械费、试运转费和安装所需的辅助设施的费用。
 9. 脚手架工程费是指施工需要的各种脚手架搭、拆、运输费用 以及脚手架购置费的摊销(或租赁)费用。措施项目及其包含的内容详见各类专业工程的现行国家或行业计量规范。
 
 */

#pragma mark 知识点:其他项目费
/*
 
 1.暂列金额:是指发包人在工程量清单中暂定并包括在工程合同价 款中的一笔款项。用于施工合同签订时尚未确定或者不可预见的所需 材料、工程设备、服务的采购，施工中可能发生的工程变更、合同约 定调整因素出现时的工程价款调整以及发生的索赔、现场签证确认等 的费用。
 2. 计日工:是指在施工过程中，承包人完成发包人提出的施工图纸 以外的零星项目或工作所需的费用。
 3. 总承包服务费:是指总承包人为配合、协调发包人进行的专业 工程发包，对发包人自行采购的材料、工程设备等进行保管以及施工 现场管理、竣工资料汇总整理等服务所需的费用。
 
 */

#pragma mark ***********  1Z103023 建筑安装工程费用计算方法
#pragma mark 知识点:各费用构成要素计算方法
/*
 
 1.人工费
 
     人工费=Σ(工程工日消耗量×日工资单价)
 
     日工资单价是指施工企业平均技术熟练程度的生产工人在每工作日 (国家法定工作时间内)按规定从事施工作业应得的日工资总额。
 
     工程造价管理机构确定日工资单价应根据工程项目的技术要求， 通过市场调查，参考实物工程量人工单价综合分析确定，最低日工资 单价不得低于工程所在地人力资源和社会保障部门所发布的最低工资 标准的:普工1.3 倍;一般技工2 倍;高级技工3 倍。
 
     工程计价定额不可只列一个综合工日单价，应根据工程项目技术要求和工种差别适当划分多种日人工单价，确保各分部工程人工费的合理构成。
 
 2.材料费
 
     (1)材料费
 
         材料费=∑(材料消耗量×材料单价)
         材料单价=(材料原价+运杂费)×(1+运输损耗率)×(1+采购保管费率)
 
     (2) 工程设备费
 
         工程设备费=∑(工程设备量×工程设备单价)
         工程设备单价=(设备原价+运杂费)×[1+采购保管费率(%)]
 
 3. 施工机具使用费
 
     (1)施工机械使用费
 
         施工机械使用费=∑(施工机械台班消耗量×机械台班单价)
         机械台班单价=台班折旧费+台班大修费+台班经常修理费+台班安拆费及场外运费+台班人工费 +台班燃料动力费+台班车船税费
 
         1) 台班折旧费=机械预算价格 ×(1-残值率) / 耐用总台班数
 
             耐用总台班数=折旧年限×年工作台班
 
         2) 台班大修理费=一次大修理费×大修次数/ 耐用总台班数
 
             注:工程造价管理机构在确定计价定额中的施工机械使用费时，应根据《建筑施工机械台班费用计算规则》结合市场调查编制施工 机械台班单价。施施工企业可以参考工程造价管理机构发布的台班 单价，自主确定施工机械使用费的报价，如租赁施工机械，公式为: 施工机械使用费=∑(施工机械台班消耗量×机械台班租赁单价)
 
     (2) 仪器仪表使用费
 
         仪器仪表使用费=工程使用的仪器仪表摊销费+维修费
 
 4. 企业管理费费率
 
     (1) 以直接费为计算基础
 
         企业管理费费率（%） = 生产工人年平均管理费 / 年有效施工天数 * 人工费占分部分项工程费比例（%）
         企业管理费费率（%） = 生产工人年平均管理费 / (年有效施工天数 / 人工费占直接费的比例） * 100%
 
     (2) 以人工费和机械费合计为计算基础
 
         企业管理费费率（%） = 生产工人年平均管理费 / (年有效施工天数 * （人工单价 + 每一台班施工机具使用费）） * 100%
 
     (3) 以人工费为计算基础

         企业管理费费率（%） = 生产工人年平均管理费 / (年有效施工天数 * 人工单价 ） * 100%

 5. 利润
 
     (1) 施工企业根据企业自身需求并结合建筑市场实际自主确定， 列入报价中。
     (2) 工程造价管理机构在确定计价定额中利润时，应以定额人工费 或定额人工费与定额机械费之和作为计算基数，其费率根据历年工程 造价积累的资料，并结合建筑市场实际确定，以单位(单项)工程测算， 利润在税前建筑安装工程费的比重可按不低于 5% 且不高于 7% 的 费率计算。利润应列入分部分项工程和措施项目中。
 
 6. 规费
 
     (1) 社会保险费和住房公积金
 
         社会保险费和住房公积金应以定额人工费为计算基础，根据工程所在地省、自治区、直辖市或行业建设主管部门规定费率计算。
 
             社会保险费和住房公积金=∑(工程定额人工费×社会保险费率和住房公积金费率)
 
         式中:社会保险费率和住房公积金费率可按每万元发承包价的生产 工人人工费、管理人员工资含量与工程所在地规定的缴纳标准综合 分析取定。
 
     (2) 工程排污费
 
         工程排污费等其他应列而未列入的规费应按工程所在地环境保护等部门规定的标准缴纳，按实计取列入。
 
 7. 增值税
 
     建筑安装工程费用的税金是指国家税法规定应计入建筑安装工程造价的增值税销项税额。
 
     工程造价可按以下公式计算:
 
         工程造价=税前工程造价×(1+11%)
 
     式中 11% 为建筑业适用增值税税率。由此，税金计算公式:
 
         税金=税前工程造价×税率(或征收率)
     或  税金={工程造价/[1+税率(或征收率)]} ×税率(或征收率)
 
     税前工程造价为人工费、材料费、施工机具使用费、企业管理费、 利润和规费之和，各费用项目均以不包含增值税(可抵扣进项税额)的 价格计算。
 
 */

#pragma mark 知识点:建筑安装工程计价公式

/*
 
 1.分部分项工程费
 
         分部分项工程费=∑(分部分项工程量×综合单价)
 
     式中:综合单价包括人工费、材料费、施工机具使用费、企业管理费 和利润以及一定范围的风险费用(下同)。
 
 2. 措施项目费

     (1) 国家计量规范规定应予计量的措施项目，其计算公式为:
 
         措施项目费=∑(措施项目工程量×综合单价)
 
     (2) 国家计量规范规定不宜计量的措施项目计算方法如下:
 
         1) 安全文明施工费
 
             安全文明施工费=计算基数×安全文明施工费费率(%)
 
         计算基数应为定额基价(定额分部分项工程费+定额中可以计量的 措施项目费)、定额人工费或(定额人工费+定额机械费) ，其费率由 工程造价管理机构根据各专业工程的特点综合确定。
 
         2) 夜间施工增加费 夜间施工增加费=计算基数×夜间施工增加费费率(%)
         3) 二次搬运费 二次搬运费=计算基数×二次搬运费费率(%)
         4) 冬雨期施工增加费 冬雨期施工增加费=计算基数×冬雨期施工增加费费率(%)
         5) 已完工程及设备保护费
 
             已完工程及设备保护费=计算基数×已完工程及设备保护费费率(%)
 
         上述 2) ~5) 项措施项目的计费基数应为定额人工费或(定额人工费 +定额机械费) ，其费率由工程造价管理机构根据各专业工程特点和调 查资料综合分析后确定。
 
 3. 其他项目费
 
     (1) 暂列金额由发包人根据工程特点，按有关计价规定估算，施工 过程中由发包人掌握使用、扣除合同价款调整后如有余额，归发包人。
     (2) 计日工由发包人和承包人按施工过程中的签证计价。
     (3) 总承包服务费由发包人在招标控制价中根据总包服务范围和有关 计价规定编制，承包人投标时自主报价，施工过程中按签约合同价执行。
 
 4. 规费和税金
 
     发包人和承包人均应按照省、自治区、直辖市或行业建设主管部门发布的标准计算规费和税金，不得作为竞争性费用。
 
 */



#pragma mark  ******************************* 1Z103030 4.建设工程定额
#pragma mark ***********  1Z103031 建设工程定额的分类

#pragma mark 知识点:建设工程定额的分类

/*
 
 (一)按生产要素内容分类
 
     1.人工定额
 
         人工定额也称劳动定额，是指在正常的施工技术和组织条件下，完成单位合格产品所必需的人工消耗量标准。
 
     2. 材料消耗定额
 
         材料消耗定额是指在合理和节约使用材料的条件下，生产单位合格产品所必须消耗的一定规格的材料、成品、半成品和水、电等资源的数量标准。
 
     3. 施工机械台班使用定额
 
         施工机械台班使用定额也称施工机械台班消耗定额，是指施工机械在正常施工条件下完成单位合格产品所必需的工作时间。它反映了合理地、均衡地组织劳动和使用机械时该机械在单位时间内的生产效率。
 
 (二)按编制程序和用途分类
 
     1.施工定额
 
         施工定额是以同一性质的施工过程工序作为研究对象，表示生产产品数量与时间消耗综合关系的定额。施工定额是施工企业(建筑 安装企业)为组织生产和加强管理在企业内部使用的一种定额，属于 企业定额的性质。施工定额是建设工程定额中分项最细、定额子目 最多的一种定额，也是建设工程定额中的基础性定额。施工定额由 人工定额、材料消耗定额和施工机械 台班使用定额所组成。
 
         施工定额是施工企业进行施工组织、成本管理、经济核算和投标报价的重要依据。施工定额直接应用于施工项目的管理，用来 编制施工作业计划、签发施工任务单、签发限额领料单以及结算 计件工资或计量奖励工资等。施工定额和施工生产结合紧密，施工 定额的定额水平反映施工企业生产与 组织的技术水平和管理水平。 施工定额也是编制预算定额的基础。
 
     2. 预算定额
 
         预算定额是以建筑物或构筑物各个分部分项工程为对象编制的定额。预算定额是以施工定额为基础综合扩大编制的，同时也是编制概算定额的基础。其中的人工、材料和机械台班的消耗水平根据施工定额综合取定，定额项目的综合程度大于施工定额。
 
         预算定额是编制施工图预算的主要依据，是编制单位估价表、确定工程造价、控制建设工程投资的基础和依据。

         预算定额是社会性的，而施工定额则是企业性的。
 
     3. 概算定额
 
         概算定额是以扩大的分部分项工程为对象编制的定额。概算定额是编制扩大初步设计概算、确定建设项目投资额的依据。概算定额一般是在预算定额的基础上综合扩大而成的，每一综合分项概算定额都包含了数项预算定额。
 
     4. 概算指标
 
         概算指标是概算定额的扩大与合并，它是以整个建筑物和构筑物为对象，以更为扩大的计量单位来编制的。概算指标的设定和初步设计的深度相适应，一般是在概算定额和预算定额的基础上编制的，是设计单位编制设计概算或建设单位编制年度投资计划的依据，也可作为编制估算指标的基础。
 
     5. 投资估算指标
 
         投资估算指标通常是以独立的单项工程或完整的工程项目为对象编制确定的生产要素消耗的数量标准或项目费用标准，是根据已建工程或现有工程的价格数据和资料，经分析、归纳和整理编制而成的。投资估算指标是在项目建议书和可行性研究阶段编制投资估算、计算投资需要量时使用的一种指标，是合理确定建设工程项目投资的基础。
 
 
                    施工定额                                预算定额               概算定额             概算指标                投资估算指标
 
     对象             工序                               分部分项工程         扩大的分部分项工程       整个建筑物或构筑物       单项工程或完整工程项目
 
     用途    编制施工预算、施工作业计划、签发施工任务单、       编制施工图预算及     编制扩大的初步设计概算，    编制初步设计概算、          编制投资估算、
            限额领料单、编制预算定额的基础                   概算定额的基础      确定建设项目投资的依据      编制估算指标的基础          计算投资需要量
 
     项目划分         最细                                    细                   较粗                  粗                      很粗
     定额水平       平均先进                                   平均                 平均                  平均                     平均
     性质          企业性质                                  社会性质             社会性质                社会性质                 社会性质
 
 (三)按编制部门和适用范围分类
 
     1. 国家定额
     2. 行业定额
     3. 地区定额
     4. 企业定额
 
 (四)按投资的费用性质分类
 
     1. 建筑工程定额
     2. 设备安装工程定额
     3. 建筑安装工程费用定额
     4. 工器具定额
     5. 工程建设其他费用定额
 */
#pragma mark  *********** 1Z103032 人工定额的编制

#pragma mark 知识点:人工定额的编制
/*
 
 (一)工人工作时间消耗的分类
 
     工人在工作班内消耗的工作时间，按其消耗的性质，基本可以分为两大类:必需消耗的时间和损失时间。
 
     必需消耗的时间是工人在正常施工条件下，为完成一定产品(工作任务)所消耗的时间。它是制定定额的主要依据。
 
     损失时间，是与产品生产无关，而与施工组织和技术上的缺陷有关，与工人在施工过程中的个人过失或某些偶然因素有关的时间消耗。
 
     1.必需消耗的工作时间，包括有效工作时间、休息时间和不可避免的中断时间。
 
         (1) 有效工作时间包括基本工作时间、辅助工作时间、准备与结束工作时间。
 
             基本工作时间是工人完成一定产品的施工工艺过程所消耗的时间。基本工作时间所包括的内容依工作性质各不相同，基本工作时间的长短和工作量大小成正比例。
 
             辅助工作时间是指为保证基本工作能顺利完成所消耗的时间。在辅助工作时间里，不能使产品的形状大小、性质或位置发生变化。辅助工作时间的结束，往往就是基本工作时间的开始。辅助工作一般是手工操作，但如果在机手并动的情况下，辅助工作是在机械运转过程中进行的，为避免重复则不应再计辅助工作时间的消耗。
 
            准备与结束工作时间是执行任务前或任务完成后所消耗的工作时间。如工作地点、劳动工具和劳动对象的准备工作时间，工作结束后的整理工作时间等。准备和结束工作时间的长短与所担负的工作量大小无关，但往往和工作内容有关。准备与结束工作时间可以分为班内的准备与结束工作时间和任务的准备与结束工作时间。
 
         (2) 不可避免的中断时间是指由于施工工艺特点引起的工作中断所必需的时间。与施工过程、工艺特点有关的工作中断时间，应包括在定额时间内，但应尽量缩短此项时间消耗。与工艺特点无关的工作中断所占用时间，是由于劳动组织不合理引起的，属于损失时间，不能计入定额时间。
 
         (3) 休息时间是工人在工作过程中为恢复体力所必需的短暂休息和生理需要的时间消耗。这种时间是为了保证工人精力充沛地进行工作， 所以在定额时间中必须进行计算。休息时间的长短和劳动条件有关， 劳动越繁重紧张、劳动条件越差(如高温) ，则休息时间越长。
 
 
     2. 损失时间中包括多余和偶然工作、停工、违背劳动纪律所引起的 损失时间。
 
         (1) 多余工作是指工人进行了任务以外而又不能增加产品数量的 工作。多余工作的工时损失，一般都是由于工程技术人员和工人的 差错而引起的，因此，不应计入定额时间。
 
             偶然工作也是工人在任务外进行的工作，但能够获得一定产品。如抹灰工不得不补上偶然遗留的墙洞等。由于偶然工作能获得一定产品，拟定定额时要适当考虑它的影响。

         (2) 停工时间是工作班内停止工作造成的工时损失。停工时间按其性质可分为施工本身造成的停工时间和非施工本身造成的停工时间两种。
 
             施工本身造成的停工时间是由于施工组织不善、材料供应不及时、工作面准备工作做得不好、工作地点组织不良等情况引起的停工时间。在拟定定额时不应该计算。
 
             非施工本身造成的停工时间，是由于水源、电源、中断引起的停工时间。在定额中应给予合理的考虑。
 
         (3) 违背劳动纪律造成的工作时间损失，是指工人在工作班开始和 午休后的迟到、午饭前和工作班结束前的早退、擅自离开工作岗位、 工作时间内聊天或办私事等造成的工时损失。此项工时损失不应允许 存在。因此，在定额中是不能考虑的。
 
 (二)拟定正常的施工作业条件
 
     拟定施工的正常条件，就是要规定执行定额时应该具备的条件，正常条件若不能满足，则可能达不到定额中的劳动消耗量标准，因此，正确拟定施工的正常条件有利于定额的实施。
 
     拟定施工的正常条件包括:拟定施工作业的内容;拟定施工作业的方法;拟定施工作业地点的组织;拟定施工作业人员的组织等。
 
 (三)拟定施工作业的定额时间
 
     施工作业的定额时间，是在拟定基本工作时间、辅助工作时间、准备与结束时间、不可避免的中断时间以及休息时间的基础上编制的。
 
     上述各项时间是以时间研究为基础，通过时间测定方法，得出相应的观测数据，经加工整理计算后得到的。计时测定的方法有许多种，如测时法、写实记录法、工作日写实法等。
 
 */


#pragma mark 知识点:人工定额的形式

/*
 
 (一)按表现形式的不同
 
     人工定额按表现形式的不同，可分为时间定额和产量定额两种形式。
 
     1.时间定额
 
         就是某种专业，某种技术等级工人班组或个人，在合理的劳动组织和合理使用材料的条件下，完成单位合格产品所必需的工作时间，包括 准备与结束时间、基本工作时间、辅助工作时间、不可避免的中断时间 及工人必需的休息时间。时间定额以工日为单位，每一工日按 8 小时 计算。其计算方法如下:
 
     2.产量定额
 
         就是在合理的劳动组织和合理使用材料的条件下，某种专业、某种技术等级的工人班组或个人在单位工日中所应完成的合格产品的数量。 其计算方法如下:
 
     时间定额与产量定额互为倒数，即:
 
         时间定额 * 产量定额 = 1
 
 (二)按定额的标定对象不同
 
     按定额的标定对象不同，人工定额又分单项工序定额和综合定额两种，综合定额表示完成同一产品中的各单项(工序或工种)定额的 综合。按工序综合的用"综合"表示，按工种综合的一般用"合计"表示。
 
     其计算方法如下:
 
         综合时间定额=∑各单项(工序)时间定额
         综合产量定额=1/综合时间定额(工日)
 
     时间定额和产量定额都表示同一人工定额项目，它们是同一人工 定额项目的两种不同的表现形式。时间定额以工日为单位，综合计算 方便，时间概念明确;产量定额则以产品数量为单位表示，具体、形象， 劳动者的奋斗目标一目了然，便于分配任务。人工定额用复式表同时 列出时间定额和产量定额，以便于各部门、企业根据各自的生产条件和 要求选择使用。
 
     复式表示法有如下形式:
 
         时间定额/每日产量 或 人工时间定额/机械台班产量
 
 */
#pragma mark 知识点:人工定额的编制方法
/*
 
 制定人工定额，常用的方法有四种。
 
 1.技术测定法
 
     是根据生产技术和施工组织条件，对施工过程中各工序采用测时法、写实记录法、工作日写实法，测出各工序的工时消耗等资料，再对所获得的资料进行科学的分析，制定出人工定额的方法。
 
 2. 统计分析法
 
     是把过去施工生产中的同类工程或同类产品的工时消耗的统计资料，与当前生产技术和施工组织条件的变化因素结合起来，进行统计分析的方法。
 
     这种方法简单易行，适用于施工条件正常、产品稳定、工序重复量大和统计工作制度健全的施工过程。但是，过去的记录只是实耗工时，不反映生产组织和技术的状况。所以，在这样条件下求出的定额水平，只是已达到的劳动生产率水平，而不是平均水平。实际工作中，必须分析研究各种变化因素，使定额能真实地反映施工生产平均水平。
 
 3. 比较类推法
 
     对于同类型产品规格多、工序重复、工作量小的施工过程，常用比较类推法。采用此法制定定额是以同类型工序和同类型产品的实耗工时为标准，类推出相似项目定额水平的方法。此法必须掌握类似的程度和各种影响因素的异同程度。
 
 4. 经验估计法
 
     根据定额专业人员、经验丰富的工人和施工技术人员的实际工作经验，参考有关定额资料，对施工管理组织和现场技术条件进行调查、讨论和分析制定定额的方法，叫做经验估计法。经验估计法通常作为一次性定额使用。
 
 */



#pragma mark *********** 1Z103033 材料消耗定额的编制
#pragma mark 知识点:材料消耗定额的编制
/*
 
 材料消耗定额指标的组成，按其使用性质、用途和用量大小划分为四类。
 
 1. 主要材料，指直接构成工程实体的材料;
 2. 辅助材料，直接构成工程实体，但比重较小的材料;
 3. 周转性材料(又称工具性材料)，指施工中多次使用但并不构成工程实体的材料，如模板、脚手架等;
 4. 零星材料，指用量小、价值不大、不便计算的次要材料，可用估算法计算。
 
 编制材料消耗定额，主要包括确定直接使用在工程上的材料净用量和在施工现场内运输及操作过程中的不可避免的废料和损耗。
 
 (一)材料净用量的确定
 
     材料净用量的确定，一般有以下几种方法。
 
     1.理论计算法
 
         是根据设计、施工验收规范和材料规格等，从理论上计算材料的净用量。如砖墙的用砖数和砌筑砂浆的用量可用下列理论计算公式 计算各自的净用量。标准砖砌体中，砌 1m3 标准砖墙的净用砖量计算 公
 
         式:
 
 
         式中 K一一墙厚的砖数 ×2
         墙厚的砖数是0.5砖墙、 1 砖墙、1. 5 砖墙......
         墙厚的砖数是指用标准砖的长度来标明墙厚。例如:半砖墙指 120 厚墙、 3/4 砖墙指180 厚墙， 1 砖墙指 240 厚墙等等。
         每1m3标准砖砌体砂浆净用量 =1m3 砌体-1m3 砌体中标准砖的净体积
         标准砖(砂浆))总消耗量=净用量× (1+损耗率)
 
     2. 测定法 根据试验情况和现场测定的资料数据确定材料的净用量。
     3. 图纸计算法 根据选定的图纸，计算各种材料的体积、面积、延长米或重量。
     4. 经验法根据历史上同类项目的经验进行估算。
 
 (二)材料损耗量的确定
 
     材料的损耗一般以损耗率表示。材料损耗率可以通过观察法或统计法计算确定。材料消耗量计算的公式如下。
 
         损耗率=净用量/损耗量
         总消耗量=净用量+损耗量=净用量× (1+损耗率)
 
 */
#pragma mark 知识点:周转性材料消耗定额的编制
/*
 
 
 周转性材料指在施工过程中多次使用、周转的工具性材料，如钢筋混凝土工程用的模板，搭设脚手架用的杆子、跳板，挖土方工程用的挡土板等。
 
 周转性材料消耗一般与下列四个因素有关:
 
     1. 第一次制造时的材料消耗(一次使用量);
     2. 每周转使用一次材料的损耗(第二次使用时需要补充) ;
     3. 周转使用次数;
     4. 周转材料的最终回收及其回收折价。
 
 定额中周转材料消耗量指标的表示，应当用一次使用量和摊销量两个指标表示。一次使用量是指周转材料在不重复使用时的一次使用量，供施工企业组织施工用;摊销量是指周转材料退出使用，应分摊到每一计量单位的结构构件的周转材料消耗量，供施工企业成本核算或投标报价使用。
 
 例如，捣制混凝土结构木模板用量的计算公式如下:
 一次使用量=净用量×(1+操作损耗率)
 周转使用量=一次使用量×[1+(周转次数-1)×补损率 ]/周转次数
 回收量=一次使用量×(1-补损率)/周转次数
 摊销量=周转使用量-回收量×回收折价率
 
 又例如，预制混凝土构件的模板用量的计算公式如下:
 一次使用量= 净用量 ×(1+操作损耗率)
 摊销量=一次使用量 / 周转次数
 
 */

#pragma mark ***********  1Z103034 施工机械台班定额的编制
#pragma mark 知识点:施工机械台班使用定额的形式
/*
 
 (一)施工机械时间定额
 
     施工机械时间定额，是指在合理劳动组织与合理使用机械条件下，完成单位合格产品所必需的工作时间，包括有效工作时间(正常负荷下 的工作时间和降低负荷下的工作时间)、不可避免的中断时间、 不可避免的无负荷工作时间。机械时间定额以"台班"表示，即一台 机械工作一个作业班时间。一个作业班时间为 8 小时。
 
         单位产品机械时间定额(台班)=1/台班产量
 
     由于机械必须由工人小组配合，所以完成单位合格产品的时间定额，同时列出人工时间定额。即:
 
         单位产品人工时间定额(工日)= 小组成员总人数 /台班产量
 
 (二)施工机械产量定额
 
     机械产量定额，是指在合理劳动组织与合理使用机械条件下，机械在每个台班时间内，应完成合格产品的数量。
 
         机械台班产量定额=1/ 机械时间定额(台班)
 
     机械产量定额和机械时间定额互为倒数关系。
 
 (三)定额表示方法
 
     机械台班使用定额的复式表示法的形式如下:
 
         人工时间额/机械台班产量
 
 */
#pragma mark 知识点:机械台班使用定额的编制

/*
 
 (一)机械工作时间消耗的分类
 
     机械工作时间的消耗，按其性质可作如下分类，如图所示。
 
 
     机械工作时间也分为必需消耗的时间和损失时间两大类。
 
     1.在必需消耗的工作时间里，包括有效工作、不可避免的无负荷工作和不可避免的中断三项时间消耗。而在有效工作的时间消耗中又包括正常负荷下、有根据地降低负荷下的工时消耗。
 
         正常负荷下的工作时间，是指机械在与机械说明书规定的计算负荷相符的情况下进行工作的时间。
 
         有根据地降低负荷下的工作时间，是指在个别情况下由于技术上的原因，机械在低于其计算负荷下工作的时间。例如，汽车运输重量轻而体积大的货物时，不能充分利用汽车的载重吨位因而不得不降低其计算负荷。
 
         不可避免的无负荷工作时间，是指由施工过程的特点和机械结构的特点造成的机械无负荷工作时间。例如筑路机在工作区末端调头等，都属于此项工作时间的消耗。
 
         不可避免的中断工作时间 ，是与 工艺过程的特点、机械的使用和保养、工人休息有关的中断时间。
 
         与工艺过程的特点有关的不可避免中断工作时间，有循环的和定期的两种。循环的不可避免中断，是在机械工作的每一个循环中重复一次。如汽车装货和卸货时的停车。定期的不可避免中断，是经过一定时期重复一次。比如把灰浆泵由一个工作地点转移到另一工作地点时的工作中断。
 
         与机械有关的不可避免中断工作时间，是由于工人进行准备与结束工作或辅助工作时，机械停止工作而引起的中断工作时间。它是与机械的使用与保养有关的不可避免中断时间。
 
         工人休息时间前面已经作了说明。要注意的是应尽量利用与工艺过程有关的和与机械有关的不可避免中断时间进行休息，以充分利用工作时间。
 
     2. 损失的工作时间，包括多余工作、停工、违背劳动纪律所消耗的工作时间和低负荷下的工作时间。
 
         机械的多余工作时间，是机械进行任务内和工艺过程内未包括的工作而延续的时间。如工人没有及时供料而使机械空运转的时间。
 
         机械的停工时间，按其性质也可分为施工本身造成和非施工本身造成的停工。前者是由于施工组织得不好而引起的停工现象，如由于未及时供给机械燃料而引起的停工。后者是由于气候条件所引起的停工现象，如暴雨时压路机的停工。上述停工中延续的时间，均为机械的停工时间。
 
         违反劳动纪律引起的机械的时间损失，是指由于工人迟到早退或擅离岗位等引起的机械停工时间。
 
         低负荷下的工作时间，是由于工人或技术人员的过错所造成的施工机械在降低负荷的情况下工作的时间。例如，工人装车的砂石数量不足引起的汽车在降低负荷的情况下工作所延续的时间。此项工作时间不能作为计算时间定额的基础。
 
 (二)机械台班使用定额的编制内容
 
     1.拟定机械工作的正常施工条件，包括工作地点的合理组织、施工机械作业方法的拟定、配合机械作业的施工小组的组织以及机械工作班制度等。
     2. 确定机械净工作生产率，即机械纯工作一小时的正常生产率。
     3. 确定机械的利用系数。机械的正常利用系数指机械在施工作业班 内对作业时间的利用率。
 
         机械利用系数=工作班净工作时间 / 机械工作班时间
 
     4. 计算机械台班定额。施工机械台班产量定额的计算如下:
 
         施工机械台班产量定额 =机械净工作生产率×工作班延续时间×机械利用系数
 
         施工机械时间定额=1 / 施工机械台班产量定额
 
     5. 拟定工人小组的定额时间。
 
         工人小组的定额时间指配合施工机械作业工人小组的工作时间总和。
 
         工人小组定额时间=施工机械时间定额×工人小组的人数
 
 */
#pragma mark *********** 1Z103035 施工定额和企业定额的编制
#pragma mark 知识点:施工定额的编制
/*
 
 施工定额是建筑安装工人或工人小组在合理的劳动组织和正常的施工条件下，为完成单位合格产品所需消耗的人工、材料、机械的数量标准。
 
 (一)施工定额的作用
 
     1. 施工定额是企业计划管理的依据。表现为施工定额是企业编制 施工组织设计的依据，也是企业编制施工工作计划的依据。
     2. 施工定额是组织和指挥施工生产的有效工具。企业通过下达 施工任务书和限额领料单来实现组织管理和指挥施工生产。
     3. 施工定额是计算工人劳动报酬的依据。工人的劳动报酬是根据 工人劳动的数量和质量来计量的，而施工定额为此提供了一个衡量 标准，它是计算工人计件工资的基础，也是计算奖励工资的基础。
     4. 施工定额有利于推广先进技术。施工定额水平中包含着某些 已成熟的先进的施工技术和经验，工人要达到或超过定额，就必须 掌握和运用这些先进技术，如果工人想大幅度超过定额，他就必须 创造性地劳动。
     5. 施工定额是编制施工预算，加强企业成本管理和经济核算的 基础。
 
 (二)施工定额的编制
 
     1. 施工定额的编制原则
 
         (1)施工定额水平必须遵循平均先进的原则。所谓平均先进水平，是指在正常的生产条件下，多数施工班组或生产者经过努力可以达到，少数班组或劳动者可以接近，个别班组或劳动者可以超过的水平。通常这种水平低于先进水平，略高于平均水平。
         (2) 定额的结构形式简明适用的原则。所谓简明适用是指定额结构 合理，定额步距大小适当，文字通俗易懂，计算方法简便，易为群众 掌握运用，具有多方面的适应性，能在较大的范围内满足不同情况、 不同用途的需要。
 */

#pragma mark 知识点:企业定额的编制
/*
 
 企业定额是施工企业根据本企业的技术水平和管理水平，编制的完成单位合格产品所必需的人工、材料和施工机械台班消耗量，以及其他生产经营要素消耗的数量标准。
 
 企业定额反映企业的施工生产与生产消费之间的数量关系，是施工企业生产力水平的体现。企业的技术和管理水平不同，企业定额的定额水平也就不同。因此，企业定额是施工企业进行施工管理和投标报价的基础和依据，也是企业核心竞争力的具体表现。
 
 
 (一)企业定额的作用
 
     1.企业定额是施工企业计算和确定工程施工成本的依据，是施工 企业进行成本管理、经济核算的基础。
     2. 企业定额是施工企业进行工程投标、编制工程投标价格的基础 和主要依据。
     3. 企业定额是施工企业编制施工组织设计的依据。
 
 (二)企业定额的编制原则
 
     施工企业在编制企业定额时应依据本企业的技术能力和管理水平，以基础定额为参照和指导，测定计算完成分项工程或工序所必需的人工、材料和机械台班的消耗量，准确反映本企业的施工生产力水平。
 
     目前，为适应国家推行的工程量清单计价办法，企业定额可采用基础定额的形式，按统一的工程量计算规则、统一划分的项目、统一的计量单位进行编制。
 
     在确定人工、材料和机械台班消耗量以后，需按选定的市场价格，包括人工价格、材料价格和机械台班价格等编制分项工程单价和分项工程的综合单价。
 
 (三)企业定额的编制方法
 
     编制企业定额最关键的工作是确定人工、材料和机械台班的消耗量，以及计算分项工程单价或综合单价。具体测定和计算方法同前述施工定额及预算定额的编制。
 
 */
#pragma mark *********** 1Z103036 预算定额与单位估价表的编制
#pragma mark 知识点:预算定额的编制
/*
 
 预算定额是在施工定额的基础上进行综合扩大编制而成的。预算定额中的人工、材料和施工机械台班的消耗水平根据施工定额综合取定，定额子目的综合程度大于施工定额，从而可以简化施工图预算的编制工作。预算定额是编制施工图预算的主要依据。
 
 (一)人工消耗量指标的确定
 
     预算定额中人工消耗量水平和技工、普工比例，以人工定额为基础，通过有关图纸规定，计算定额人工的工日数。
 
     1.人工消耗指标的组成
 
         预算定额中人工消耗量指标包括完成该分项工程必需的各种用工量。
 
         (1)基本用工
 
             基本用工，指完成分项工程的主要用工量。例如，砌筑各种墙体工程的砌砖、调制砂浆以及运输砖和砂浆的用工量。
 
         (2) 其他用工
 
             其他用工，是辅助基本用工消耗的工日。按其工作内容不同又分以下三类:
 
             1) 超运距用工。指超过人工定额规定的材料、半成品运距的用工。
             2) 辅助用工。指材料需在现场加工的用工，如筛砂子、淋石灰膏等 增加的用工量。
             3) 人工幅度差用工。指人工定额中未包括的，而在一般正常施工情况 下又不可避免的一些零星用工，其内容如下:
 
                 1各种专业工种之间的工序搭接及土建工程与安装工程的交叉、配合中不可避免的停歇时间;
                 2施工机械在场内单位工程之间变换位置及在施工过程中移动临时水电线路引起的临时停水、停电所发生的不可避免的间歇时间;
                 3施工过程中水电维修用工;
                 4隐蔽工程验收等工程质量检查影响的操作时间;
                 5现场内单位工程之间操作地点转移影响的操作时间;
                 6施工过程中工种之间交叉作业造成的不可避免的剔凿、修复、清理等用工;
                 7施工过程中不可避免的直接少量零星用工。
 
     2. 人工消耗指标的计算
 
         预算定额的各种用工量，应根据测算后综合取定的工程数量和人工定额进行计算。
 
         (1) 综合取定工程量
 
             预算定额是一项综合性定额，它是按组成分项工程内容的各工序综合而成的。
 
             编制分项定额时，要按工序划分的要求测算、综合取定工程量，如砌墙工程除了主体砌墙外，还需综合砌筑门窗洞口、附墙烟囱、垃圾道、预留抗震柱孔等含量。综合取定工程量是指按照一个地区历年实际设计房屋的情况，选用多份设计图纸，进行测算取定数量。
 
         (2) 计算人工消耗量
 
             按照综合取定的工程量或单位工程量和劳动定额中的时间定额，计算出各种用工的工日数量。
 
             1) 基本用工的计算
 
                 基本用工数量=∑(工序工程量×时间定额)
 
             2) 超运距用工的计算
 
                 超运距用工数量=∑(超运距材料数量×时间定额)
 
                 其中，超运距=预算定额规定的运距-劳动定额规定的运距。
 
             3) 辅助用工的计算
 
                 辅助用工数量=∑(加工材料数量×时间定额)
 
             4) 人工幅度差用工的计算
 
                 人工幅度差用工数量=∑(基本用工+超运距用工+辅助用工)×人工幅度差系数
 
 (二)材料耗用量指标的确定
 
     材料耗用量指标是在节约和合理使用材料的条件下，生产单位合格产品所必须消耗的一定品种规格的材料、燃料、半成品或配件数量标准。材料耗用量指标是以材料消耗定额为基础，按预算定额的定额项目，综合材料消耗定额的相关内容，经汇总后确定。
 
 (三)机械台班消耗指标的确定
 
     预算定额的机械化水平，应以多数施工企业采用的和已推广的先进施工方法为标准。预算定额中的机械台班消耗量按合理的施工方法取定并考虑增加了机械幅度差。
 
     1.机械幅度差
 
         机械幅度差是指在施工定额中未曾包括的，而机械在合理的施工 组织条件下所必需的停歇时间，在编制预算定额时应予以考虑。其 内容包括:
 
         (1) 施工机械转移工作面及配套机械互相影响损失的时间;
         (2) 在正常的施工情况下，机械施工中不可避免的工序间歇;
         (3) 检查工程质量影响机械操作的时间;
         (4) 临时水、电线路在施工中移动位置所发生的机械停歇时间;
         (5) 工程结尾时，工作量不饱满所损失的时间。
 
     2. 机械台班消耗指标的计算
 
     (1) 小组产量计算法:按小组日产量大小来计算耗用机械台班多少，
 
         计算公式如下:
 
             分项定额机械台班使用量=分项定额计量单位值/小组产量
 
     (2) 台班产量计算法:按台班产量大小来计算定额内机械消耗量大小，
 
         计算公式如下:
 
             定额台班用量=(定额单位/台班产量)×机械幅度差系数
 
 */

#pragma mark 知识点:单位估价表的编制
/*
 
 在拟定的预算定额的基础上，有时还需要根据所在地区的工资、 物价水平计算确定相应的人工、材料和施工机械台班的价格，即相应 的 人工工资价格、材料预算价格和施工机械台班价格，计算拟定 预算定额中每一分项工程的单位预算价格，这一过程称为单位估价表 的编制。
 
 单位估价表是由分部分项工程单价构成的单价表，具体的表现形式可分为工料单价和综合单价等。
 
 (一)工料单价单位估价表
 
     工料单价是确定定额计量单位的分部分项工程的人工费、材料费和机械使用费的费用标准，即人、料、机费用单价，也称为定额基价。
 
     单位估价表，是以定额为基本依据，根据相应地区和市场的资源价格，既需要人工、材料和施工机具的消耗量，又需要人工、材料和施工机具价格，经汇总得到分部分项工程的单价。
 
     应按当地的资源价格来编制地区单位估价表。同时，单位估价表应是动态变化的，应随着市场价格的变化，及时不断地对单位估价表中的分部分项工程单价进行调整、修改和补充，使单位估价表能够正确反映市场的变化。
 
     通常，单位估价表是以一个城市或一个地区为范围进行编制，在该地区范围内适用。
 
     单位估价表的编制依据如下:
 
         1.全国统一或地区通用的概算定额、预算定额或基础定额，以确定 人工、材料、机械台班的消耗量。
         2. 本地区或市场上的资源实际价格或市场价格，以确定人工、材料、 机械台班价格。
 
     单位估价表的编制公式为:
 
         分部分项工程单价 =分部分项人工费+分部分项材料费+分部分项机械费
                       =∑(人工定额消耗量×人工价格)+∑(材料定额消耗量×材料价格)+∑(机械台班定额消耗量×机械台班价格)
 
     编制单位估价表时，在项目的划分、项目名称、项目编号、计量单位和工程量计算规则上应尽量与定额保持一致。
 
     编制单位估价表，可以简化设计概算和施工图预算的编制。
 
 (二)综合单价单位估价表
 
     编制单位估价表时，在汇集分部分项工程人工、材料、机械台班使用费用，得到人、料、机费用单价以后，再按取定的企业管理费费用比率以及取定的利润率、规费和税率，计算出各项相应费用，汇总人、料、机费用、企业管理费、利润、规费和税金，就构成一定计量单位的分部分项工程的综合单价。综合单价分别乘以分部分项工程量，可得到分部分项工程的造价费用。
 
 (三)企业单位估价表
 
     作为施工企业，应依据本企业定额中的人工、材料、机械台班消耗量，按相应人工、材料、机械台班的市场价格，计算确定一定计量单位的分部分项工程的工料单价或综合单价，形成本企业的单位估价表。
 */
#pragma mark *********** 1Z103037 概算定额与概算指标的编制
#pragma mark 知识点:概算定额的编制
/*
 
概算定额也叫做扩大结构定额。它规定了完成一定计量单位的扩大结构构件或扩大分项工程的人工、材料、机械台班消耗量的数量标准。

 (一)概算定额的作用

     概算定额是在初步设计阶段编制设计概算或技术设计阶段编制修正概算的依据，是确定建设工程项目投资额的依据。概算定额可用于进行设计方案的技术经济比较。概算定额也是编制概算指标的基础。
 
 (二)编制概算定额的一般要求
 
     1.概算定额的编制深度要适应设计深度的要求。由于概算定额是在初步设计阶段使用的，受初步设计的设计深度所限制，因此定额项目划分应坚持简化、准确和适用的原则。
 
     2. 概算定额水平的确定应与基础定额、预算定额的水平基本一致。 它必须反映在正常条件下，大多数企业的设计、生产、施工管理水平。 由于概算定额是在预算定额的基础上，适当地再一次扩大、综合和简化， 因而在工程标准、施工方法和工程量取值等方面进行综合、测算时，概算 定额与预算定额之间必将产生并允许留有一定的幅度差，以便根据概算 定额编制的概算能够控制住施工图预算。
 
 (三)概算定额的编制方法
 
     概算定额是在预算定额的基础上综合而成的，每一项概算定额项目都包括了数项预算定额的定额项目。
 
     1. 直接利用综合预算定额。如砖基础、钢筋混凝土基础、楼梯、阳台、雨篷等。
     2. 在预算定额的基础上再合并其他次要项目。如墙身再包括伸缩缝;地面包括平整场地、回填土、明沟、垫层、找平层、面层及踢脚。
     3. 改变计量单位。如屋架、天窗架等不再按立方米体积计算，而按屋面水平投影面积计算。
     4. 采用标准设计图纸的项目，可以根据预先编好的标准预算计算。如构筑物中的烟囱、水塔、水池等，以每座为单位。
     5. 工程量计算规则进一步简化。如砖基础、带形基础以轴线(或中心线)长度乘断面面积计算;内外墙也均以轴线(或中心线)长乘以高，再扣除门窗洞口计算;屋架按屋面投影面积计算;烟囱、水塔在按座计算;细小零星占造价比重很小的项目，不计算工程量，按占主要工程的百分比计算。
 
 (四)概算定额手册的内容
 
     按专业特点和地区特点编制的概算定额手册，内容基本上是由文字说明、定额项目表和附录三个部分组成。
 
     1.文字说明部分。
 
         文字说明部分有总说明和分部工程说明。在总说明中，主要阐述概算定额的编制依据、使用范围、包括的内容及作用、应遵守的规则及建筑面积计算规则等。分部工程说明主要阐述本分部工程包括的综合工作内容及分部分项工程的工程量计算规则等。
 
     2. 定额项目表。
 
         主要包括以下内容:
 
         (1) 定额项目的划分。
 
             概算定额项目一般按以下两种方法划分。
 
             一是按工程结构划分:一般是按土石方、基础、墙、梁板柱、门窗、 楼地面、屋面、装饰、构筑物等工程结构划分。
             二是按工程部位 (分部)划分:一般是按基础、墙体、梁柱、楼地面、屋盖、其他工程 部位等划分，如基础工程中包括了砖、石、混凝土基础等项目。
 
         (2) 定额项目表。
 
             定额项目表是概算定额手册的主要内容，由若干 分节定额组成。各节定额由工程内容、定额表及附注说明组成。定额 表中列有定额编号，计量单位，概算价格，人工、材料、机械台班 消耗量指标，综合了预算定额的若干项目与数量。
 */

#pragma mark 知识点:概算指标的编制

/*
 
 概算指标是以每 100m² 建筑面积、每 1000m3 建筑体积或每座 构筑物为计量单位，规定人工、材料、机械及造价的定额指标。
 
 概算指标是概算定额的扩大与合并，它是以整个房屋或构筑物为 对象，以更为扩大的计量单位来编制的，也包括劳动力、材料和机械 台班定额三个基本部分。同时，还列出了各结构分部的工程量及单位 工程(以体积计或以面积计)的造价。例如每 1000m3 房屋或构筑物、 每 1000m 管道或道路、每座小型独立构筑物所需要的劳动力、材料 和机械台班的消耗数量等。
 
 1.概算指标的作用
 
     概算指标的作用与概算定额类似，在设计深度不够的情况下，往往用概算指标来编制初步设计概算。
 
     因为概算指标比概算定额进一步扩大与综合，所以依据概算指标来估算投资就更为简便，但精确度也随之降低。
 
 2. 概算指标的编制方法
 
     由于各种性质建设工程项目所需要的劳动力、材料和机械台班的数量不同，概算指标通常按工业建筑和民用建筑分别编制。工业建筑中又按各工业部门类别、企业大小、车间结构编制，民用建筑中又按用途性质、建筑层高、结构类别编制。
 
     单位工程概算指标，一般选择常见的工业建筑的辅助车间(如机修 车间、金工车间、装配车间、锅炉房、变电站、空压机房、成品仓库、 危险品仓库等)和一般民用建筑项目(如工房、单身宿舍、办公楼、 教学楼、浴室、门卫室等)为编制对象，根据设计图纸和现行的概算 定额等，测算出每 100m² 建筑面积或每 1000m3 建筑体积所需的人工、 主要材料、机械台班的消耗量指标和相应的费用指标等。
 
 3. 概算指标的内容和形式
 
     概算指标的组成内容一般分为文字说明、指标列表和附录等几部分。
 
     (1) 文字说明
 
         概算指标的文字说明，其内容通常包括概算指标的编制范围、编制依据、分册情况、指标包括的内容、指标未包括的内容、指标的使用范围、指标允许调整的范围及调整方法等。
 
     (2) 列表形式
 
         建筑工程的列表形式中，房屋建筑、构筑物一般以建筑面积 100m² 、建筑体积1000m3 、"座"、"个"等为计量单位，附以必要的示意图， 给出建筑物的轮廓示意或单线平面图;列有自然条件、建筑物类型、 结构形式、各部位中结构的主要特点、主要工程量;列出综合指标; 人工、主要材料、机械台班的消耗量。建筑工程的列表形式中， 设备以"t" 或"台"为计量单位，也有以设备购置费或设备的百分比表示; 列出指标编号、项目名称、规格、综合指标等。
 */

#pragma mark  ******************************* 1Z103040 2.建设工程项目设计概算

#pragma mark *********** 1Z103041 设计概算的内容和作用
#pragma mark 知识点:设计概算的内容
/*
 
 设计概算是设计文件的重要组成部分，是由设计单位 根据初步 设计(或技术设计)图纸及说明、概算定额(或概算指标)、 各项费用定额或取费标准(指标)、设备、材料预算价格等资料或 参照类似工程预决算文件，编制和确定的建设工程项目从筹建至 竣工交付使用所需全部费用的文件。
 
 设计概算投资一般应控制在立项批准的投资控制额以内，如果设计概算值超过控制额，必须修改设计或重新立项审批;
 
 设计概算应按编制时项目所在地的价格水平编制，总投资应完整地反映编制时建设项目的实际投资;
 
 设计概算应考虑建设项目施工条件等因素对投资的影响;还应按项目合理工期预测建设期价格水平，以及资产租赁和贷款的时间价值等动态因素对投资的影响;

 设计概算由项目设计单位负责编制，并对其编制质量负责。
 
 设计概算可分为单位工程概算、单项工程综合概算和建设工程项目总概算三级。
 
 各级概算之间的相互关系如图所示: （各级概算之间的相互关系图）
 
     建设工程总概算
         单项工程综合概算
                 单位建筑工程概算
                 单位设备及安装工程概算
         工程建设其他费用概算
         预备费、建设期利息概算
         经营性项目铺底流动资金概算
 
 1.单位工程概算
 
     对于一般工业与民用建筑工程而言，单位工程概算按其工程性质分为建筑工程概算和设备及安装工程概算两大类。
 
     建筑工程概算包括土建工程概算、给排水采暖工程概算、通风空调工程概算、电气照明工程概算、弱电工程概算、特殊构筑物工程概算等;设备及安装工程概算包括机械设备及安装工程概算、电气设备及安装工程概算、热力设备及安装工程概算以及工器具及生产家具购置费概算等。
 
     单位工程概算只包括单位工程的工程费用，由人、料、机费用和企业管理费、利润、规费、税金组成。
 
 2. 单项工程综合概算
 
     单项工程综合概算是确定一个单项工程所需建设费用的文件，是由单项工程中的各单位工程概算汇总编制而成的，是建设工程项目总概算的组成部分。对于一般工业与民用建筑工程而言，单项工程
 
     综合概算的组成内容如图所示:
 
 3. 建设工程项目总概算
 
     建设工程项目总概算是确定整个建设工程项目从筹建开始到竣工验收、交付使用所需的全部费用的文件，它由各单项工程综合概算、工程建设其他费用概算、预备费、建设期利息概算和经营性项目铺底
 
     流动资金概算等汇总编制而成，如图所示:
 
 */


#pragma mark 知识点:设计概算的作用
/*
 
 1. 设计概算是制定和控制建设投资的依据。对于使用政府资金的 建设项目按照规定报请有关部门或单位批准初步设计及总概算， 一经上级批准，总概算就是总造价的最高限额，不得任意突破， 如有突破须报原审批部门批准。
 2. 设计概算是编制建设计划的依据。
 3. 设计概算是进行贷款的依据。
 4. 设计概算是签订工程总承包合同的依据。
 5. 设计概算是考核设计方案的经济合理性和控制施工图预算和施工图设计的依据。
 6. 设计概算是考核和评价建设工程项目成本和投资效果的依据。
 
 */



#pragma mark *********** 1Z103042 设计概算的编制依据、程序和步骤
#pragma mark 知识点:设计概算的编制依据
/*
 
 1. 国家、行业和地方有关规定;
 2. 相应工程造价管理机构发布的概算定额(或指标) ;
 3. 工程勘察与设计文件;
 4. 拟定或常规的施工组织设计和施工方案;
 5. 建设项目资金筹措方案;
 6. 工程所在地编制同期的人工、材料、机械台班市场价格，以及设备供应方式及供应价格;
 7. 建设项目的技术复杂程度，新技术、新材料、新工艺以及专利 使用情况等;
 8. 建设项目批准的相关文件、合同、协议等;
 9. 政府有关部门、金融机构等发布的价格指数、利率、汇率、 税率以及工程建设其他费用等;
 10. 委托单位提供的其他技术经济资料等。
 
 */
#pragma mark 知识点:设计概算的程序和步骤

/*
 
 1.收集原始资料
 2.确定有关数据
 3.各项费用计算
 4.单位工程概算书编制
 5.单项工程综合概算书的编制
 6.建设项目总概算的编制
 
 */

#pragma mark *********** 1Z103043 设计概算的编制方法
#pragma mark 知识点:单位工程概算的编制方法
/*
 
 单位工程概算分建筑工程概算和设备及安装工程概算两大类。建筑工程概算的编制方法有概算定额法、概算指标法、类似工程预算法;设备及安装工程概算的编制方法有预算单价法、扩大单价法、设备价值百分比法和综合吨位指标法等。
 
 (一)单位建筑工程概算编制方法
 
     1.概算定额法
 
         概算定额法又叫扩大单价法或扩大结构定额法。它与利用预算定额编制单位建筑工程施工图预算的方法基本相同。其不同之处在于编制概算所采用的依据是概算定额，所采用的工程量计算规则是概算工程量计算规则。该方法要求初步设计达到一定深度，建筑结构比较明确时方可采用。
 
         利用概算定额法编制设计概算的具体步骤如下。
 
         (1) 按照概算定额分部分项顺序，列出各分项工程的名称。
         (2) 确定各分部分项工程项目的概算定额单价(基价)。如遇设计图中的分项工程项目名称、内容与采用的概算定额手册中相应的项目有某些不相符时，则按规定对定额进行换算后方可套用。
 
             概算定额单价的计算公式为:
 
                概算定额单价=概算定额人工费+概算定额材料费+概算定额机械台班使用费
                          =Σ(概算定额中人工消耗量×人工单价)+Σ(概算定额中材料消耗量×材料预算单价) +Σ(概算定额中机械台班消耗量×机械台班单价)
 
         (3) 计算单位工程的人、料、机费用。

             如果规定有地区的人工、材料价差调整指标，计算人、料、机费用时，按规定的调整系数或其他调整方法进行调整计算。
 
         (4) 根据人、料、机费用，结合其他各项取费标准，分别计算企业 管理费、利润、规费和税金。
         (5) 计算单位工程概算造价，其计算公式为:
 
             单位工程概算造价=人、料、机费用+企业管理费+利润+规费+税金
 
     2. 概算指标法 当初步设计深度不够，不能准确地计算工程量，但工程设计采用的
 
         技术比较成熟而又有类似工程概算指标可以利用时，可以采用概算指标法编制工程概算。概算指标法将拟建厂房、住宅的建筑面积或体积乘以技术条件相同或基本相同的概算指标而得出人、料、机费用，然后按规定计算出企业管理费、利润、规费和税金等。概算指标法计算精度较低，但由于其编制速度快，因此对一般附属、辅助和服务工程等项目，以及住宅和文化福利工程项目或投资比较小、比较简单的工程项目投资概算有一定实用价值。

         (1) 拟建工程结构特征与概算指标相同时的计算
 
             在使用概算指标法时，如果拟建工程在建设地点、结构特征、地质及自然条件、建筑面积等方面与概算指标相同或相近，就可直接套用概算指标编制概算。
 
             根据选用的概算指标的内容，可选用两种套算方法。
 
             一种方法是以指标中所规定的工程每平方米或立方米的人、料、机费用单价，乘以拟建单位工程建筑面积或体积，得出单位工程的人、料、机费用，再计算其他费用，即可求出单位工程的概算造价。
 
                 人、料、机费用=概算指标每平方米(立方米)人、料、机费用单价 ×拟建工程建筑面积(体积)
 
             这种简化方法的计算结果参照的是概算指标编制时期的价格标准，未考虑拟建工程建设时期与概算指标编制时期的价差，所以在计算人、料、机费用后还应用物价指数另行调整。
 
             另一种方法是以概算指标中规定的每 100m² 建筑物面积(或 1000m3体积) 所耗人工工日数、主要材料数量为依据，首先计算拟建工程人工、主要材料 消耗量，再计算人、料、机费用，并取费。在概算指标中，一般规定了100m² 建筑物面积(或 1000m3体积)所耗工日数、主要材料数量，通过套用拟建地区 当时的人工工资单价和主材预算价格，便可得到每 100m²(或 1000m3 )建筑物 的人工费和主材费而无需再作价差调整。
 
             计算公式为:
 
                 100m²建筑物面积的人工费=指标规定的工日数×本地区人工工日单价
                 100m²建筑物面积的主要材料费 =Σ(指标规定的主要材料数量×地区材料预算单价)
                 100m² 建筑物面积的机械使用费 =(人工费+主要材料费+其他材料费)×机械使用费所占百分比
 
             每1m² 建筑面积的人、料、机费用 =(人工费+主要材料费+其他材料费+机械使用费) ÷100
 
             根据人、料、机费用，结合其他各项取费方法，分别计算企业 管理费、利润、规费和税金，得到每 1m² 建筑面积的概算单价， 乘以拟建单位工程的建筑面积，即可得到单位工程概算造价。
 
         (2) 拟建工程结构特征与概算指标有局部差异时的调整
 
             1) 调整概算指标中的每 1m²(m3) 造价
 
                 将原概算指标中的单位造价进行调整(仍使用人、料、机费用指标) ，扣除每 1m²(m3) 原概算指标中与拟建工程结构不同部分的造价， 增加每 1m²(m3) 拟建工程与概算指标结构不同部分的造价，使其成为 与拟建工程结构相同的工程单位人、料、机费用造价。计算公式为:
 
                     结构变化修正概算指标(元/m²)=J+Q1P1-Q2P2
 
                 式中 J——原概算指标
                     Q1——概算指标中换入结构的工程量
                     Q2——概算指标中换出结构的工程量
                     P1——换入结构的人、材、机费用单价
                     P2——换出结构的人、材、机费用单价
 
                 则拟建单位工程的人、料、机费用为:
 
                     人、料、机费用=修正后的概算指标×拟建工程建筑面积(或体积)
 
                 求出人、料、机费用后，再按照规定的取费方法计算其他费用，最终得到单位工程概算价值。
 
             2) 调整概算指标中的人、料、机数量
 
                 将原概算指标中每 100m² (1000m3) 建筑面积(体积)中的人、料、机数量进行调整，扣除原概算指标中与拟建工程结构不同部分的人、料、机 消耗量，增加拟建工程与概算指标结构不同部分的人、料、机消耗量， 使其成为与拟建工程结构相同的每100m² (1000m3) 建筑面积(体积)人、料、机 数量。计算公式为:
 
                 结构变化修正概算指标的人、料、机数量 =原概算指标的人、料、机数量
                                               +换入结构件工程量×相应定额人、料、机消耗量
                                               - 换出结构件工程量×相应定额人、料、机消耗量
 
     3. 类似工程预算法
 
         类似工程预算法是利用技术条件与设计对象相类似的已完工程或在建工程的工程造价资料来编制拟建工程设计概算的方法。该方法适用于拟建工程初步设计与已完工程或在建工程的设计相类似且没有可用的概算指标的情况，但必须对建筑结构差异和价差进行调整。
 
 (二)设备及安装工程概算编制方法
 
     设备及安装工程概算费用由设备购置费和安装工程费组成。
 
     1.设备购置费概算
 
         设备购置费是指为项目建设而购置或自制的达到固定资产标准的设备、工器具、交通运输设备、生产家具等本身及其运杂费用。
 
         设备购置费概算，计算公式为:
 
            设备购置费概算=Σ(设备清单中的设备数量×设备原价)×(1+运杂费 率)
         或:
            设备购置费概算=Σ(设备清单中的设备数量×设备预算价格)
 
         工具、器具及生产家具购置费一般以设备购置费为计算基数，按照部门或行业规定的工具、器具及生产家具费率计算。
 
     2. 设备安装工程概算的编制方法
 
         设备安装工程费包括用于设备、工器具、交通运输设备、生产家具等的组装和安装，以及配套工程安装而发生的全部费用。
 
         (1) 预算单价法。
 
             当初步设计有详细设备清单时，可直接按预算单价(预算定额单价)编制设备安装工程概算。根据计算的设备安装工程量，乘以安装工程预算单价，经汇总求得。
 
             用预算单价法编制概算，计算比较具体，精确性较高。
 
         (2) 扩大单价法。当初步设计的设备清单不完备，或仅有成套设 备 的重量时，可采用主体设备、成套设备或工艺线的综合扩大安装 单价编制概算。
         (3) 概算指标法。当初步设计的设备清单不完备，或安装预算单价 及扩大综合单价不全，无法采用预算单价法和扩大单价法时，可采用 概算指标编制概算。概算指标形式较多，概括起来主要可按以下几种 指标进行计算。
 
             1 按占设备价值的百分比(安装费率)的概算指标计算。
 
                 设备安装费=设备原价×设备安装费率
 
             2 按每吨设备安装费的概算指标计算。
 
                 设备安装费=设备总吨数×每吨设备安装费(元/吨)
 
             3 按座、台、套、组、根或功率等为计量单位的概算指标计算。 如工业炉，按每台安装费指标计算;冷水箱，按每组安装费指标计算 安装费等等。
             4 按设备安装工程每平方米建筑面积的概算指标计算。设备安装 工程有时可按不同的专业内容(如通风、动力、管道等)采用每平方米 建筑面积的安装费用概算指标计算安装费。
*/
#pragma mark 知识点:单项工程概算的编制方法
/*
 
 单项工程综合概算是以其所包含的建筑工程概算表和设备及安装 工程概算表为基础汇总编制的。当建设工程项目只有一个单项工程 时，单项工程综合概算(实为总概算)还应包括工程建设其他费用 概算 (含建设期利息、预备费)。
 
 单项工程综合概算文件一般包括编制说明和综合概算表两部分。
 
 编制说明主要包括编制依据、编制方法、主要设备和材料的数量 及 其他有关问题。
 
 综合概算表是根据单项工程所辖范围内的各单位工程概算等基础资料，按照国家规定的统一表格进行编制。
 
 */
#pragma mark 知识点:建设工程项目总概算的编制方法
/*
 
 (一)总概算书的内容
 
     建设项目总概算是设计文件的重要组成部分。它由各单项工程综合概算、工程建设其他费用、建设期利息、预备费和经营性项目的铺底流动资金组成，并按主管部门规定的统一表格编制而成。
 
     设计概算文件一般应包括以下 6 部分。
 
     1. 封面、签署页及目录
     2. 编制说明
 
         编制说明应包括下列内容:
 
         (1) 工程概况。简述建设项目性质、特点、生产规模、建设周期、 建设地点等主要情况。对于引进项目要说明引进内容及与国内配套 工程等主要情况。
         (2) 资金来源及投资方式。
         (3) 编制依据及编制原则。
         (4) 编制方法。说明设计概算是采用概算定额法，还是采用概算指标法等。
         (5) 投资分析。主要分析各项投资的比重、各专业投资的比重等经济指标。
         (6) 其他需要说明的问题。
 
     3. 总概算表
 
         总概算表应反映静态投资和动态投资两个部分。静态投资是按设计概算编制期价格、费率、利率、汇率等因素确定的投资;动态投资则是指概算编制期到竣工验收前的工程和价格变化等多种因素所需的投资。
 
     4. 工程建设其他费用概算表
 
            工程建设其他费用概算按国家或地区或部委所规定的项目和标准确定，并按统一表式编制。
 
     5. 单项工程综合概算表
     6. 单位工程概算表
     7. 附录:补充估价表
 
 (二)总概算书的编制方法
 
     总概算由以下四部分组成:
 
     (1)工程费用;
     (2) 其他费用;
     (3) 预备费;
     (4) 应列入项目概算总投资的其他费用，包括建设期利息和铺底流动资金。
 
     编制总概算表的基本步骤如下:
 
     1.按总概算组成的顺序和各项费用的性质，将各个单项工程综合概算及其他工程和费用概算汇总列入总概算表。
     2. 将工程项目和费用名称及各项数值填入相应各栏内，然后按各栏分别汇总。
     3. 以汇总后总额为基础，按取费标准计算预备费用、建设期利息、固定资产技资方向调节税、铺底流动资金。
     4. 计算回收金额。回收金额是指在整个基本建设过程中所获得的 各种收入。如原有房屋拆除所回收的材料和旧设备等的变现收入; 试车收入大于支出部分的价值等。回收金额的计算方法，应按地区 主管部门的规定执行。
     5. 计算总概算价值。
 
         总概算价值=工程费用+其他费用+预备费+建设期利息+铺底流动资金-回收金额
 
     6. 计算技术经济指标。整个项目的技术经济指标应选择有代表性 和能说明投资效果的指标填列。
     7. 投资分析。为对基本建设投资分配、构成等情况进行分析， 应在总概算表中计算出各项工程和费用投资占总投资比例， 在表的末栏计算出每项费用的投资占总投资的比例。
 
 */
#pragma mark *********** 1Z103044 设计概算的审查内容
#pragma mark 知识点:设计概算审查的意义
/*
 
 1. 审查设计概算有助于促进概算编制人员严格执行国家有关概算的编制 规定和费用标准，提高概算的编制质量。
 2. 审查设计概算有利于合理分配投资资金、加强投资计划管理。
 3. 审查设计概算，有助于促进设计的技术先进性与经济合理性的统一。
 4. 审查设计概算，有利于核定建设项目的投资规模，可以使建设项目总投资力求做到准确、完整，防止任意扩大投资规模或出现漏项，从而减少投资缺口、缩小概算与预算之间的差距，避免故意压低概算投资，搞钓鱼项目，最后导致实际造价大幅度地突破概算。
 5. 经审查的概算，有利于为建设项目投资的落实提供可靠的依据。
 
 */

#pragma mark 知识点:设计概算审查的内容

/*

 (一)审查设计概算的编制依据
 
     1. 合法性审查。采用的各种编制依据必须经过国家或授权机关的 批准， 符合国家的编制规定。未经过批准的不得采用，不得强调 特殊理由擅自提高费用标准。
     2. 时效性审查。对定额、指标、价格、取费标准等各种依据， 都应根据 国家有关部门的现行规定执行。对颁发时间较长、已不能 全部适用的应按有关部门规定的调整系数执行。
     3. 适用范围审查。各主管部门、各地区规定的各种定额及其取费 标准均有其各自的适用范围，特别是各地区间的材料预算价格区域性 差别较大，在审查时应给予高度重视。
 
 (二)单位工程设计概算构成的审查
 
     1. 建筑工程概算的审查
 
         (1) 工程量审查。根据初步设计图纸、概算定额、工程量计算规则的要求进行审查。
         (2) 采用的定额或指标的审查。审查定额或指标的使用范围、定额基价、指标的调整、定额或指标缺项的补充等。其中，审查补充的定额或指标时，其项目划分、内容组成、编制原则等须与现行定额水平相一致。
         (3) 材料预算价格的审查。以耗用量最大的主要材料作为审查的重点， 同时着重审查材料原价、运输费用及节约材料运输费用的措施。
         (4) 各项费用的审查。审查各项费用所包含的具体内容是否重复计算或 遗漏、取费标准是否符合国家有关部门或地方规定的标准。
 
     2. 设备及安装工程概算的审查 设备及安装工程概算审查的重点是设备清单与安装费用的计算。
 
         (1) 标准设备原价，应根据设备被管辖的范围，审查各级规定的价格标准。
         (2) 非标准设备原价，除审查价格的估算依据、估算方法外还要分析研究 非标准设备估价准确度的有关因素及价格变动规律。
         (3) 设备运杂费审查，需注意:1设备运杂费率应按主管部门或省、自治区、直辖市规定的标准执行;2若设备价格中已包括包装费和供销部门手续费时不应重复计算，应相应降低设备运杂费率。
         (4) 进口设备费用的审查，应根据设备费用各组成部分及国家设备 进口、外汇管理、海关、税务等有关部门不同时期的规定进行。
         (5) 设备安装工程概算的审查，除编制方法、编制依据外，还应 注意审查:1采用预算单价或扩大综合单价计算安装费时的各种单价 是否合适、工程量计算是否符合规则要求、是否准确无误;2当采用 概算指标计算安装费时采用的概算指标是否合理、计算结果是否达到 精度要求;3审查所需计算安装费的设备数量及种类是否符合设计 要求，避免某些不需安装的设备安装费计入在内。
 
 (三)综合概算和总概算的审查
 
     1.审查概算的编制是否符合国家经济建设方针、政策的要求，根据 当地自然条件、施工条件和影响造价的各种因素，实事求是地确定 项目总投资。
     2. 审查概算的投资规模、生产能力、设计标准、建设用地、建筑 面积、主要设备、配套工程、设计定员等是否符合原批准可行性研究 报告或立项批文的标准。如概算总投资超过原批准投资估算 10% 以上， 应进一步审查超估算的原因。
     3. 审查其他具体项目:(1) 审查各项技术经济指标是否经济合理; (2) 审查费用项目是否按国家统一规定计列，具体费率或计取标准是否 按国家、行业或有关部门规定计算，有无随意列项，有无多列、交叉 计列和漏项等。
 
 (四)财政部对设计概算评审的要求
 
     1. 项目概算评审包括对项目建设程序、建筑安装工程概算、设备 投资概算、待摊投资概算和其他投资概算等的评审。
     2. 项目概算应由项目建设单位提供，项目建设单位委托其他单位 编制项目概算的，由项目单位确认后报送评审机构进行评审。项目 建设单位没有编制项目概算的，评审机构应督促项目建设单位尽快 编制。
     3. 项目建设程序评审包括对项目立项、项目可行性研究报告、项目 初步设计概算、项目征地拆迁及开工报告等批准文件的程序性评审。
     4. 建筑安装工程概算评审包括对工程量计算、概算定额选用、取费及材料价格等进行评审。
 
         (1) 工程量计算的评审包括:
 
             1 审查工程量计算规则的选用是否正确;
             2 审查工程量的计算是否存在重复计算现象;
             3 审查工程量汇总计算是否正确;
             4 审查施工图设计中是否存在擅自扩大建设规模、提高建设标准等现象。
 
         (2) 定额套用、取费和材料价格的评审包括:
 
             1 审查是否存在高套、错套定额现象;
             2 审查是否按照有关规定计取企业管理费、规费及税金;
             3 审查材料价格的计取是否正确。
 
     5. 设备投资概算评审，主要对设备型号、规格、数量及价格进行评审。
     6. 待摊投资概算和其他投资概算的评审，主要对项目概算中除建筑安装 工程概算、设备投资概算之外的项目概算投资进行评审。

         评审内容包括:
         (1) 建设单位管理费、勘察设计费、监理费、研究试验费、招投标费、 贷款利息等待摊投资概算，按国家规定的标准和范围等进行评审;对土地 使用权费用概算进行评审时， 应在核定用地数量的基础上，区别土地 使用权的不同取得方式进行评审。
         (2) 其他投资的评审，主要评审项目建设单位按概算内容发生并构成 基本建设实际支出的房屋购置和基本禽畜、林木等购置、饲养、培育支出 以及取得各种无形资产和其他资产等发生的支出。
 
     7. 部分项目发生的特殊费用，应视项目建设的具体情况和有关部门 的批复意见进行评审。
     8. 对已招投标或已签订相关合同的项目进行概算评审时，应对招投标 文件、过程和相关合同的合法性进行评审，并据此核定项目概算。 对已开工的项目进行概算评审时，应对截止评审日的项目建设实施情况， 分别按已完、在建和未建工程进行评审。
     9. 概算评审时需要对项目投资细化、分类的，按财政细化基本建设 投资项目概算的有关规定进行评审。
 */

#pragma mark 知识点:设计概算审查的方法
/*
 
 1. 对比分析法
 
     对比分析法主要是指通过建设规模、标准与立项批文对比，工程数量与设计图纸对比，综合范围、内容与编制方法、规定对比，各项取费与规定标准对比，材料、人工单价与统一信息对比，技术经济指标与同类工程对比等等。通过以上对比分析，容易发现设计概算存在的主要问题和偏差。
 
 2. 查询核实法
 
     查询核实法是对一些关键设备和设施、重要装置、引进工程图纸不全、难以核算的较大投资进行多方查询核对，逐项落实的方法。主要设备的市场价向设备供应部门或招标公司查询核实;重要生产装置、设施向同类企业(工程)查询了解;进口设备价格及有关费税向进出口公司调查落实;复杂的建安工程向同类工程的建设、承包、施工单位征求意见;深度不够或不清楚的问题直接向原概算编制人员、设计者询问。
 
 3. 联合会审法
 
     联合会审前，可先采取多种形式分头审查，包括:设计单位自审， 主管、建设、承包单位初审，工程造价咨询公司评审，邀请同行专家 预审，审批部门复审等，经层层审查把关后，由有关单位和专家进行 联合会审。在会审大会上，由设计单位介绍概算编制情况及有关问题， 各有关单位、专家汇报初审及预审意见。然后进行认真分析、讨论， 结合对各专业技术方案的审查意见所产生的投资增减，逐一 核实原 概算出现的问题。经过充分协商，认真听取设计单位意见后，实事求是 地处理、调整。
 */

#pragma mark  ******************************* 1Z103050 5.建设工程项目施工图预算

#pragma mark *********** 1Z103051 施工图预算编制的模式
/*
 
 按照预算造价的计算方式和管理方式的不同，施工图预算可以划分为两种计价模式，即传统计价模式和工程量清单计价模式。
 
 */
#pragma mark 知识点:传统计价模式
/*
 
 
 传统计价模式是采用国家、部门或地区统一规定的定额和取费标准进行工程造价计价的模式，通常也称为定额计价模式。传统计价模式是我国长期使用的一种施工图预算编制方法。
 
 传统计价模式下，由主管部门制定工程预算定额，并且规定间接费的内容和取费标准。建设单位和施工单位均先根据预算定额中规定的工程量计算规则、定额单价计算人、料、机费用，再按照规定的费率和取费程序计取企业管理费、利润、规费和税金，汇总得到工程造价。其中，预算定额单价既包括了消耗量标准，又含有单位价格。
 
 虽然传统计价模式对我国建设工程的投资计划管理和招投标起到过 很大的作用，但也存在一些缺陷。传统计价模式的工、料、机消耗量 是根据"社会平均水平"综合测定，取费标准是根据不同地区价格水平 平均测算，企业自主报价的空间很小，不能结合项目具体情况、自身 技术管理水平和市场价格自主报价，也不能满足招标人对建筑产品 质优价廉的要求。同时，由于工程量计算由投标的各方单独完成， 计价基础不统一，不利于招标工作的规范性。在工程完工后，工程 结算繁琐，易引起争议。
 
 */

#pragma mark 知识点:工程量清单计价模式

/*
 
 工程量清单计价模式是指按照工程量清单规范规定的全国统一工程量计算规则，由招标人提供工程量清单和有关技术说明，投标人根据企业自身的定额水平和市场价格进行计价的模式。
 
 */
#pragma mark *********** 1Z103052 施工图预算的作用
#pragma mark 知识点:施工图预算对建设单位的作用
/*
 
 1. 施工图预算是施工图设计阶段确定建设工程项目造价的依据， 是设计文件的组成部分。
 2. 施工图预算是建设单位在施工期间安排建设资金计划和使用 建设资金的依据。
 3. 施工图预算是招投标的重要基础，既是工程量清单的编制依据， 也是标底编制的依据。
 4. 施工图预算是拨付进度款及办理结算的依据。
 */


#pragma mark 知识点:施工图预算对施工单位的作用
/*
 
 1. 施工图预算是确定投标报价的依据。
 2. 施工图预算是施工单位进行施工准备的依据，是施工单位在施工前 组织材料、机具、设备及劳动力供应的重要参考，是施工单位编制进度 计划、统计完成工作量、进行经济核算的参考依据。
 3. 施工图预算是控制施工成本的依据。根据施工图预算确定的中标价 格是施工单位收取工程款的依据，施工单位只有合理利用各项资源， 采取技术措施、经济措施和组织措施降低成本，将成本控制在施工图 预算以内，施工单位才能获得良好的经济效益。
 */

#pragma mark 知识点:施工图预算对其他方面的作用

/*
 
 1. 对于工程咨询单位而言，尽可能客观、准确地为委托方做出 施工图预算，是其业务水平、素质和信誉的体现。
 2. 对于工程造价管理部门而言，施工图预算是监督检查执行定额 标准、合理确定工程造价、测算造价指数及审定招标工程标底的 重要依据。
 
 */


#pragma mark *********** 1Z103053 施工图预算的编制依据
#pragma mark 知识点:施工图预算的编制依据

/*
 
 1. 国家、行业和地方有关规定;
 2. 相应工程造价管理机构发布的预算定额;
 3. 施工图设计文件及相关标准图集和规范;
 4. 项目相关文件、合同、协议等;
 5. 工程所在地的人工、材料、设备、施工机械市场价格; 6. 施工组织设计和施工方案;
 7. 项目的管理模式、发包模式及施工条件;
 8. 其他应提供的资料。
 
 */

#pragma mark *********** 1Z103054 施工图预算的编制方法
/*
 
 建设工程项目施工图预算由总预算、综合预算和单位工程预算组成。建设工程项目总预算由综合预算汇总而成;综合预算由组成本单项工程的单位工程预算汇总而成;单位工程预算包括建筑工程预算和设备及安装工程预算。
 
 单位工程预算的编制方法有单价法和实物量法，其中单价法分为定额单价法和工程量清单单价法。
 */

#pragma mark 知识点:定额单价法
/*
 
定额单价法是用事先编制好的分项工程的单位估价表来编制施工图预算的方法。根据施工图设计文件和预算定额，按分部分项工程顺序先计算出分项工程量，然后乘以对应的定额单价，求出分项工程人、料、机费用;将分项工程人、料、机费用汇总为单位工程人、料、机费用;汇总后另加企业管理费、利润、规费和税金生成单位工程的施工图预算。
 
 定额单价法编制施工图预算的基本步骤如下:
 1. 准备资料，熟悉施工图纸
 2. 计算工程量
 3. 套用定额单价，计算人、料、机费用
 
     单位工程人、料、机费用=Σ(分项工程量×定额单价) 4. 编制工料分析表
 
 5. 按计价程序计取其他费用，并汇总造价
 6. 复核
 7. 编制说明、填写封面
 
 计算人、料、机费用时需注意以下几项内容:
 (1) 分项工程的名称、规格、计量单位与定额单价或单位估价表中 所列内容完全一致时，可以直接套用定额单价;
 (2) 分项工程的主要材料品种与定额单价或单位估价表中规定材料 不一致时，不可以直接套用定额单价，需要按实际使用材料价格换算 定额单价;
 (3) 分项工程施工工艺条件与定额单价或单位估价表不一致而造成 人工、机械的数量增减时，一般调量不换价;
 (4) 分项工程不能直接套用定额、不能换算和调整时，应编制补充 单位估价表。

 */

#pragma mark 知识点:实物量法
/*
 

 实物量法是依据施工图纸和预算定额的项目划分及工程量计算规则，先计算出分部分项工程量，然后套用预算定额(实物量定额)来编制施工图预算的方法。

 用实物量法编制施工图预算，主要是先用计算出的各分项工程的实物工程量，分别套取预算定额中工、料、机消耗指标，并按类相加，求出单位工程所需的各种人工、材料、施工机械台班的总消耗量，然后分别乘以当时当地各种人工、材料、机械台班的单价，求得人工费、材料费和施工机械使用费，再汇总求和。对于企业管理费、利润等费用的计算则根据当时当地建筑市场供求情况予以具体确定。
 
 采用实物量法编制施工图预算的步骤具体如下:
 1. 准备资料、熟悉施工图纸
 2. 计算工程量
 3. 套用消耗定额，计算人料机消耗量
 4. 计算并汇总人工费、材料费、施工机械使用费
 
     单位工程人、料、机费用 = Σ(工程量×材料预算定额用量×当时当地材料预算价格)
                         +Σ(工程量×人工预算定额用量×当时当地人工工资单价)
                         +Σ(工程量×施工机械预算定额台班用量×当时当地机械台班单价)
 
 5. 计算其他各项费用，汇总造价 6. 复核
 7. 编制说明、填写封面
 
 */

#pragma mark 知识点:定额单价法与实物量法的比较
/*
 

 实物量法编制施工图预算的步骤与定额单价法基本相似，但在具体计算人工费、材料费和机械使用费及汇总三种费用之和方面有一定区别。实物量法编制施工图预算所用人工、材料和机械台班的单价都是当时当地的实际价格，编制出的预算可较准确地反映实际水平，误差较小，适用于市场经济条件波动较大的情况。由于采用该方法需要统计人工、材料、机械台班消耗量，还需搜集相应的实际价格，因而工作量较大、计算过程繁琐。

 */

#pragma mark 知识点:工程量清单单价法

/*
 
 工程量清单单价法是根据国家统一的工程量计算规则计算工程量，采用综合单价的形式计算工程造价的方法。
 
 综合单价是指分部分项工程单价综合了人、料、机费用及其以外的多项费用内容。按照单价综合内容的不同，综合单价可分为全费用综合单价和部分费用综合单价。
 
 1.全费用综合单价
 
     全费用综合单价即单价中综合了人、料、机费用，企业管理费，规费，利润和税金等，以各分项工程量乘以综合单价的合价汇总后，就生成工程承发包价。
 
 2. 部分费用综合单价
 
     我国目前实行的工程量清单计价采用的综合单价是部分费用综合单价，分部分项工程单价中综合了人、料、机费用、管理费、利润，以及一定范围内的风险费用，单价中未包括措施费、其他项目费、规费和税金，是不完全费用综合单价。以各分项工程量乘以部分费用综合单价的合价汇总，再加上项目措施费、其他项目费、规费和税金后，生成工程承发包价。
 */
#pragma mark *********** 1Z103055 施工图预算的审查的内容
#pragma mark 知识点:施工图预算审查的内容
/*
 
 施工图预算审查的重点是工程量计算是否准确，定额套用、各项 取费标准是否符合现行规定或单价计算是否合理等方面。审查的主要 内容如下:
 
     1. 审查施工图预算的编制是否符合现行国家、行业、地方政府 有关法律、法规和规定要求。
     2. 审查工程量计算的准确性、工程量计算规则与计价规范规则或 定额规则的一致性。
     3. 审查在施工图预算的编制过程中，各种计价依据使用是否恰当， 各项费率计取是否正确;审查依据主要有施工图设计资料、有关定额、 施工组织设计、有关造价文件规定和技术规范、规程等。
     4. 审查各种要素市场价格选用是否合理。
     5. 审查施工图预算是否超过设计概算以及进行偏差分析。
 
 */

#pragma mark 知识点:施工图预算审查的步骤

/*

 1. 审查前准备工作
 
     (1) 熟悉施工图纸。
     (2) 根据预算编制说明，了解预算包括的工程范围。如配套设施、
     室外管线、道路以及会审图纸后的设计变更等。
     (3) 弄清所用单位估价表的适用范围，搜集并熟悉相应的单价、定额资料。
 
 2. 选择审查方法、审查相应内容
 
     工程规模、繁简程度不同，编制施工图预算的繁简和质量就不同，应选择适当的审查方法进行审查。
 
 3. 整理审查资料并调整定案
 
     综合整理审查资料，同编制单位交换意见，定案后编制调整预算。经审查若发现差错，应与编制单位协商，统一意见后进行相应增加或核减的修正。
 
 */

#pragma mark 知识点:施工图预算审查的方法
/*
 
 1. 全面审查法
 
     全面审查法又称逐项审查法，即按定额顺序或施工顺序，对各项工程细目逐项全面详细审查的一种方法。其优点是全面、细致，审查质量高、效果好。缺点是工作量大，时间较长。这种方法适合于一些工程量较小、工艺比较简单的工程。
 
 2. 标准预算审查法

     标准预算审查法就是对利用标准图纸或通用图纸施工的工程，先集中力量编制标准预算，以此为准来审查工程预算的一种方法。按标准设计图纸施工的工程，一般上部结构和做法相同，只是根据现场施工条件或地质情况不同，仅对基础部分做局部改变。凡这样的工程，以标准预算为准，对局部修改部分单独审查即可，不需逐一详细审查。该方法的优点是时间短、效果好、易定案。其缺点是适用范围小，仅适用于采用标准图纸的工程。
 
 3. 分组计算审查法
 
     分组计算审查法就是把预算中有关项目按类别划分若干组，利用 同组中的一组数据审查分项工程量的一种方法。这种方法首先将若干 分部分项工程按相邻且有一定内在联系的项目进行编组，利用同组 分项工程间具有相同或相近计算基数的关系，审查一个分项工程数据， 由此判断同组中其他几个分项工程的准确程度。如一般的建筑工程中 将底层建筑面积可编为一组。先计算底层建筑面积或楼(地)面面积， 从而得知楼面找平层、天棚抹灰的工程量等，依次类推。该方法特点 是审查速度快、工作量小。
 
 4. 对比审查法
 
     对比审查法是当工程条件相同时，用已完工程的预算或未完但已经过审查修正的工程预算对比审查拟建工程的同类工程预算的一种方法。
 
     采用该方法一般须符合下列条件。
     (1) 拟建工程与已完或在建工程预算采用同一施工图，但基础部分 和现场施工条件不同，则相同部分可采用对比审查法。
     (2) 工程设计相同，但建筑面积不同，两工程的建筑面积之比与 两工程各分部分项工程量之比大体一致。此时可按分项工程量的比例， 审查拟建工程各分部分项工程的工程量，或用两工程每平方米建筑面积 造价、每平方米建筑面积的各分部分项工程量对比进行审查。
     (3) 两工程面积相同，但设计图纸不完全相同，则相同的部分， 如厂房中的柱子、屋架、屋面、砖墙等，可进行工程量的对照审查。 对不能对比的分部分项工程可按图纸计算。
 
 5. 筛选审查法
 
     "筛选"是能较快发现问题的一种方法。建筑工程虽面积和高度不同， 但其各分部分项工程的单位建筑面积指标变化却不大。将这样的分部 分项工程加以汇集、优选，找出其单位建筑面积工程量、单价、用工的 基本数值，归纳为工程量、价格、用工三个单方基本指标，并注明基本 指标的适用范围。这些基本指标用来筛选各分部分项工程，对不符合 条件的应进行详细审查，若审查对象的预算标准与基本指标的标准不符， 就应对其进行调整。
     "筛选法"的优点是简单易懂，便于掌握，审查速度快，便于发现问题。 但问题出现的原因尚需继续审查。该方法适用于审查住宅工程 或不具备 全面审查条件的工程。
 
 6. 重点审查法
 
    重点审查法就是抓住施工图预算中的重点进行审核的方法。审查的重点一般是工程量大或者造价较高的各种工程、补充定额、计取的各项费用(计费基础、取费标准)等。重点审查法的优点是突出重点，审查时间短、效果好。
 */


#pragma mark  ******************************* 1Z103060 6.工程量清单编制

#pragma mark *********** 1Z103061 工程量清单的作用

#pragma mark 知识点:工程量清单计价规范概述
/*
 
 工程量清单计价是一种主要由市场定价的计价模式。
 
 使用国有资金 投资的建设工程发承包，必须采用工程量清单计价; 非国有资金投资的建设工程，宜采用工程量清单计价;不采用工程量 清单计价的建设工程，应执行本规范除工程量清单等专门性规定外的 其他规定。
 
 《建设工程工程量清单计价规范》 GB 50500-2013 包括规范条文 和附录两部分。规范条文共 16 章，具体内容涵盖了从工程招投标开始 到工程竣工结算办理完毕的全过程。附录共有十一个，附录 A 规定了 物价变化合同价款调整办法，附录 B~附录 K 是在计价表格基础上编写 形成的。
 
 */

#pragma mark 知识点:工程量清单的作用
/*
 
 1. 工程量清单为投标人的投标竞争提供了一个平等和共同的基础
 2. 工程量清单是建设工程计价的依据
 3. 工程量清单是工程付款和结算的依据
 4. 工程量清单是调整工程价款、处理工程索赔的依据
 
 
 */

#pragma mark  ***********  1Z103062 工程量清单编制的方法
/*
 
 

 招标工程量清单必须作为招标文件的组成部分，由招标人提供，并对其准确性和完整性负责。招标工程量清单是工程量清单计价的基础，应作为编制招标控制价、投标报价、计算或调整工程量、索赔等的依据之一，一经中标签订合同，招标工程量清单即为合同的组成部分。招标工程量清单应由具有编制能力的招标人或受其委托、具有相应资质的工程造价咨询人进行编制。

 招标工程量清单应以单位(项)工程为单位编制，应由分部分项工程量清单、措施项目清单、其他项目清单、规费和税金项目清单组成。
 
 招标工程量清单编制的依据有:
 
 (1) 《建设工程工程量清单计价规范》 GB 50500-2013 和相关工程的国家计量规范;
 (2) 国家或省级、行业建设主管部门颁发的计价定额和办法;
 (3) 建设工程设计文件及相关材料;
 (4) 与建设工程有关的标准、规范、技术资料;
 (5) 拟定的招标文件;
 (6) 施工现场情况、地勘水文资料、工程特点及常规施工方案;
 (7) 其他相关资料。
 
 */
#pragma mark 知识点:分部分项工程项目清单的编制

/*
 
 分部分项工程项目工程量清单应按建设工程工程量计量规范的规定，确定项目编码、项目名称、项目特征、计量单位，并按不同专业工程量计量规范给出的工程量计算规则，进行工程量的计算。
 
 1. 项目编码的设置
 
     项目编码是分部分项工程量清单项目名称的数字标识。分部分项工程量清单项目编码以五级编码设置，采用十二位阿拉伯数字表示。一至九位应按《计量规范》的规定设置，十至十二位应根据拟建工程的工程量清单项目名称和项目特征设置，同一招标工程的项目编码不得有重码。
 
     各级编码代表的含义如下:
 
         (1) 第一级为工程分类顺序码(分二位) :房屋建筑与装饰工程为 01 、仿古建筑工程02 、通用安装工程为 03 、市政工程为 04 、园林绿化 工程为 05 、矿山工程为 06 、构筑物工程为 07 、城市轨道交通工程为 08 、爆破工程为 09;
         (2) 第二级为附录分类顺序码(分二位) ;
         (3) 第三级为分部工程顺序码(分二位) ;
         (4) 第四级为分项工程项目顺序码(分三位) ;
         (5) 第五级为工程量清单项目顺序码(分三位)。
 
     以房屋建筑与装饰工程为例的项目编码结构如下图所示:
 
     01-01-01-003-xxx:
     房屋建筑与装饰工程--第一章土石方工程--第一节土方工程--挖沟槽土方--（由工程量清单编制人员编制，从001开始）
 
 2. 项目名称的确定
 
     分部分项工程量清单的项目名称应根据《计量规范》的项目名称结合 拟建工程的实际确定。《计量规范》中规定的"项目名称"为分项工程 项目名称，一般以工程实体命名。
 
     编制工程量清单时，应以附录中的项目名称为基础，考虑该项目的规格、型号、材质等特征要求，并结合拟建工程的实际情况，对其进行适当的调整或细化，使其能够反映影响工程造价的主要因素。
 
 3. 项目特征的描述

     项目特征是指构成分部分项工程量清单项目、措施项目自身价值的本质特征。分部分项工程量清单项目特征应按《计量规范》的项目特征，结合拟建工程项目的实际予以描述。分部分项工程量清单的项目特征是确定一个清单项目综合单价的重要依据，在编制的工程量清单中必须对其项目特征进行准确和全面的描述。
 
     工程量清单项目特征描述的重要意义在于:
     (1) 项目特征是区分清单项目的依据。
     (2) 项目特征是确定综合单价的前提。
     (3) 项目特征是履行合同义务的基础。
 
     清单项目特征主要涉及项目的自身特征(材质、型号、规格、品牌)、项目的工艺特征以及对项目施工方法可能产生影响的特征。
 
     特征描述不清，将导致投标人对招标人的需求理解不全面，达不到正确报价的目的。
 
 4. 计量单位的选择
 
     分部分项工程量清单的计量单位应按《计量规范》的计量单位确定。当计量单位有两个或两个以上时，应根据所编工程量清单项目的特征要求，选择最适宜表述该项目特征并方便计量的单位。
 
     除各专业另有特殊规定外，均按以下基本单位计量:
     (1) 以重量计算的项目一一吨或千克 (t 或kg);
     (2) 以体积计算的项目——立方米(m3);
     (3) 以面积计算的项目——平方米 (m²);
     (4) 以长度计算的项目一一米 (m) ;
     (5) 以自然计量单位计算的项目——个、套、块、组、台......
     (6) 没有具体数量的项目 宗、项......
 
     以"吨"为计量单位的应保留小数点后三位数字，第四位小数四舍五入; 以"立方米"、"平方米"、"米"、"千克"为计量单位的应保留小数点后二位 数字，第三位小数四舍五入;以"项"、"个"等为计量单位的应取整数。
 
 5. 工程量的计算

     分部分项工程量清单中所列工程量应按《计量规范》的工程量计算规则计算。工程量计算规则是指对清单项目工程量计算的规定。除另有说明外，所有清单项目的工程量以实体工程量为准，并以完成后的净值来计算。因此，在计算综合单价时应考虑施工中的各种损耗和需要增加的工程量，或在措施费清单中列入相应的措施费用。采用工程量清单计算规则，工程实体的工程量是唯一的。统一的清单工程量为各投标人提供了一个公平竞争的平台，也方便招标人对各投标人的报价进行对比。
 
 6. 补充项目
 
     编制工程量清单时如果出现《计量规范》附录中未包括的项目， 编制人应做补充，并报省级或行业工程造价管理机构备案。补充项目 的编码由对应计量规范的代码 X (即 01~09)与 B 和三位阿拉伯数字 组成，并应从 XB001 起顺序编制，同一招标工程的项目不得重码。 工程量清单中需附有补充项目的名称、项目特征、计量单位、工程量 计算规则、工作内容。

 */
#pragma mark  知识点:措施项目清单的编制
/*
 
 措施项目清单是指为完成工程项目施工，发生于该工程施工准备和施工过程中的技术、生活、安全、环境保护等方面的项目清单。
 
 措施项目清单必须根据相关工程现行国家计量规范的规定编制。 规范中将措施项目分为能计量和不能计量的两类。对能计量的措施项目 (即单价措施项目) ，同分部分项工程量一样，编制措施项目清单时 应列出项目编码、项目名称、项目特征、计量单位，并按现行计量规范 规定，采用对应的工程量计算规则计算其工程量。对不能计量的措施 项目(即总价措施项目) ，措施项目清单中仅列出了项目编码、项目 名称，但未列出项目特征、计量单位的项目，编制措施项目清单时， 应按现行计量规范附录(措施项目)的规定执行。
 
 由于工程建设施工特点和承包人组织施工生产的施工装备水平、 施工 方案及其管理水平的差异，同一工程、不同承包人组织施工 采用的施工措施有时并不完全一致，因此， 《建设工程工程量清单 计价规范》 GB 50500-2013 规定:措施项目清单应根据拟建工程的 实际情况列项。
 
 措施项目清单的设置，需要:
 
 (1) 参考拟建工程的常规施工组织设计，以确定环境保护、安全文明施工、 临时设施、材料的二次搬运等项目;
 (2) 参考拟建工程的常规施工技术方案，以确定大型机械设备进出场及安 拆、混凝土模板及支架、脚手架、施工排水、施工降水、垂直运输机械、 组装平台等项目;
 (3) 参阅相关的施工规范与工程验收规范，以确定施工方案没有表述的但 为实现施工规范与工程验收规范要求而必须发生的技术措施;
 (4) 确定设计文件中不足以写进施工方案，但要通过一定的技术措施才能 实现的内容;
 (5) 确定招标文件中提出的某些需要通过一定的技术措施才能实现的要求。
 */


#pragma mark 知识点:其他项目清单的编制
/*
 
 其他项目清单是指分部分项工程量清单、措施项目清单所包含的内容以外，因招标人的特殊要求而发生的与拟建工程有关的其他费用项目和相应数量的清单。工程建设标准的高低、工程的复杂程度、工程的工期长短、工程的组成内容、发包人对工程管理的要求等都直接影响其他项目清单的具体内容。
 
 其他项目清单应根据拟建工程的具体情况，参照《建设工程工程量 清单计价规范》 GB 50500-2013 提供的下列 4 项内容列项:
 
 (1) 暂列金额;
 (2) 暂估价:包括材料暂估单价、工程设备暂估价、专业工程 暂估价;
 (3) 计日工;
 (4) 总承包服务。
 
 出现《建设工程工程量清单计价规范》 GB 50500-2013 未列的项目，可根据工程实际情况补充。
 
 1. 暂列金额
 
     暂列金额是招标人暂定并包括在合同中的一笔款项。用于施工合同签订时尚未确定或者不可预见的所需材料、设备、服务的采购，施工中可能发生的工程变更、合同约定调整因素出现时的工程价款调整以及发生的索赔、现场签证确认等的费用。
 
 2. 暂估价
 
     暂估价是指招标人在工程量清单中提供的用于支付必然发生但暂时不能确定价格的材料价款、工程设备价款以及专业工程金额。暂估价是在招标阶段预见肯定要发生，但是由于标准尚不明确或者需要由专业承包人来完成，暂时无法确定具体价格时所采用的一种价格形式。
 
 3. 计日工
 
    计日工是为了解决现场发生的零星工作的计价而设立的。计日工以完成零星工作所消耗的人工工时、材料数量、机械台班进行计量，并按照计日工表中填报的适用项目的单价进行计价支付。计日工适用的所谓零星工作一般是指合同约定之外的或者因变更而产生的、工程量清单中没有相应项目的额外工作，尤其是那些时间不允许事先商定价格的额外工作。

     编制工程量清单时，计日工表中的人工应按工种，材料和机械应按规格、型号详细列项。其中人工、材料、机械数量，应由招标人根据工程的复杂程度，工程设计质量的优劣及设计深度等因素，按照经验来估算一个比较贴近实际的数量，并作为暂定量写到计日工表中，纳入有效投标竞争，以期获得合理的计日工单价。
 
 4. 总承包服务费

     总承包服务费是为了解决招标人在法律、法规允许的条件下进行专业工程发包以及自行采购供应材料、设备时，要求总承包人对发包的专业工程提供协调和配合服务(如分包人使用总包人的脚手架、水电接驳等);对供应的材料、设备提供收、发和保管服务以及对施工现场进行统一管理;对竣工资料进行统一汇总整理等发生并向总承包人支付的费用。招标人应当预计该项费用并按投标人的投标报价向投标人支付该项费用。
 */

#pragma mark 知识点:规费项目清单的编制
/*

 
 规费是指按国家法律、法规规定，由省级政府和省级有关权力部门规定必须缴纳或计取的费用，应计入建筑安装工程造价的费用。
 
 规费项目清单应按照下列内容列项:
 
 (1) 社会保险费:包括养老保险费、失业保险费、医疗保险费、工伤 保险费、生育保险费;
 (2) 住房公积金;
 (3) 工程排污费。
 
 出现《建设工程工程量清单计价规范》 GB 50500-2013 未列的项目，应根据省级政府或省级有关部门的规定列项。
 
 */

#pragma mark 知识点:税金项目清单的编制
/*
 

 建筑安装工程费用的税金是指国家税法规定应计入建筑安装工程造价的增值税销项税额。

 工程造价可按以下公式计算: 工程造价=税前工程造价×(1+11%)

 式中 11% 为建筑业适用增值税税率。由此，税金计算公式:

 税金=税前工程造价×税率(或征收率)

 出现《建设工程工程量清单计价规范)) GB 50500-2013 未列的项目， 应根据税务部门的规定列项。

 */

#pragma mark  ******************************* 1Z103070 7.工程量清单计价
#pragma mark *********** 1Z103071 工程量清单计价的方法

#pragma mark 知识点:工程量清单计价的基本过程
/*
 
 工程量清单计价过程可以分为两个阶段:工程量清单编制和工程量清单应用。
 
     施工组织设计、施工规范、工程验收规范
 
 
     《建设工程量清单计价规范》GB50500-2013 工程量清单编制程序
 
 
 工程量清单  招标人     依据:国家、地区或行业的定额资料;工程造价信息、资料和指数;建设项目特点等            编制招标控制价
           投标人     依据:国家、地区或行业的定额资料;工程造价信息、资料和指数;建设项目特点、企业定额等    编制投标价
           承发包人   依据:合同约定;相关法律法规;建设项目实施情况等                                 进行工程计量;工程价款支付;合同价款调整;索赔与现场签证
           承发包人   依据:合同约定;相关法律法规;建设项目完成情况等                                  进行工程结算
 
                        工程量清单计价应用过程
 */

#pragma mark 知识点:工程量清单计价的方法
/*
 
 (一)工程造价的计算
 
     采用工程量清单计价，建筑安装工程造价由分部分项工程费、措施项目费、其他项目费、规费和税金组成。在工程量清单计价中， 如按分部分项工程单价组成来分，工程量清单计价主要有三种形式: 1工料单价法;2综合单价法;3全费用综合单价法。
 
     工料单价=人工费+材料费+施工机具使用费
 
     综合单价=人工费+材料费+施工机具使用费+管理费+利润
 
     全费用综合单价=人工费+材料费+施工机具使用费+管理费+利润+规费+税金
 
     《计价规范》规定，分部分项工程量清单应采用综合单价计价。
 
 
     利用综合单价法计价需分项计算清单项目，再汇总得到工程总造价。
 
     分部分项工程费=Σ分部分项工程量×分部分项工程综合单价
 
     措施项目费=Σ措施项目工程量×措施项目综合单价+Σ单项措施费
 
     其他项目费=暂列金额+暂估价+计日工+总承包服务费+其他
 
     单位工程报价=分部分项工程费+措施项目费+其他项目费+规费+税金
 
     单项工程报价=Σ单位工程报价
 
     总造价=Σ单项工程报价
 
 (二)分部分项工程费计算

     利用综合单价法计算分部分项工程费需要解决两个核心问题，即确定各分部分项工程的工程量及其综合单价。

     1.分部分项工程量的确定
 
         招标文件中的工程量清单标明的工程量是招标人编制招标控制价和投标人投标报价的共同基础，它是工程量清单编制人按施工图图示尺寸和工程量清单计算规则计算得到的工程净量。但该工程量不能作为承包人在履行合同义务中应予完成的实际和准确的工程量，发承包双方进行工程竣工结算时的工程量应按发承包双方在合同中约定应予计量且实际完成的工程量确定，当然该工程量的计算也应严格遵照工程量清单计算规则，以实体工程量为准。
 
     2. 综合单价的编制
     
         《建设工程工程量清单计价规范》 GB 50500-2013 中的工程量清单综合单价是指完成一个规定清单项目所需的人工费、材料和工程设备费、施工机具使用费和企业管理费、利润以及一定范围内的风险费用。该定义并不是真正意义上的全费用综合单价，而是一种狭义上的综合单价，规费和税金等不可竞争的费用并不包括在项目单价中。
 
         综合单价的计算通常采用定额组价的方法，即以计价定额为基础进行组合计算。
 
         综合单价的计算可以概括为以下步骤:
 
         (1) 确定组合定额子目
 
             清单项目一般以一个"综合实体"考虑，包括了较多的工程内容，计价时，可能出现一个清单项目对应多个定额子目的情况。因此计算 综合单价的第一步就是将清单项目的工程内容与定额项目的工程内容 进行比较，结合清单项目的特征描述，确定拟组价清单项目应该由 哪几个 定额子目来组合。如 “M5 水泥砂浆砌砖基础”项目，按计量 规范不仅包括主项"砖基础"子目，还包括附项"混凝土基础垫层"子目。
 
         (2) 计算定额子目工程量

             由于一个清单项目可能对应几个定额子目，而清单工程量计算的是主项工程量，与各定额子目的工程量可能并不一致;即使一个清单项目对应一个定额子目，也可能由于清单工程量计算规则与所采用的定额工程量计算规则之间的差异，而导致二者的计价单位和计算出来的工程量不一致。因此，清单工程量不能直接用于计价，在计价时必须考虑施工方案等各种影响因素，根据所采用的计价定额及相应的工程量计算规则重新计算各定额子目的施工工程量。定额子目工程量的具体计算方法，应严格按照与所采用的定额相对应的工程量计算规则计算。
 
         (3) 测算人、料、机消耗量
 
             人、料、机的消耗量一般参照定额进行确定。在编制招标控制价时一般参照政府颁发的消耗量定额;编制投标报价时一般采用反映企业水平的企业定额，投标企业没有企业定额时可参照消耗量定额进行调整。
 
         (4) 确定人、料、机单价
 
             人工单价、材料价格和施工机械台班单价，应根据工程项目的具体情况及市场资源的供求状况进行确定，采用市场价格作为参考，并考虑一定的调价系数。
 
         (5) 计算清单项目的人、料、机总费用
 
             按确定的分项工程人工、材料和机械的消耗量及询价获得的人工单价、材料单价、施工机械台班单价，与相应的计价工程量相乘得到各定额子目的人、料、机总费用，将各定额子目的人、料、机总费用汇总后算出清单项目的人、料、机总费用。
 
                 人、料、机总费用=Σ计价工程量 ×(Σ人工消耗量×人工单价+Σ材料消耗量×材料单价+Σ台班消耗量×台班单价)
 
         (6) 计算清单项目的管理费和利润
 
             企业管理费及利润通常根据各地区规定的费率乘以规定的计价基础 得出。通常情况下，计算公式如下:
 
                 管理费=人、料、机总费用×管理费费率
                 利润=(人、料、机总费用+管理费) ×利润率
 
         (7) 计算清单项目的综合单价
 
             将清单项目的人、料、机总费用、管理费及利润汇总得到该清单项目合价，将该清单项目合价除以清单项目的工程量即可得到该清单项目的综合单价。
 
                 综合单价= (人、料、机总费用+管理费+利润) / 清单工程量
 
             如果采用全费用综合单价计价，则还需计算清单项目的规费和税金。
 
 (三)措施项目费计算
 
     措施项目清单计价应根据建设工程的施工组织设计，可以计算工程量的措施项目，应按分部分项工程量清单的方式采用综合单价计价; 其余的不能算出工程量的措施项目，则采用总价项目的方式，以"项" 为单位的方式计价，应包括除规费、税金外的全部费用。措施项目清 单中的安全文明施工费应按照国家或省级、行业建设主管部门的规定 计价，不得作为竞争性费用。
 
     措施项目费的计算方法一般有以下几种:
 
     (1) 综合单价法
 
         这种方法与分部分项工程综合单价的计算方法一样，就是根据需要消耗的实物工程量与实物单价计算措施费，适用于可以计算工程量的措施项目，主要是指一些与工程实体有紧密联系的项目，如混凝土模板、脚手架、垂直运输等。与分部分项工程不同，并不要求每个措施项目的综合单价必须包含人工费、材料费、机具费、管理费和利润中的每一项。计算可参考公式:
 
             措施项目费=Σ(单价措施项目工程量×单价措施项目综合单价)
 
     (2) 参数法计价
 
         参数法计价是指按一定的基数乘系数的方法或自定义公式进行计算。 这种方法简单明了，但最大的难点是公式的科学性、准确性难以把握。 这种方法主要适用于施工过程中必须发生，但在投标时很难具体分项 预测，又无法单独列出项目内容的措施项目。如夜间施工费、二次搬运 费、冬雨期施工的计价均可以采用该方法，计算公式如下:
 
         1.安全文明施工费
 
             安全文明施工费=计算基数×安全文明施工费费率(%)
 
         计算基数应为定额基价(定额分部分项工程费+定额中可以计量的 措施项目费)、定额人工费或(定额人工费+定额机械费)，其费率 由工程应价管理机构根据各专业工程的特点综合确定。
 
         2.夜间施工增加费
 
             夜间施工增加费=计算基数×夜间施工增加费费率 (%)
 
         3.二次搬运费
 
             二次搬运费=计算基数×二次搬运费费率 (%)
 
         4.冬雨期施工增加费
 
             冬雨期施工增加费=计算基数×冬雨季施工增加费费率 (%)
 
         5.已完工程及设备保护费
 
             已完工程及设备保护费=计算基数×已完工程及设备保护费费率(%)
 
         上述2~5项措施项目的计费基数应为定额人工费或(定额人工费+ 定额机械费)，其费率由工程造价管理机构根据各专业工程特点和调查 资料综合分析后确定。
 
     (3) 分包法计价
 
         在分包价格的基础上增加投标人的管理费及风险费进行计价的方法，这种方法适合可以分包的独立项目，如室内空气污染测试等。
 
         有时招标人要求对措施项目费进行明细分析，这时采用参数法组价和分包法组价都是先计算该措施项目的总费用，这就需人为用系数或比例的办法分摊人工费、材料费、机械费、管理费及利润。
 
 (四)其他项目费计算
 
     其他项目费由暂列金额、暂估价、计日工、总承包服务费等内容构成。
 
     暂列金额和暂估价由招标人按估算金额确定。招标人在工程量清单中提供的暂估价的材料、工程设备和专业工程，若属于依法 必须招标的， 由承包人和招标人共同通过招标确定材料、工程设备 单价与专业工程分包价;若材料、工程设备不属于依法必须招标的， 经发承包双方协商确认单价后计价;若专业工程不属于依法必须招 标的，由发包人、总承包人与分包人按有关计价依据进行计价。 计日工和总承包服务费由承包人根据 招标人提出的要求，按估算的 费用确定。
 
 (五)规费与税金的计算
 
     规费是指政府和有关权力部门规定必须缴纳的费用。建筑安装工程税金是指增值税的销项税额。
 
     规费和税金应按国家或省级、行业建设主管部门的规定计算，不得作为竞争性费用。每一项规费和税金的规定文件中，对其计算方法都有明确的说明，故可以按各项法规和规定的计算方式计取。具体计算时，一般按国家及有关部门规定的计算公式和费率标准进行计算。
 
 (六)风险费用的确定

     风险是一种客观存在的、可能会带来损失的、不确定的状态，工程风险是指一项工程在设计、施工、设备调试以及移交运行等项目全寿命周期全过程可能发生的风险。这里的风险具体指工程建设施工阶段承发包双方在招投标活动和合同履约及施工中所面临的涉及工程计价方面的风险。建设工程发承包，必须在招标文件、合同中明确计价中的风险内容及其范围，不得采用无限风险、所有风险或类似语句规定计价中的风险内容及范围。
 */


#pragma mark ***********  1Z103072 招标控制价的编制方法

#pragma mark 知识点:招标控制价的概念
/*
 
 招标控制价是招标人根据国家以及当地有关规定的计价依据和计价办法、招标文件、市场行情，并按工程项目设计施工图纸等具体条件调整编制的，对招标工程项目限定的最高工程造价，也可称其为拦标价、预算控制价或最高报价等。
 
 对于招标控制价及其规定，应注意从以下方面理解:
 (1) 国有资金投资的建设工程招标，招标人必须编制招标控制价。国有 资金投资的工程项目进行招标，招标人可以设标底。
 (2) 招标控制价超过批准的概算时，招标人应将其报原概算审批部门审核。 (3) 投标人的投标报价高于招标控制价的，其投标应予以拒绝。
 (4) 招标控制价应由具有编制能力的招标人或受其委托具有相应资质的 工程造价咨询人编制和复核。工程造价咨询人不得同时接受招标人和 投标人对同一工程的招标控制价和投标报价的编制。
 (5) 招标人应在招标文件中如实公布招标控制价各组成部分的详细内容， 不应上调或下浮。
 
 
 */
#pragma mark 知识点:招标控制价的计价依据
/*
 
 (1) 《建设工程工程量清单计价规范》 GB 50500-2013;
 (2) 国家或省级、行业建设主管部门颁发的计价定额和计价办法;
 (3) 建设工程设计文件及相关资料;
 (4) 拟定的招标文件及招标工程量清单;
 (5) 与建设项目相关的标准、规范、技术资料;
 (6) 施工现场情况、工程特点及常规施工方案;
 (7) 工程造价管理机构发布的工程造价信息，当工程造价信息没有发布时，参照市场价;
 (8) 其他的相关资料。
 
 */
#pragma mark 知识点:招标控制价的编制内容
/*
 
 三、招标控制价的编制内容
 
     (一)分部分项工程费的编制
 
         分部分项工程费采用综合单价的方法编制。采用的分部分项工程量应是招标文件中工程量清单提供的工程量，综合单价应根据招标文件中的分部分项工程量清单的特征描述及有关要求、行业建设主管部门颁发的计价定额和计价办法等编制依据进行编制。
 
         为使招标控制价与投标报价所包含的内容一致，综合单价中应包括招标文件中招标人要求投标人承担的风险内容及其范围(幅度)产生的风险费用，可以风险费率的形式进行计算。招标文件提供了暂估单价的材料，应按暂估单价计入综合单价。
 
     (二)措施项目费的编制
 
         措施项目费应依据招标文件中提供的措施项目清单和拟建工程项目的施工组织设计进行确定。可以计算工程量的措施项目，应按分部分 项工程量清单的方式采用综合单价计价;其余的措施项目可以以"项" 为单位的方式计价，应包括除规费、税金外的全部费用。措施项目费 中的安全文明施工费应当按照国家或地方行业建设主管部门的规定标 准计价。
 
     (三)其他项目费
 
         1.暂列金额
 
             应按招标工程量清单中列出的金额填写。
 
         2. 暂估价
 
             暂估价中的材料、工程设备单价、控制价应按招标工程量清单列出的单价计入综合单价;暂估价专业工程金额应按招标工程量清单中列出的金额填写。
 
         3. 计日工
 
             编制招标控制价时，对计日工中的人工单价和施工机械台班单价应按省级、行业建设主管部门或其授权的工程造价管理机构公布的单价计算;材料应按工程造价管理机构发布的工程造价信息中的材料单价计算，工程造价信息未发布材料单价的材料，其价格应按市场调查确定的单价计算。
 
         4. 总承包服务费
 
             编制招标控制价时，总承包服务费应按照省级或行业建设主管部门的规定，并根据招标文件列出的内容和要求估算。在计算时可参考以下标准:
             (1) 招标人仅要求总包人对其发包的专业工程进行施工现场协调和 统一管理、对竣工材料进行统一汇总整理等服务时，总承包服务费按 发包的专业工程估算造价的 1. 5% 左右计算;
             (2) 招标人要求总包人对其发包的专业工程既进行总承包管理和协调， 又要求提供相应配合服务时，总承包服务费应根据招标文件列出的配 合服务内容，按发包的专业工程估算造价的 3%~5%计算;
             (3) 招标人自行供应材料、设备的，按招标人供应材料、设备价值的 1%计算。
 
     (四)规费和税金
 
         规费和税金必须按国家或省级、行业建设主管部门规定的标准计算，不得作为竞争性费用。
 
 
 */

#pragma mark 知识点:投诉与处理
/*
 
 (1) 投标人经复核认为招标人公布的招标控制价未按照《建设工程 工程量清单计价规范》 GB 50500-2013 的规定进行编制的，应在招标 控制价公布后 5 天内向招投标监督机构和工程造价管理机构投诉。
 (2) 投诉人投诉时，应当提交由单位盖章和法定代表人或其委托人 签名或盖章的书面投诉书。
 
     投诉书包括下列内容:
     1投诉人与被投诉人的名称、地址及有效联系方式;
     2投诉的招标工程名称、具体事项及理由;
     3投诉依据及有关证明材料;
     4相关的请求及主张。
 
 (3) 投诉人不得进行虚假、恶意投诉，阻碍招投标活动的正常进行。
 (4) 工程造价管理机构在接到投诉书后应在 2 个工作日内进行审查， 对有下列情况之一的，不予受理:
     1投诉人不是所投诉招标工程招标文件的收受人;
     2投诉书提交的时间不符合上述第(1)条规定的;
     3投诉书不符合上述第 (2) 条规定的;
     4投诉事项已进入行政复议或行政诉讼程序的。
 (5) 工程造价管理机构应在不迟于结束审查的次日将是否受理投诉的决定书面通知投诉人、被投诉人以及负责该工程招投标监督的招投标管理机构。
 (6) 工程造价管理机构受理投诉后，应立即对招标控制价进行复查， 组织投诉人、被投诉人或其委托的招标控制价编制人等单位人员对 投诉问题逐一核对。有关当事人应当予以配合，并应保证所提供资料 的真实性。
 (7) 工程造价管理机构应当在受理投诉的 10 天内完成复查，特殊 情况下可适当延长，并作出书面结论通知投诉人、被投诉人及负责 该工程招投标监督的招投标管理机构。
 (8) 当招标控制价复查结论与原公布的招标控制价误差>±3% 的， 应当责成招标人改正。
 (9) 招标人根据招标控制价复查结论需要重新公布招标控制价的， 其最终公布的时间至招标文件要求提交投标文件截止时间不足 15 天 的，应相应延长提交投标文件的截止时间。
 
 */
#pragma mark *********** 1Z103073 投标价的编制方法
#pragma mark 知识点:投标报价的概念
/*
 
 《建设工程工程量清单计价规范》 GB 50500-2013 规定，投标 价是投标人参与工程项目投标时报出的工程造价。即投标价是指在 工程招标 发包过程中，由投标人或受其委托具有相应资质的工程 造价咨询人按照 招标文件的要求以及有关计价规定，依据发包人 提供的工程量清单、施工设计图纸，结合工程项目特点、施工现场 情况及企业自身的施工技术、装备和管理水平等，自主确定的工程 造价。
 
 投标价是投标人希望达成工程承包交易的期望价格，但不能高于招标人设定的招标控制价。投标报价的编制是指投标人对拟承建工程项目所要发生的各种费用的计算过程。作为投标计算的必要条件，应预先确定施工方案和施工进度，此外，投标计算还必须与采用的合同形式相一致。
 */

#pragma mark 知识点:投标价的编制原则
/*
 
 (1) 投标报价由投标人自主确定，但必须执行《建设工程工程量清单 计价规范》GB 50500-2013 的强制性规定。投标价应由投标人或受其 委托具有相应资质的工程造价咨询人编制。
 (2) 投标人的投标报价不得低于工程成本。
 (3) 投标人必须按招标工程量清单填报价格。投标人必须按招标人提供 的招标工程量清单填报投标价格，填写的项目编码、项目名称、项目特征、 计量单位、工程量必须与招标工程量清单一致。
 (4) 投标报价要以招标文件中设定的承发包双方责任划分，作为设定 投标报价费用项目和费用计算的基础。
 (5) 应该以施工方案、技术措施等作为投标报价计算的基本条件。
 (6) 报价计算方法要科学严谨，简明适用。
 
 */

#pragma mark 知识点:投标价的编制依据
/*
 
 (1) 《建设工程工程量清单计价规范》 GB 50500-2013;
 (2) 国家或省级、行业建设主管部门颁发的计价办法;
 (3) 企业定额，国家或省级、行业建设主管部门颁发的计价定额和计价办法;
 (4) 招标文件、招标工程量清单及其补充通知、答疑纪要;
 (5) 建设工程设计文件及相关资料;
 (6) 施工现场情况、工程特点及投标时拟定的施工组织设计或施工方案;
 (7) 与建设项目相关的标准、规范等技术资料;
 (8) 市场价格信息或工程造价管理机构发布的工程造价信息;
 (9) 其他的相关资料。
 */

#pragma mark 知识点:投标价的编制与审核
/*
 
 在编制投标报价之前，需要先对清单工程量进行复核。因为工程量清单中的各分部分项工程量并不十分准确，若设计深度不够则可能有较大的误差，而工程量的多少是选择施工方法、安排人力和机械、准备材料必须考虑的因素，自然也影响分项工程的单价，因此一定要对工程量进行复核。
 
 (一)综合单价
 
     综合单价中应包括招标文件中划分的应由投标人承担的风险范围及其费用，招标文件中没有明确的，应提请招标人明确。
 
 (二)单价项目
 
     分部分项工程和措施项目中的单价项目中最主要的是确定综合单价，应根据拟定的招标文件和招投标工程清单项目中的特征描述及有关要求确定综合单价计算，包括:
 
     1. 工程量清单项目特征描述
 
         确定分部分项工程和措施项目中的单价项目综合单价的最重要依据 之一是该清单项目的特征描述，投标人投标报价时应依据招标工程量 清 单项目的特征描述确定清单项目的综合单价。在招投标过程中，若 出现 工程量清单特征描述与设计图纸不符，投标人应以招标工程量清单的项 目特征描述为准，确定投标报价的综合单价;若施工中施工图纸或设计 变更与招标工程量清单项目特征描述不一致，发承包双方应按实际施工 的项目特征依据合同约定重新确定综合单价。
 
     2. 企业定额
 
         企业定额是施工企业根据本企业具有的管理水平、拥有的施工技术和施工机械装备水平而编制的，完成一个规定计量单位的工程项目所需的人工、材料、施工机械台班的消耗标准，是施工企业内部进行施工管理的标准，也是施工企业投标报价确定综合单价的依据之一。投标企业没有企业定额时可根据企业自身情况参照消耗量定额进行调整。
 
     3. 资源可获取价格
 
         综合单价中的人工费、材料费、机械费是以企业定额的人、料、机消耗量乘以人、料、机的实际价格得出的，因此投标人拟投入的人、料、机等资源的可获取价格直接影响综合单价的高低。
 
     4. 企业管理费费率、利润率
 
         企业管理费费率可由投标人根据本企业近年的企业管理费核算数据自行测定，当然也可以参照当地造价管理部门发布的平均参考值。利润率可由投标人根据本企业当前盈利情况、施工水平、拟投标工程的竞争情况以及企业当前经营策略自主确定。
 
     5. 风险费用
 
         招标文件中要求投标人承担的风险费用，投标人应在综合单价中给予考虑，通常以风险费率的形式进行计算。风险费率的测算应根据招标人要求结合投标企业当前风险控制水平进行定量测算。在施工过程中，当出现的风险内容及其范围(幅度)在招标文件规定的范围(幅度)内时，综合单价不得变动，合同价款不作调整。
 
     6. 材料、工程设备暂估价
 
         招标工程量清单中提供了暂估单价的材料、工程设备，按暂估的单价计入综合单价。
 
 (三)总价项目
 
     由于各投标人拥有的施工设备、技术水平和采用的施工方法有所 差异，因此投标人应根据自身编制的投标施工组织设计或施工方案 确 定措施项目，投标人根据投标施工组织设计或施工方案调整和确定 的措施项目应通过评标委员会的评审。
     1. 措施项目中的总价项目应采用综合单价方式报价，包括除规费、 税金外的全部费用;
     2. 措施项目中的安全文明施工费应按照国家或省级、行业主管部门 的规定计算确定。
 
 (四)其他项目费
 
     1. 暂列金额应按照招标工程量清单中列出的金额填写，不得变动。
     2. 暂估价不得变动和更改。暂估价中的材料、工程设备必须按照暂估单价计入综合单价;专业工程暂估价必须按照招标工程量清单中列出的金额填写。
     3. 计日工应按照招标工程量清单列出的项目和估算的数量，自主确 定各项综合单价并计算费用。
     4. 总承包服务费应根据招标工程量列出的专业工程暂估价内容和供 应材料、设备情况，按照招标人提出协调、配合与服务要求和施工现场 管理需要自主确定。
 
 (五)规费和税金
 
     规费和税金必须按同家或省级、行业建设主管部门规定的标准计算，不得作为竞争性费用。
 
 (六)投标总价
 
     投标人的投标总价应当与组成招标工程量清单的分部分项工程费、措施项目费、其他项目费和规费、税金的合计金额相一致，即投标人在进行工程项目工程量清单招标的投标报价时，不能进行投标总价优惠(或降价、让利)，投标人对投标报价的任何优惠(或降价、让利)均应反映在相应清单项目的综合单价中。
 
 */
#pragma mark *********** 1Z103074 合同价款的约定
#pragma mark 知识点:合同类型的选择
/*
 
 建设工程施工合同根据合同计价方式的不同，一般可以分为总价合同、单价合同和成本加酬金合同三种类型。根据价款是否可以调整，总价合同可以分为固定总价合同和可调总价合同两种不同形式;单价合同也可以分为固定单价合同和可调单价合同。

 具体工程项目选择何种合同计价形式，主要依据设计图纸深度、工期长短、工程规模和复杂程度进行确定。
 
 《建设工程工程量清单计价规范》GB 50500-2013 中规定:
 实行工程量清单计价的工程，应采用单价合同;
 建设规模较小，技术难度较低，工期较短，且施工图设计已审查批准的建设工程可以采用总价合同;
 紧急抢险、救灾以及施工技术特别复杂的建设工程可以采用成本加酬金合同。
 
 工程量清单计价的适用性不受合同形式的影响。实践中常见的单价合同 和总价合同两种主要合同形式，均可以采用工程量清单计价， 区别仅在于 工程量清单中所填写的工程量的合同约束力。
 
 采用单价合同形式时，工程量清单是合同文件必不可少的组成内容，其中的工程量一般不具备合同约束力(量可调)，工程款结算时按照合同中约定应予计量并实际完成的工程量计算进行调整。
 
 总价合同形式，工程量清单中的工程量具备合同约束力(量不可调)，工程量以合同图纸的标示内容为准，工程量以外的其他内容一般均赋予合同约束力，以方便合同变更的计量和计价。
 
 总体上来说，采用单价合同符合工程量清单计价模式的基本要求，并且单价合同在合同管理中具有便于处理工程变更及索赔的特点，在工程量清单计价模式下，应采用单价合同。而且在实践中最常用的是固定单价合同，即合同约定的工程价款中所包含的工程量清单项目综合单价在约定条件内是固定的，不予调整，工程量允许调整;工程量清单项目综合单价在约定的条件外，允许调整，但调整的方式、方法应在合同中约定。
 
 
 */

#pragma mark 知识点:合同价款的约定
/*
 
 合同价款的约定是建设工程合同的主要内容。实行招标的工程合同 价款应在中标通知书发出之日起 30 天内，由发承包双方依据招标文件 和中标人的投标文件在书面合同中约定。合同约定不得违背招、投标文 件中关于工期、造价、质量等方面的实质性内容。招标文件与中标人投 标文件不一致的地方应以投标文件为准。不实行招标的工程合同价款， 应在发承包双方认可的工程价款基础上，由发承包双方在合同中约定。 发承包双方认可的工程价款的形式可以是承包方或设计人编制的施工图 预算，也可以是承发包双方认可的其他形式。此外，《建设工程价款结 算暂行办法》(财建 [2004]369 号)还规定:合同价款在合同中约定后， 任何一方不得擅自改变。
 
 承发包双方应在合同条款中，对下列事项进行约定:
 1. 预付工程款的数额、支付时间及抵扣方式
 2. 安全文明施工费
 3. 工程计量与支付工程进度款的方式、数额及时间
 4. 工程价款的调整因素、方法、程序、支付及时间
 5. 施工索赔与现场签证的程序、金额确定与支付时间
 6. 承担计价风险的内容、范围以及超出约定内容、范围的调整办法
 7. 工程竣工价款结算编制与核对、支付及时间
 8. 工程质量保证金的数额、预留方式及时间
 9. 违约责任以及发生合同价款争议的解决方法及时间
 10. 与履行合同、支付价款有关的其他事项等
 
 */

#pragma mark  ******************************* 1Z103080 8.计量与支付
#pragma mark ***********  1Z103081 工程计量

#pragma mark 知识点:工程计量的原则
/*
 
 1. 按合同文件中约定的方法进行计量;
 2. 按承包人在履行合同义务过程中实际完成的工程量计量;
 3. 对于不符合合同文件要求的工程，承包人超出施工图纸范围或因承包人原因造成返工的工程量，不予计量;
 4. 若发现工程量清单中出现漏项、工程量计算偏差，以及工程变更引起工程量的增减变化，应据实调整，正确计量。
 
 */

#pragma mark 知识点:工程计量的依据
/*
 
 1. 质量合格证书
 
     对于承包人已完成的工程，并不是全部进行计量，只有质量达到合同标准的已完工程才予以计量。
 
 2. 《计量规范》和技术规范
 
     《计量规范》和技术规范的"计量支付"条款规定了清单中每一项 工程的计量方法，同时还规定了按规定的计量方法确定的单价所包括 的工作内容和范围。
 
 3. 设计图纸
 
     计量的几何尺寸要以设计图纸为依据，监理工程师对承包人超出设计图纸要求增加的工程量和自身原因造成返工的工程量，不予计量。
 
 */
#pragma mark 知识点:单价合同的计量
/*
 
 (一)计量程序
 
     (1) 承包人应当按照合同约定的计量周期和时间向发包人提交当期 已完工程量报告。发包人应在收到报告后 7 天内核实，并将核实计量 结果通知承包人。发包人未在约定时间内进行核实的，则承包人提交的 计量报告中所列的工程量应视为承包人实际完成的工程量。
     (2) 发包人认为需要进行现场计量核实时，应在计量前 24 小时通知 承包人，承包人应为计量提供便利条件并派人参加。当双方均同意核实 结果时，双方应在上述记录上签字确认。承包人收到通知后不派人参加 计量，视为认可发包人的计量核实结果。发包人不按照约定时间通知 承包人，致使承包人未能派人参加计量，计量核实结果无效。
     (3) 当承包人认为发包人核实后的计量结果有误时，应在收到计量 结果通知后的7天内向发包人提出书面意见，并附上其认为正确的 计量结果和详细的计算资料。发包人收到书面意见后，应在 7 天内 对承包人的计量结果进行复核后通知承包人。承包人对复核计量结果 仍有异议的，按照合同约定的争议解决办法处理。
     (4) 承包人完成已标价工程量清单中每个项目的工程量并经发包人 核实无误后，发承包人应对每个项目的历次计量报表进行汇总，以 核实最终结算工程量，并应在汇总表上签字确认。
 
 (二)工程计量的方法
 
     监理工程师一般只对以下三方面的工程项目进行计量:
     (1) 工程量清单中的全部项目;
     (2) 合同文件中规定的项目;
     (3) 工程变更项目。
 
     一般可按照以下方法进行计量:
 
     (1) 均摊法
 
         所谓均摊法，就是对清单中某些项目的合同价款，按合同工期平均计量。如:为监理工程师提供宿舍，保养测量设备，保养气象记录 设备，维护工地清洁和整洁等。这些项目都有一个共同的特点，即 每月均有发生。所以，可以采用均摊法进行计量支付。例如:保养 气象记录设备，每月发生的费用是相同的，如本项合同款额为 2000 元， 合同工期为 20个月，则每月计量、支付的款额为: 2000元 /20月=100 元/月。
 
     (2) 凭据法
 
        所谓凭据法，就是按照承包人提供的凭据进行计量支付。如建筑工程险保险费、第三方责任险保险费、履约保证金等项目，一般按凭据法进行计量支付。
 
     (3) 估价法
 
         所谓估价法，就是按合同文件的规定，根据监理工程师估算的已完成的工程价值支付。如为监理工程师提供办公设施和生活设施，为监理工程师提供用车，为监理工程师提供测量设备、天气记录设备、通信设备等项目。这类清单项目往往要购买几种仪器设备，当承包人对于某一项清单项目中规定购买的仪器设备不能一次购进时，则需采用估价法进行计量支付。
 
         其计量过程如下:
         1) 按照市场的物价情况，对清单中规定购置的仪器设备分别进行估价;
         2) 按下式计量支付金额:  F=A×(B/D)
         式中
             F——计算的支付金额;
             A—— 清单所列该项的合同金额;
             B——该项实际完成的金额(按估算价格计算) ;
             D——该项全部仪器设备的总估算价格。
 
         1.该项实际完成金额 B 必须按各种设备的估算价格计算，它与承包人 购进的价格无关。
         2.估算的总价与合同工程量清单的款额无关。
 
         当然，估价的款额与最终支付的款额无关，最终支付的款额总是合同清单中的款额。
 
     (4) 断面法
 
         断面法主要用于取土坑或填筑路堤土方的计量。对于填筑土方工程，一般规定计量的体积为原地面线与设计断面所构成的体积。采用这种方法计量时，在开工前承包人需测绘出原地形的断面，并需经监理工程师检查，作为计量的依据。
 
     (5) 图纸法
 
         在工程量清单中，许多项目都采取按照设计图纸所示的尺寸进行计量，如混凝土构筑物的体积、钻孔桩的桩长等。
 
     (6) 分解计量法
 
         所谓分解计量法，就是将一个项目，根据工序或部位分解为若干子项，对完成的各子项进行计量支付。这种计量方法主要是为了解决一些包干项目或较大的工程项目的支付时间过长，影响承包人的资金流动等问题。
 */
#pragma mark 知识点:总价合同的计量
/*
 

 采用工程量清单方式招标形成的总价合同，其工程量的计算应按照单价合同的计量规定计算。

 采用经审定批准的施工图纸及其预算方式发包形成的总价合同，除按照工程变更规定的工程量增减外，总价合同各项目的工程量应为承包人用于结算的最终工程量。此外，总价合同约定的项目计量应以合同工程经审定批准的施工图纸为依据，发承包双方应在合同中约定工程计量的形象进度或事件节点进行计量。
 
 承包人应在合同约定的每个计量周期内对已完成的工程进行计量， 并向发包人提交达到工程形象进度完成的工程量和有关计量资料的 报告。发包人应在收到报告后 7 天内对承包人提交的上述资料进行 复核，以确定实际完成的工程量和工程形象进度。对其有异议的， 应通知承包人进行共同复核。
 
 
 */

#pragma mark *********** 1Z103082 合同价款的调整
#pragma mark 知识点:合同价款应当调整的事项及调整程序
/*
 
 (一)合同价款应当调整的事项
 
     (1) 法律法规变化;
     (2) 工程变更;
     (3) 项目特征不符;
     (4) 工程量清单缺项;
     (5) 工程量偏差;
     (6) 计日工;
     (7) 物价变化;
     (8) 暂估价;
     (9) 不可抗力;
     (10) 提前竣工(赶工补偿);
     (11) 误期赔偿;
     (12) 索赔;
     (13) 现场签证;
     (14) 暂列金额;
     (15) 发承包双方约定的其他调整事项。
 
 (二)合同价款调整的程序
 
     (1) 出现合同价款调增事项(不含工程量偏差、计日工、现场签证、索赔)后的 14 天内，承包人应向发包人提交合同价款调增报告并附上 相关资料;承包人在 14 天内未提交合同价款调增报告的，应视为承包人 对该事项不存在调整价款请求。
     (2) 出现合同价款调减事项(不含工程量偏差、施工索赔)后的 14 天 内，发包人应向承包人提交合同价款调减报告并附相关资料;发包人在 14 天内未提交合同价款调减报告的，应视为发包人对该事项不存在调整 价款请求。
     (3) 发(承)包人应在收到承(发)包人合同价款调增(减)报告及相关资料之日起14 天内对其核实，予以确认的应书面通知承(发)包人。 当有疑问时，应向承(发)包人提出协商意见。发(承)包人在 收到合同价款调增(减)报告之日起 14 天内未确认 也未提出协商意见的，应视为承(发)包人提交的合同价款调增(减) 报告已被发(承)包人认可。
 
         发(承)包人提出协商意见的，承(发)包人应在收到协商意见后的14 天内对其核实，予以确认的应书面通知发(承)包人。承(发)包人 在收到发(承)包人的协商意见后 14 天内既不确认也未提出不同意见的， 应视为发(承)包人提出的意见已被承(发)包人认可。
 
         如果发包人与承包人对合同价款调整的不同意见不能达成一致，只要对承发包双方履约不产生实质影响，双方应继续履行合同义务，直到其按照合同约定的争议解决方式得到处理。
         关于合同价款调整后的支付原则，《建设工程工程量清单计价规范》 GB 50500-2013 规定:经发承包双方确认调整的合同价款，作为追加 (减)合同价款，与工程进度款或结算款同期支付。
 
 */

#pragma mark 知识点:法律法规变化
/*
 
 招标工程以投标截止日前 28 天，非招标工程以合同签订前 28 天 为基准日，其后国家的法律、法规、规章和政策发生变化引起工程 造价增减变化的，发承包双方应当按照省级或行业建设主管部门或 其授权的工程造价管理机构据此发布的规定调整合同价款。
 
 但因承包人原因导致工期的延误的，按上述规定的调整时间，在合同工程原定竣工时间之后，合同价款调增的不予调整，合同价款调减的予以调整。
 
 
 */

#pragma mark 知识点:项目特征不符
/*
 
 (1) 发包人在招标工程量清单中对项目特征的描述，应被认为是 准确的和全面的，并且与实际施工要求相符合。承包人应按照发包人 提供的招标工程量清单，根据其项目特征描述的内容及有关要求实施 合同工程，直到项目被改变为止。
 (2) 承包人应按照发包人提供的设计图纸实施工程合同，若在合同 履行期间出现设计图纸(含设计变更)与招标工程量清单任一项目的 特征描述不符，且该变化引起该项目工程造价增减变化的，应按照 实际施工的项目特征，按规范中工程变更相关条款的规定重新确定 相应工程量清单项目的综合单价，并调整合同价款。
 
 */

#pragma mark 知识点:工程量清单缺项
/*
 
 导致工程量清单缺项的原因，一是设计变更，二是施工条件改变，三是工程量清单编制错误。
 
 《建设工程工程量清单计价规范》 GB 50500-2013 对这部分的规定如下:
 (1) 合同履行期间，由于招标工程量清单中缺项，新增分部分项工程量清单项目的，应按照规范中工程变更相关条款确定单价，并调整合同价款。
 (2) 新增分部分项工程量清单项目后，引起措施项目发生变化的，应按照规范中工程变更相关规定，在承包人提交的实施方案被发包人批准后调整合同价款。
 (3) 由于招标工程量清单中措施项目缺项，承包人应将新增措施项目 实施方案提交发包人批准后，按照规范相关规定调整合同价款。
 
 
 */

#pragma mark 知识点:工程量偏差
/*
 
 《建设工程工程量清单计价规范)) GB 50500-2013 对这部分的 规定如下:
 
 (1) 合同履行期间，当予以计算的实际工程量与招标工程量清单 出现偏差，且符合下述两条规定的，发承包双方应调整合同价款。
 (2) 对于任一招标工程量清单项目，如果因工程量偏差和工程变更 等原因导致工程量偏差超过 15% 时，可进行调整。当工程量增加 15% 以上时，增加部分的工程量的综合单价应予调低;当工程量 减少 15% 以上时，减少后剩余部分的工程量的综合单价应予调高。
 (3) 如果工程量出现超过 15% 的变化，且该变化引起相关措施 项目相应发生变化时，按系数或单一总价方式计价的，工程量增加的 措施项目费调增，工程量减少的措施项目费调减。
 
 
 
 当合同中没有约定时，工程量偏差超过 15% 时的调整方法， 可参照如下公式:
 
 1. 当Q1>1.15Q0时，S=1.15Q0×P0+( Q1-1.15Q0)×P1
 2. 当Q1<0.85Q0时，S=Q1×P1
 
 式中 S——调整后的某一分部分项工程费结算价;
     Q1——最终完成的工程量;
     Q0——招标工程量清单中列出的工程量;
     P1——按照最终完成工程量重新调整后的综合单价;
     P0——承包人在工程量清单中填报的综合单价。
 
 因工程量偏差和工程变更等原因导致工程量偏差超过 15% 进行调整时，关键是确定新的综合单价，即 P1 确定的方法:
 一是发承包双方协商确定，
 二是与招标控制价相联系。
 
 
 当工程量偏差项目出现承包人在工程量清单中填报的综合单价与
 发包人招标控制价相应清单项目的综合单价偏差超过 15% 时，工程量 偏差项目综合单价的调整可参考以下公式:
 (3)当 P0 <P2 × (1 -L) × (1 -15%) 时，该类项目的综合单价:
     P1 按照 P2 ×(1 -L)×(1 -15%) 调整
 (4)当 P0>P2 ×(1 +15%) 时，该类项目的综合单价:
     P1 按照 P2×(1+ 15%) 调整
 (5) 当P0> P2 × (1 -L) × (1 -15%)或P0 < P2 × (1+ 15%) 时，可不调整。
 
 式中 P0一一承包人在工程量清单中填报的综合单价;
     P2一一发包人在招标控制价相应项目的综合单价;
     L一一计价规范中定义的承包人报价浮动率。
 
 承包人报价浮动率可按下列公式计算:
 1) 招标工程:
     承包人报价浮动率 L= (1- 中标价/招标控制价) × 100%
 2) 非招标工程:
     承包人报价浮动率 L= (1- 报价值/施工图预算) × 100%
 */

#pragma mark 知识点:计日工
/*
 
 发包人通知承包人以计日工方式实施的零星工作，承包人应予执行。
 采用计日工计价的任何一项变更工作，在该项变更的实施过程中，承包人应按合同约定提交下列报表和有关凭证送发包人复核:
 (1) 工作名称、内容和数量;
 (2) 投入该工作所有人员的姓名、工种、级别和耗用工时;
 (3) 投入该工作的材料名称、类别和数量;
 (4) 投入该工作的施工设备型号、台数和耗用台时;
 (5) 发包人要求提交的其他资料和凭证。
 
 《建设工程工程量清单计价规范》 GB 50500-2013 对计日工生效 计价的原则做了以下规定:任一计日工项目持续进行时，承包人应在 该项工作实施结束后的 24 小时内向发包人提交有计日工记录汇总的 现场签证报告一式三份。发包人在收到承包人提交现场签证报告后的7 天内予以确认并将其中一份返还给承包人，作为计日工计价和支付的 依据。发包人逾期未确认也未提出修改意见的，应视为承包人提交的 现场签证报告已被发包人认可。
 
 任一计日工项目实施结束后，承包人应按照确认的计日工现场签证报告核实该类项目的工程数量，并应根据核实的工程数量和承包人已标价工程量清单中的计日工单价计算，提出应付价款;已标价工程量清单中没有该类计日工单价的，由发承包双方按工程变更的相关规定商定计日工单价计算。
 
 每个支付期末，承包人应按照规范中进度款的相关条款规定向发包人提交本期间所有计日工记录的签证汇总表，以说明本期间自己认为有权得到的计日工金额，调整合同价款，列入进度款支付。
 
 
 */

#pragma mark 知识点:物价变化
/*
 
 为解决由于市场价格波动引起合同履行的风险问题，《建设工程施工 合同(示范文本)》 GF-2013 0201 (以下简称《建设工程施工合同(示范 文本) 》中引入了适度风险适度调价的制度，亦称之为合理调价制度， 其法律基础是合同风险的公平合理分担原则。
 
 合同履行期间，因人工、材料、工程设备、机械台班价格波动影响 合同价款时，应根据合同约定的方法(如价格指数调整法或造价信息 差额调整法)计算调整合同价款。承包人采购材料和工程设备的，应在 合同中约定主要材料、工程设备价格变化的范围或幅度;当没有约定， 且材料、工程设备单价变化超过 5% 时，超过部分的价格应按照价格 指数调整法或造价信息差额调整法计算调整材料、工程设备费。
 
 发生合同工程工期延误的，应按照下列规定确定合同履行期应予调整的价格:
 (1) 因非承包人原因导致工期延误的，计划进度日期后续工程的价格， 应采用计划进度日期与实际进度日期两者的较高者;
 (2) 因承包人原因导致工期延误的，计划进度日期后续工程的价格， 应采用计划进度日期与实际进度日期两者的较低者。
    (违约者不受益原则)
 
 发包人供应材料和工程设备的，不适用上述规定，应由发包人按照实际变化调整，列入合同工程的工程造价内。
 
 (一)采用价格指数进行价格调整
 
     价格调整公式:
 
     P=P0×(a0+a1 × A/A0+a2 × B/B0+a3× C/C0+......)
 
     式中
     P——调值后合同价款中的工程进度款或工程实际结算款
     P0——调值前合同价款中的工程进度款或工程实际结算款
     a0——固定系数，代表合同支付中不能调整的部分在合同总价中所占的比例
     a1、a2、a3——代表可调整部分在合同总价中所占的比例
        a0 +a1+a2+a3+......=1
     A0、B0、C0——各可调因子的基本价格指数，指基准日的各
        可调因子的价格指数
     A、B、C——各可调因子现行的价格指数，指约定的付款证书
        相关周期最后一天的前42天的各可调因子的价格指数
 
 (二)采用造价信息进行价格调整
 
     合同履行期间，因人工、材料、工程设备和机械台班价格波动影响合同价格时，人工、机械使用费按照国家或省、自治区、直辖市建设行政管理部门、行业建设管理部门或其授权的工程造价管理机构发布的人工成本信息、机械台班单价或机械使用费系数进行调整;需要进行价格调整的材料，其单价和采购数应由发包人复核，发包人确认需调整的材料单价及数量作为调整合同价款差额的依据。
 
    (1) 人工单价发生变化且符合计价规范中计价风险相关规定时， 发承包双方应按省级或行业建设主管部门或其授权的工程造价管理 机构发布的人工成本文件调整合同价款。
 
         【原则:涨以高价为基础，跌以低价为基础。】
 
     (2) 材料、工程设备价格变化的价款调整按照发包人提供的主要材料和 工程设备一览表，由发承包双方约定的风险范围按以下规定调整合同价款:
         1) 承包人投标报价中材料单价低于基准单价:施工期间材料单价涨幅 以基准单价为基础超过合同约定的风险幅度值，或材料单价跌幅以投标报价 为基础超过合同约定的风险幅度值时，其超过部分按实调整。
         2) 承包人投标报价中材料单价高于基准单价:施工期间材料单价跌幅 以基准单价为基础超过合同约定的风险幅度值，或材料单价涨幅以投标报价 为基础超过合同约定的风险幅度值时，其超过部分按实调整。
         3) 承包人投标报价中材料单价等于基准单价:施工期间材料单价涨、跌 幅以基准单价为基础超过合同约定的风险幅度值时，其超过部分按实调整。
         4) 承包人应在采购材料前将采购数量和新的材料单价报发包人核对， 确认用于本合同工程时，发包人应确认采购材料的数量和单价。发包人 在收到承包人报送的确认资料后 3 个工作日不予答复的视为已经认可， 作为调整合同价款的依据。如果承包人未报经发包人核对即自行采购 材料，再报发包人确认调整合同价款的，如发包人不同意，则不作调整。
 
         前述基准价格是指由发包人在招标文件或专用合同条款中给定的材料、工程设备的价格，该价格原则上应当按照省级或行业建设主管部门或其授权的工程造价管理机构发布的信息价编制。
 */

#pragma mark 知识点:暂估价
/*
 
 (一)材料、工程设备暂估价
 
    发包人在招标工程量清单中给定暂估价的材料、 工程设备属于依法 必须招标的，由发承包双方以招标的方式选择供应商，确定价格， 并应以此为依据取代暂估价，调整合同价款。实践中，恰当的做法是 仍由总承包中标人作为招标人，采购合同应由总承包人签订。
 
     发包人在招标工程量清单中给定暂估价的材料、工程设备不属于依法必须招标的，应由承包人按照合同约定采购，经发包人确认单价后取代暂估价，调整合同价款。
 
 (二)专业工程暂估价

     发包人在工程量清单中给定暂估价的专业工程不属于依法必须招标的，应按照工程变更价款的确定方法确定专业工程价款。并以此为依据取代专业工程暂估价，调整合同价款。

     发包人在招标工程量清单中给定暂估价的专业工程，依法必须招标的，应当由发承包双方依法组织招标选择专业分包人，并接受有管辖权的建设工程招标投标管理机构的监督，还应符合下列要求:
 
     (1) 除合同另有约定外，承包人不参加投标的专业工程发包招标，应由承包人作为招标人，但拟定的招标文件、评标工作、评标结果应报送发包人批准。与组织招标工作有关的费用应当被认为已经包括在承包人的签约合同价(投标总报价)中。
     (2) 承包人参加投标的专业工程发包招标，应由发包人作为招标人， 与组织招标工作有关的费用由发包人承担。同等条件下，应优先 选择承包人中标。
     (3) 应以专业工程发包中标价为依据取代专业工程暂估价，调整 合同价款。
 
 
 */


#pragma mark 知识点:不可抗力
/*
 
 因不可抗力事件导致的人员伤亡、财产损失及其费用增加，发承包双方应按以下原则分别承担并调整合同价款和工期:
 
 (1) 合同工程本身的损害、因工程损害导致第三方人员伤亡和财产损失 以及运至施工场地用于施工的材料和待安装的设备的损害，由发包人承担;
 (2) 发包人、承包人人员伤亡由其所在单位负责，并应承担相应费用;
 (3) 承包人的施工机械设备损坏及停工损失，应由承包人承担;
 (4) 停工期间，承包人应发包人要求留在施工场地的必要的管理人员及 保卫人员的费用，应由发包人承担;
 (5) 工程所需清理、修复费用，应由发包人承担。
     不可抗力解除后复工的，若不能按期竣工，应合理延长工期。发包人要求赶工的，赶工费用应由发包人承担。
 
 
 */

#pragma mark 知识点:提前竣工(赶工补偿)
/*
 
 《建设工程工程量清单计价规范》 GB 50500-2013 规定:
 
 (1) 工程发包时，招标人应当依据相关工程的工期定额合理计算 工期，压缩的工期天数不得超过定额工期的 20% ，将其量化。 超过者，应在招标文件中明示增加赶工费用。
 (2) 工程实施过程中，发包人要求合同工程提前竣工的，应征得 承包人同意后与承包人商定采取加快工程进度的措施，并应修订合同 工程进度计划。发包人应承担承包人由此增加的提前竣工(赶工补偿) 费用。
 (3) 发承包双方应在合同中约定提前竣工每日历天应补偿额度，此项 费用应作为增加合同价款列入竣工结算文件中，应与结算款一并支付。
 
 赶工费用主要包括:
 
     1.人工费的增加，例如新增加投入人工的报酬，不经济使用人工的 补贴等;
     2.材料费的增加，例如可能造成不经济使用材料而损耗过大，材料 提前交货可能增加的费用以及材料运输费的增加等;
     3.机械费的增加，例如可能增加机械设备投入，不经济使用机械等。
 
 
 
 */
#pragma mark 知识点:暂列金额
/*
 

 暂列金额是指招标人在工程量清单中暂定并包括在合同价款中的一笔款项。用于工程合同签订时尚未确定或者不可预见的所需材料、工程设备、服务的采购，施工中可能发生的工程变更、合同约定调整因素出现时的合同价款调整以及发生的索赔、现场签证等确认的费用。

 投标人只需要直接将招标工程量清单中所列的暂列金额纳入投标总价，并且不需要在所列的暂列金额以外再考虑任何其他费用。

 已签约合同价中的暂列金额由发包人掌握使用。发包人按照合同的规定作出支付后，如有剩余，则暂列金额余额归发包人所有。
 
 */
#pragma mark *********** 1Z103083 工程变更价款的确定
#pragma mark 知识点:《建设工程施工合同(示范文本)》条件下的构成变更
/*
 
 (1) 发包人对原设计进行变更。施工中发包人如果需要对原工程设计 进行变更，应提前14 天以书面形式向承包人发出变更通知。承包人 对于发包人的变更通知没有拒绝的权利，这是合同赋予发包人的一项 权利。但是，变更超过原设计标准或批准的建设规模时，发包人应报 规划管理部门和其他有关部门重新审查批准，并由原设计单位提供 变更的相应图纸和说明。承包人按照监理工程师发出的变更通知及 有关要求变更。
 
 (2) 承包人对原设计进行变更。施工中承包人不得为了施工方便而 要求对原工程设计进行变更，承包人应当严格按照图纸施工，不得 随意变更设计。施工中承包人提出的合理化建议涉及对设计图纸或者 施工组织设计的更改及对原材料、设备的更换，须经监理工程师同意。 监理工程师同意变更后，也须经原规划管理部门和其他有关部门审查 批准，并由原设计单位提供变更的相应图纸和说明。
 
     未经监理工程师同意承包人擅自更改或换用，承包人应承担由此发生的费用，并赔偿发包人的有关损失，延误的工期不予顺延。监理工程师同意采用承包人的合理化建议，所发生费用和获得收益的分担或分享，由发包人和承包人另行约定。
 
 (3) 其他变更。从合同角度看，除设计变更外，其他能够导致合同 内容变更的都属于其他变更。如双方对工程质量要求的变化(如: 涉及强制性标准的变化)、双方对工期要求的变化、施工条件和环境 的变化导致施工机械和材料的变化等。这些变更的程序，首先应当 由一方提出，与对方协商一致后，方可进行变更。
 
 
 */

#pragma mark 知识点:工程变更价款的确定方法
/*
 
 (一)已标价工程量清单项目或其工程数量发生变化的调整办法
 
     (1) 已标价工程量清单中有适用于变更工程项目的，应采用该项目的单价;但当工程变更导致该清单项目的工程数量发生变化，且工程 量 偏差超过 15% ，此时，调整的原则为:当工程量增加 15% 以上 时，其增加部分的工程量的综合单价应予调低;当工程量减15% 以上 时，减少后剩余部分的工程量的综合单价应予调高。
 
     (2) 已标价工程量清单中没有适用但有类似于变更工程项目的， 可在合理范围内参照类似项目的单价。
 
     (3) 已标价工程量清单中没有适用也没有类似于变更工程项目的， 应由承包人根据变更工程资料、计量规则和计价办法、工程造价管理 机构发布的信息价格和承包人报价浮动率提出变更工程项目的单价， 报发包人确认后调整
 
     (4) 已标价工程量清单中没有适用也没有类似于变更工程项目， 且工程造价管理机构发布的信息价格缺价的，应由承包人根据变更 工程资料、计量规则、计价办法和通过市场调查等取得有合法依据的 市场价格提出变更工程项目的单价，并应报发包人确认后调整。
 
 (二)措施项目费的调整
 
     工程变更引起施工方案改变并使措施项目发生变化时，承包人提出调整措施项目费的，应事先将拟实施的方案提交发包人确认，并应详细说明与原方案措施项目相比的变化情况。拟实施的方案经发承包双方确认后执行，并应按照下列规定调整措施项目费:
 
     (1) 安全文明施工费应按照实际发生变化的措施项目调整，不得浮动。
     (2) 采用单价计算的措施项目费，应按照实际发生变化的措施项目 按照前述已标价工程量清单项目的规定确定单价。
     (3) 按总价(或系数)计算的措施项目费，按照实际发生变化的措施 项目调整，但应考虑承包人报价浮动因素，即调整金额按照实际调整 金额乘以承包人报价浮动率计算。
 
         如果承包人未事先将拟实施的方案提交给发包人确认，则视为工程变更不引起措施项目费的调整或承包人放弃调整措施项目费的权利。
 
 (三 )工程变更价款调整方法的应用
 
     (1) 直接采用适用的项目单价的前提是其采用的材料、施工工艺和方法相同，也不因此增加关键线路上工程的施工时间。
     (2) 采用适用的项目单价的前提是其采用的材料、施工工艺和方法 基本类似，不增加关键线路上工程的施工时间，可仅就其变更后的差异 部分，参考类似的项目单价由承包人提出新的项目单价，经发包人确认。
     (3) 无法找到适用和类似的项目单价时，应采用招投标时的基础 资料和工程造价管理机构发布的信息价格，按成本加利润的原则 由承包人提出新的综合单价，经发包人确认。
     (4) 无法找到适用和类似的项目单价、工程造价管理机构也没有 发布此类信息价格，由承包人提出新的综合单价，经发包人确认。
 
     经过认真分析，钻孔桩做静载破坏试验的费用主要由两部分构成，一部分为试验费用，另一部分为桩本身的费用，而试验方法及设备并未因试验桩直径的改变而发生变化。
     因此，可认为试验费用没有增减，费用的增减主要由钻孔桩直径 变化而引起的桩本身的费用的变化。直径为1. 2m 的普通钻孔桩的 单价在工程量清单中就可以找到，且地理位置和施工条件相近。
     因此，采用直径为1. 2m 的钻孔桩做静载破坏试验的费用为: 直径为1. 0m 静载破坏试验费+直径为1. 2m 的钻孔桩的清单价格。

     监理工程师认为承包人的意见可以接受，不宜直接套用清单中的 管涵价格。经与承包人协商，决定采用工程量清单上的几何尺寸、 地理位置等条件相近的管涵价格作为新增工程的基本单价，但对其中 的"土方开挖"一项在原报价基础上按某个系数予以适当提高，提高的 费用叠加在基本单价上，构成新增工程价格。
 
 
 */
#pragma mark *********** 1Z103084 施工索赔与现场签证
#pragma mark 知识点:施工索赔

/*
 
 (一)索赔的成立条件
 
     当合同一方向另一方提出索赔时，应有正当的索赔理由和有效证据，并应符合合同的相关约定。由此可看出任何索赔事件成立必须满足的三要素:正当的索赔理由;有效的索赔证据;在合同约定的时间内提出。
 
     索赔证据应满足以下基本要求:真实性、全国性、关联性、及时性并具有法律证明效力。
 
 (二)承包人索赔

     1. 承包人提出索赔的程序
 
         (1) 承包人应在知道或应当知道索赔事件发生后 28 天内，向发包人提交索赔意向通知书，说明发生索赔事件的事由。承包人逾期未发出索赔意向通知书的，丧失索赔的权利。
         (2) 承包人应在发出索赔意向通知书后 28 天内，向发包人正式提交 索赔通知书。索赔通知书应详细说明索赔理由和要求，并应附必要的 记录和证明材料。
         (3) 索赔事件具有连续影响的，承包人应继续提交延续索赔通知， 说明连续影响的实际情况和记录。
         (4) 在索赔事件影响结束后的 28 天内，承包人应向发包人提交最终 索赔通知书，说明最终索赔要求，并应附必要的记录和证明材料。
 
     2. 承包人索赔的处理程序
 
         (1) 发包人收到承包人的索赔通知书后，应及时查验承包人的记录和证明材料。
         (2) 发包人应在收到索赔通知书或有关索赔的进一步证明材料后的
             28 天内，将索赔处理结果答复承包人，如果发包人逾期未作出答复， 视为承包人索赔要求已被发包人被认可。
         (3) 承包人接受索赔处理结果的，索赔款项应作为增加合同价款， 在当期进度款中进行支付;承包人不接受索赔处理结果的，应按合同 约定的争议解决方式处理。
 
     3. 承包人索赔的赔偿方式
 
         承包人要求赔偿时，可以选择以下一项或几项方式获得赔偿:
         (1) 延长工期;
         (2) 要求发包人支付实际发生的额外费用;
         (3) 要求发包人支付合理的预期利润;
         (4) 要求发包人按合同的约定支付违约金。
 

         当承包人的费用索赔与工期索赔要求相关联时，发包人在作出费用索赔的批准决定时，应结合工程延期，综合作出费用赔偿和工程延期的决定。

         发承包双方在按合同约定办理了竣工结算后，应被认为承包人已无权再提出竣工结算前所发生的任何索赔。承包人在提交的最终结清申请中，只限于提出竣工结算后的索赔，提出索赔的期限应自发承包双方最终结清时终止。
 
 (三)发包人索赔
 
     1. 发包人提出索赔的程序
 
         根据合同约定，发包人认为由于承包人的原因造成发包人的损失， 宜按承包人索赔的程序进行索赔。当合同中对此未作具体约定时， 按以下规定办理:
         (1) 发包人应在确认索赔事件发生后的 28 天内向承包人发出索赔 通知，否则，承包人免除该索赔的全部责任。
         (2) 承包人应在收到发包人索赔报告后的 28 天内作出回应，表示 同意或不同意并附具体意见，如在收到索赔报告后的 28 天内未向 发包人作出答复，视为该项索赔报告已经被认可。
 
     2. 发包人索赔的赔偿方式 发包人要求赔偿时，可以选择以下一项或几项方式获得赔偿:
         (1) 延长质量缺陷修复期限;
         (2) 要求承包人支付实际发生的额外费用;
         (3) 要求承包人按合同的约定支付违约金。
 
         承包人应付给发包人的索赔金额可从拟支付给承包人的合同价款中扣除，或由承包人以其他方式支付给发包人。
 
 (四 )索赔的计算方法
 
     1. 索赔费用的组成 索赔费用的组成与建筑安装工程造价的组成相似，一般包括以下几个方面。
 
         (1) 分部分项工程量清单费用
 
             工程量清单漏项或非承包人原因的工程变更，造成增加新的工程量清单项目，其对应的综合单价的确定参见工程变更价款的确定原则。
 
             1)人工费。包括增加工作内容的人工费、停工损失费和工作效率降低的损失费等累计，其中增加工作内容的人工费应按照计日工费计算，而停工损失费和工作效率降低的损失费按窝工费计算，窝工费的标准双方应在合同中约定。
 
             2) 设备费。可采用机械台班费、机械折旧费、设备租赁费等几种 形式。当工作内容增加引起设备费索赔时，设备费的标准按照机械台 班费计算。因窝工引起的设备费索赔，当施工机械属于施工企业自有 时，按照机械折旧费计算索赔费用;当施工机械是施工企业从外部 租赁时，索赔费用的标准按照设备租赁费计算。
             3) 材料费。包括索赔事件引起的材料用量增加、材料价格大幅度 上涨、非承包人原因造成的工期延误而引起的材料价格上涨和材料 超期存储费用。
             4) 管理费。此项又可分为现场管理费和企业管理费两部分，由于 二者的计算方法不一样，所以在审核过程中应区别对待。
             5) 利润。对工程范围、工作内容变更等引起的索赔，承包人可按 原报价单中的利润百分率计算利润。
             6) 迟延付款利息。发包人未按约定时间进行付款的，应按约定利率 支付迟延付款的利息。
 
         (2) 措施项目费用

             因分部分项工程量清单漏项或非承包人原因的工程变更，引起措施项目发生变化，造成施工组织设计或施工方案变更，造成措施费发生变化时，已有的措施项目，按原有措施费的组价方法调整;原措施费中没有的措施项目，由承包人根据措施项目变更情况，提出适当的措施费变更，经发包人确认后调整。
 
         (3) 其他项目费
 
             其他项目费中所涉及的人工费、材料费等按合同的约定计算。
 
         (4) 规费与税金
 
             除工程内容的变更或增加，承包人可以列入相应增加的规费与税金。其他情况一般不能索赔。
             索赔规费与税金的款额计算通常是与原报价单中的百分率保持一致。
 
     2. 索赔费用的计算方法
 
         索赔费用的计算方法主要有:实际费用法、总费用法和修正总费用法。
 
         (1)实际费用法

             实际费用法是施工索赔时最常用的一种方法。该方法是按照各索赔事件所引起损失的费用项目分别分析计算索赔值，然后将各个项目的索赔值汇总，即可得到总索赔费用值。这种方法以承包商为某项索赔工作所支付的实际开支为根据，但仅限于由于索赔事件引起的、超过原计划的费用，故也称额外成本法。在这种计算方法中，需要注意的是不要遗漏费用项目。
 
         (2) 总费用法
 
             即发生了多起索赔事件后，重新计算该工程的实际费用，再减去 原合同价，其差额即为承包人索赔的费用。计算公式为:
 
                 索赔金额=实际总费用-投标报价估算费用
 
             但这种方法对业主不利，因为实际发生的总费用中可能有承包人的施工组织不合理因素;承包人在投标报价时为竞争中标而压低报价，中标后通过索赔可以得到补偿。所以这种方法只有在难以采用实际费用法时采用。
 
         (3) 修正总费用法
 
             即在总费用计算的原则上，去掉一些不合理的因素，使其更合理。
 
             修正的内容包括:
 
                 1.将计算索赔款的时段局限于受到外界影响的时间，而不是整个施工期;
                 2.只计算受到影响时段内的某项工作所受影响的损失，而不是计算该时段 内所有施工工作所受的损失;
                 3.对投标报价费用重新进行核算，按受影响时段内该项工作的实际单价 进行核算，乘以完成的该项工作的工程量，得出调整后的报价费用。
 
             按修正后的总费用计算索赔金额的公式为:
 
             索赔金额=某项工作调整后的实际总费用 - 该项工作的报价费
 */

#pragma mark 知识点:现场签证
/*
 
 (一)现场签证的范围
 
     (1) 适用于施工合同范围以外零星工程的确认;
     (2) 在工程施工过程中发生变更后需要现场确认的工程量;
     (3) 非承包人原因导致的人工、设备窝工及有关损失;
     (4) 符合施工合同规定的非承包人原因引起的工程量或费用增减;
     (5) 确认修改施工方案引起的工程量或费用增减;
     (6) 工程变更导致的工程施工措施费增减等。
 
 (二)现场签证的程序
 
     承包人应发包人要求完成合同以外的零星工作或非承包人责任事件发生时，承包人应按合同约定及时向发包人提出现场签证。当合同对现场签证未作具体约定时，按照《建设工程价款结算暂行办法》的规定处理:
     (1) 承包人应在接受发包人要求的 7 天内向发包人提出签证， 发包人签证后施工。若没有相应的计日工单价，签证中还应包括用工 数量和单价、机械台班数量和单价、使用材料品种及数量和单价等。 若发包人未签证同意，承包人施工后发生争议的，责任由承包人自负。
     (2) 发包人应在收到承包人的签证报告 48 小时内给予确认或提出 修改意见，否则视为该签证报告已经认可。
     (3) 发承包双方确认的现场签证费用与工程进度款同期支付。
 
 (三)现场签证费用的计算
 
     现场签证费用的计价方式包括两种:第一种是完成合同以外的零星工作时，按计日工作单价计算。此时提交现场签证费用申请时，应包括下列证明材料:
     (1) 工作名称、内容和数量;
     (2) 投入该工作所有人员的姓名、工种、级别和耗用工时;
     (3) 投入该工作的材料类别和数量;
     (4) 投入该工作的施工设备型号、台数和耗用台时;
     (5) 监理人要求提交的其他资料和凭证。
 
     第二种是完成其他非承包人责任引起的事件，应按合同中的约定计算。
 
 */
#pragma mark *********** 1Z103085 合同价款期中支付

#pragma mark 知识点:工程预付款

/*
 
 1. 工程预付款的支付
 
     工程预付款是发包人为帮助承包人解决施工准备阶段的资金周转问题而提前支付的一笔款项，用于承包人为合同工程施工购置材料、机械设备、修建临时设施以及施工队伍进场等。
 
     工程是否实行预付款，取决于工程性质、承包工程量的大小及发包人在招标文件中的规定。
 
     工程实行预付款的，发包人应按合同约定的时间和比例(或金额) 向承包人支付工程预付款。当合同对工程预付款的支付没有约定时， 按照财政部、建设部印发的《建设工程价款结算暂行办法》(财建 [2004] 369 号)的规定办理:
 
     (1) 工程预付款的额度:包工包料的工程原则上预付比例不低于合同 金额(扣除暂列金额)的 10% ，不高于合同金额(扣除暂列金额)的 30%; 对重大工程项目，按年度工程计划逐年预付。实行工程量清单 计价的工程，实体性消耗和非实体性消耗部分应在合同中分别约定 预付款比例(或金额)。
     (2) 工程预付款的支付时间:在具备施工条件的前提下，发包人应在 双方签订合同后的一个月内或约定的开工日期前的7天内预付工程款。 若发包人未按合同约定预付工程款，承包人应在预付时间到期后 10 天 内向发包人发出要求预付的通知，发包人收到通知后仍不按要求预付， 承包人可在发出通知 14 天后停止施工，发包人应从约定应付之日起 按同期银行贷款利率计算向承包人支付应付预付款的利息，并承担违约 责任。
     (3) 凡是没有签订合同或不具备施工条件的工程，发包人不得预付 工程款，不得以预付款为名转移资金。
 
 2. 工程预付款的抵扣
 
     发包人拨付给承包人的工程预付款属于预支的性质。预付的工程款必须在合同中约定扣回方式，常用的扣回方式有以下几种:
     (1) 在承包人完成金额累计达到合同总价一定比例(双方合同约定) 后，采用等比率或等额扣款的方式分期抵扣。也可针对工程实际情况 具体处理。
     (2) 从未完施工工程尚需的主要材料及构件的价值相当于工程预付款 数额时起扣，从每次中间结算工程价款中，按材料及构件比重抵扣工 程预付款，至竣工之前全部扣清。其基本计算公式如下:
            T=P-M/N
         式中 T—— 起扣点，即工程预付款开始扣回的累计已完工程价值;
             P—— 承包工程合同总额;
             M——工程预付款数额;
             N—— 主要材料及构件所占比重。
 
 */

#pragma mark 知识点:安全文明施工费
/*
 
 鉴于安全文明施工的措施具有前瞻性，必须在施工前予以保证。 因此，发包人应在工程开工后的 28 天内预付不低于当年施工进度 计划的安全文明施工费总额的 60% ，其余部分应按照提前安排的原则 进行分解，并应与进度款同期支付。发包人没有按时支付安全文明 施工费的，承包人可催告发包人支付;发包人在付款期满后的 7 天内 仍未支付的，若发生安全事故，发包人应承担相应责任。
 
 承包人对安全文明施工费应专款专用，在财务账目中单独列项备查，不得挪作他用，否则发包人有权要求其限期改正;逾期未改正的，造成的损失和延误的工期由承包人承担。
 
 
 */

#pragma mark 知识点:进度款
/*
 
 《建设工程工程量清单计价规范)) GB 50500-2013 规定:
 
 已标价工程量清单中的单价项目，承包人应按工程计量确认的工程量与综合单价计算;如综合单价发生调整的，以发承包双方确认调整的综合单价计算进度款。
 
 已标价工程量清单中的总价项目，承包人应按合同中约定的进度款支付分解，分别列入进度款支付申请中的安全文明施工费和本周期应支付的总价项目的金额中。
 
 发包人提供的甲供材料金额，应按照发包人签约提供的单价和数量从进度款支付中扣出，列入本周期应扣减的金额中。
 
 进度款的支付比例按照合同约定，按期中结算价款总额计，不低于 60% ，不高于 90%。
 
 (一)承包人支付申请的内容
 
     承包人应在每个计量周期到期后的 7天内向发包人提交已完工程 进度款支付申请一式四份，详细说明此周期认为有权得到的款额， 包括分包人已完工程的价款。
 
     支付申请应包括下列内容:
     (1) 累计已完成的合同价款
     (2) 累计已实际支付的合同价款
     (3) 本周期合计完成的合同价款
         1) 本周期已完成单价项目的金额
         2) 本周期应支付的总价项目的金额
         3) 本周期已完成的计日工价款
         4) 本周期应支付的安全文明施工费
         5) 本周期应增加的金额
     (4) 本周期合计应扣减的金额
     (5) 本周期实际应支付的合同价款
         1)本周期应扣回的预付款
         2) 本周期应扣减的金额
 
 (二)发包人支付进度款
 
     发包人应在收到承包人进度款支付申请后的 14 天内，根据计量 结果和合同约定对申请内容予以核实，确认后向承包人出具进度款 支付证书。
 
     若发承包双方对有的清单项目的计量结果出现争议，发包人应对无争议部分的工程计量结果向承包人出具进度款支付证书。
 
     发包人应在签发进度款支付证书后的 14 天内，按照支付证书列明 的金额向承包人支付进度款。
 
     若发包人逾期未签发进度款支付证书，则视为承包人提交的进度款支付申请已被发包人认可，承包人可向发包人发出催告付款的通知。
 
     发包人应在收到通知后的 14 天内，按照承包人支付申请的金额 向承包人支付进度款。发包人未按规定支付进度款的，承包人可催告 发包人支付，并有权获得延迟支付的利息;发包人在付款期满后的7 天内仍未支付的，承包人可在付款期满后的第 8 天起暂停施工。 发包人应承担由此增加的 费用和延误的工期，向承包人支付合理 利润，并应承担违约责任。
 
     发现已签发的任何支付证书有错、漏或重复的数额，发包人有权予以修正，承包人也有权提出修正申请。经发承包双方复核同意修正的，应在本次到期的进度款中支付或扣除。
 
 */
#pragma mark *********** 1Z103086 竣工结算与支付
/*
 
 竣工结算是指建设工程项目完工并经验收合格后，对所完成的项目进行的全面工程结算。工程完工后，发承包双方必须在合同约定时间内办理工程竣工结算。
 
 工程竣工结算应由承包人或受其委托具有相应资质的工程造价咨询人编制，并应由发包人或受其委托具有相应资质的工程造价咨询人核对。
 
 */
#pragma mark 知识点:竣工结算的程序
/*
 
 1.承包人递交竣工结算书
 
     承包人应在合同约定时间内编制完成竣工结算书，并在提交竣工验收报告的同时递交给发包人。承包人未在合同约定时间内递交竣工结算书，经发包人催促后仍未提供或没有明确答复的，发包人可以根据已有资料办理结算。
 
 2. 发包人进行结算审核
 
     发包人在收到承包人递交的竣工结算书后，应按合同约定时间核对。
 
     发包人或受其委托的工程造价咨询人收到承包人递交的竣工结算书后，在合同约定时间内，不核对竣工结算或未提出核对意见的，视为承包人递交的竣工结算书已经认可，发包人应向承包人支付工程结算价款。
 
 
     承包人在接到发包人提出的核对意见后，在合同约定时间内，不确认也未提出异议的，视为发包人提出的核对意见已经认可。竣工结算办理完毕，发包人应将竣工结算书报送工程所在地或有该工程管辖权的行业管理部门的工程造价管理机构备案，竣工结算书作为工程竣工验收备案、交付使用的必备文件。
 
     同一工程竣工结算核对完成，发承包双方签字确认后，禁止发包人又要求承包人与另一个或多个工程造价咨询人重复核对竣工结算。
 
 3. 工程竣工结算价款的支付
 
     竣工结算办理完毕，发包人应根据确认的竣工结算书在合同约定时间内向承包人支付工程竣工结算价款。
     发包人未在合同约定时间内向承包人支付工程结算价款的，承包人可催告发包人支付结算价款。如达成延期支付协议的，发包人应按同期银行同类贷款利率支付拖欠工程价款的利息。如未达成延期支付协议，承包人可以与发包人协商将该工程折价，或申请人民法院将该工程依法拍卖，承包人就该工程折价或者拍卖的价款优先受偿。
 
 */
#pragma mark 知识点:竣工结算的依据
/*
 
 (1) 《建设工程工程量清单计价规范》 GB 50500-2013;
 (2) 工程合同;
 (3) 发承包双方实施过程中已确认的工程量及其结算的合同价款;
 (4) 发承包双方实施过程中已确认调整后追加(减)的合同价款;
 (5) 建设工程设计文件及相关资料;
 (6) 投标文件;
 (7) 其他依据。
 
 */
#pragma mark 知识点:竣工结算的编制
/*
 
 1.竣工结算的编制方法
 
     (1) 采用总价合同的，应在合同价基础上对设计变更、工程洽商以及 工程索赔等合同约定可以调整的内容进行调整;
     (2) 采用单价合同的，应计算或核定竣工图或施工图以内的各个分部 分项工程量，依据合同约定的方式确定分部分项工程项目价格，并对 设计变更、工程洽商、施工措施以及工程索赔等内容进行调整;
     (3) 采用成本加酬金合同的，应依据合同约定的方法计算各个分部分项 工程以及设计变更、工程洽商、施工措施等内容的工程成本，并计算 酬金及有关税费。
 
 2. 竣工结算的编制内容 采用工程量清单计价，竣工结算编制的主要内容有:
 
     (1) 工程项目的所有分部分项工程量，以及实施工程项目采用的措施项目工程量;为完成所有工程量并按规定计算的人工费、材料费、设备费、机具费、企业管理费、利润和税金;
     (2) 分部分项工程和措施项目以外的其他项目所需计算的各项费用;
     (3) 工程变更费用、索赔费用、合同约定的其他费用。
 
 3. 竣工结算的计算方法
 
     工程量清单计价法通常采用单价合同的合同计价方式，竣工结算的编制是采取合同价加变更签证的方式进行。
 
     工程项目竣工结算价=Σ单项工程竣工结算价
     单项工程竣工结算价=Σ单位工程竣工结算价
     单位工程竣工结算价 =分部分项工程费+措施费+其他项目费+规费+税金
 
     《建设工程工程量清单计价规范)) GB 50500-2013 中对计价原则有 如下规定:
 
     (1) 分部分项工程和措施项目中的单价项目应依据双方确认的工程量 与已标价工程量清单的综合单价计算;发生调整的，应以发承包双方 确认调整的综合单价计算。
     (2) 措施项目中的总价项目应依据已标价工程量清单的项目和金额 计算;发生调整的，应以发承包双方确认调整的金额计算，其中安全 文明施工费应按国家或省级、行业建设主管部门的规定计算。
     (3) 其他项目应按下列规定计价:
         1) 计日工应按发包人实际签证确认的事项计算;
         2) 暂估价应按计价规范相关规定计算;
         3) 总承包服务费应依据已标价工程量清单的金额计算;发生调整的，应以发承包双方确认调整的金额计算;
         4) 索赔费用应依据发承包双方确认的索赔事项和金额计算;
         5) 现场签证费用应依据发承包双方签证资料确认的金额计算;
         6) 暂列金额应减去合同价款调整(包括索赔、现场签证)金额计算，如有余额归发包人。
 
     (4) 规费和税金按国家或省级、建设主管部门的规定计算。规费中的 工程排污费应按工程所在地环境保护部门规定标准缴纳后按实列入。
     (5) 发承包双方在合同工程实施过程中已经确认的工程计量结果和 合同价款，在竣工结算办理中应直接进入结算。
 
 */
#pragma mark 知识点:竣工结算的审查
/*
 
 1. 竣工结算的审查方法
 
     (1) 采用总价合同的，应在合同价的基础上对设计变更、工程洽商以及工程索赔等合同约定可以调整的内容进行审查;
 
     (2) 采用单价合同的，应审查施工图以内的各个分部分项工程量，依据合同约定的方式审查分部分项工程价格，并对设计变更、工程洽商、工程索赔等调整内容进行审查;
 
     (3) 采用成本加酬金合同的，应依据合同约定的方法审查各个分部 分项工程以及设计变更、工程洽商等内容的工程成本，并审查酬金及 有关税费的取定。
 
         除非已有约定，竣工结算应采用全面审查的方法，严禁采用抽样审查、重点审查、分析对比审查和经验审查的方法，避免审查疏漏现象发生。
 
 2. 竣工结算的审查内容
 
     (1) 审查结算的递交程序和资料的完备性
 
         1) 审查结算资料的递交手续、程序的合法性，以及结算资料具有的法律效力;
         2) 审查结算资料的完整性、真实性和相符性。
 
     (2) 审查与结算有关的各项内容
 
         1) 建设工程发承包合同及其补充合同的合法性和有效性;
         2) 施工发承包合同范围以外调整的工程价款;
         3) 分部分项、措施项目、其他项目工程量及单价;
         4) 发包人单独分包工程项目的界面划分和总包人的配合费用;
         5) 工程变更、索赔、奖励及违约费用;
         6) 规费、税金、政策性调整以及材料差价计算;
         7) 实际施工工期与合同工期发生差异的原因和责任，以及对工程造价的影响程度;
         8) 其他涉及工程造价的内容。
 
 */

#pragma mark 知识点:竣工结算支付
/*
 
 (一)承包人提交竣工结算款支付申请
 
     承包人应根据办理的竣工结算文件向发包人提交竣工结算款支付申请。 申请应包括下列内容:
 
     (1) 竣工结算合同价款总额;
     (2) 累计已实际支付的合同价款;
     (3) 应预留的质量保证金;
     (4) 实际应支付的竣工结算款金额。
 
         (4)=(1)-(3)-(2)
 
 (二)发包人签发竣工结算支付证书与支付结算款
 
     发包人应在收到承包人提交竣工结算款支付申请后 7 天内予以核实， 向承包人签发竣工结算支付证书，并在签发竣工结算支付证书后的 14 天内，按照竣工结算支付证书列明的金额向承包人支付结算款。
 
     发包人在收到承包人提交的竣工结算款支付申请后 7 天内不予核实， 不向承包人签发竣工结算支付证书的，视为承包人的竣工结算款支付 申请已被发包人认可;发包人应在收到承包人提交的竣工结算款支付 申请 7 天后的 14 天内，按照承包人提交的竣工结算款支付申请列明的 金额向承包人支付结算款。
 
     发包人未按照上述规定支付竣工结算款的，承包人可催告发包人支 付，并有权获得延迟支付的利息。发包人在竣工结算支付证书签发后 或者在收到承包人提交的竣工结算款支付申请 7 天后的 56 天内仍未 支付的，除法律另有规定外，承包人可与发包人协商将该工程折价， 也可直接向人民法院申请将该工程依法拍卖。承包人应就该工程折价 或拍卖的价款优先受偿。
 
 */

#pragma mark 知识点:质量保证金
/*
 
 发包人应按照合同约定的质量保证金比例从结算款中预留质量保证金。 承包人未按照合同约定履行属于自身责任的工程缺陷修复义务的，
 
 发包人有权从质量保证金中扣除用于缺陷修复的各项支出。
 
 经查验，工程缺陷属于发包人原因造成的，应由发包人承担查验和缺陷修复的费用。
 
 在合同约定的缺陷责任期终止后，发包人应按照合同中最终结清的相关规定，将剩余的质量保证金返还给承包人。当然，剩余质量保证金的返还，并不能免除承包人按照合同约定应承担的质量保修责任和应履行的质量保修义务。
 */
#pragma mark 知识点:最终结清
/*
 
 缺陷责任期终止后，承包人应按照合同约定向发包人提交最终结清支付申请。
 
 发包人对最终结清支付申请有异议的，有权要求承包人进行修正和提供补充资料。承包人修正后，应再次向发包人提交修正后的最终 结清支付申请。发包人应在收到最终结清支付申请后的 14 天内予以 核实，并应向承包人签发最终结清支付证书。
 
 发包人应在签发最终结清支付证书后的 14 天内，按照最终结清 支付证书列明的金额向承包人支付最终结清款。如果发包人未在约定 的时间内核实，又未提出具体意见的，应视为承包人提交的最终结清 支付申请已被发包人认可。
 
 发包人未按期最终结清支付的，承包人可催告发包人支付，并有权获得延迟支付的利息。
 
 最终结清时，如果承包人被预留的质量保证金不足以抵减发包人工程缺陷修复费用的，承包人应承担不足部分的补偿责任。
 
 承包人对发包人支付的最终结清款有异议的，按照合同约定的争议解决方式处理。
 
 */
#pragma mark *********** 1Z103087 合同解除的价款结算与支付
/*
 
 合同解除是合同非常态的终止，为了限制合同的解除，法律规定了合同解除制度。根据解除权来源划分，可分为协议解除和法定解除。
 
 法律不赋予发承包人享有任意单方解除权，因此，除了协议解除，按照有关规定，施工合同的解除有承包人根本违约的解除和发包人根本违约的解除两种。
 
 发承包双方协商一致解除合同的，应按照达成的协议办理结算和支付合同价款。
 
 */
#pragma mark 知识点:因不可抗力解除合同
/*
 
 由于不可抗力致使合同无法履行解除合同的，发包人应向承包人支付合同解除之日前已完成工程但尚未支付的合同价款。此外，还应支付下列金额:
 
 (1) 《建设工程工程量清单计价规范》) GB 50500-2013 中提前 竣工相关条款中规定的应由发包人承担的费用;
 (2) 已实施或部分实施的措施项目应付价款;
 (3) 承包人为合同工程合理订购且已交付的材料和工程设备货款;
 (4) 承包人撤离现场所需的合理费用，包括员工遣送费和临时工程拆除、施工设备运离现场的费用;
 (5) 承包人为完成合同工程而预期开支的任何合理费用，且该项费用未包括在本款其他各项支付之内。
 
 发承包双方办理结算合同价款时，应扣除合同解除之日前发包人 应向承包人收回的价款。当发包人应扣除的金额超过了应支付的金额， 承包人应在合同解除后的 56 天内将其差额退还给发包人。
 
 
 */

#pragma mark 知识点:因承包人违约解除合同
/*
 
 由于承包人违约解除合同，应依据以下价款结算与支付的原则:
 (1) 发包人应暂停向承包人支付任何价款。
 (2) 发包人应在合同解除后 28 天内核实合同解除时承包人已完成的全部合同价款以及按施工进度计划已运至现场的材料和工程设备货款，按合同约定核算承包人应支付的违约金以及造成损失的索赔金额，并将结果通知承包人。
 (3) 发承包双方应在 28 天内予以确认或提出意见，并办理结算合同 价款。如果发包人应扣除的金额超过了应支付的金额，则承包人应在 合同解除后的 56 天内将其差额退还给发包人。
 (4) 发承包双方不能就解除合同后的结算达成一致的，按照合同约定 的争议解决方式处理。
 
 
 */

#pragma mark 知识点:因发包人违约解除合同
/*
 
 由于发包人违约解除合同，应依据以下价款结算与支付的原则:
 
 (1) 发包人除应按照由于不可抗力解除合同的规定向承包人支付各项 价款外，还应按合同约定核算发包人应支付的违约金以及给承包人 造成损失或损害的索赔金额费用。该笔费用由承包人提出，发包人 核实后与承包人协商确定后的 7 天内向承包人签发支付证书。
 
 (2) 发承包双发协商不能达成一致的，按照合同约定的争议解决方式 处理。
 
 */

#pragma mark  ******************************* 1Z103090 9.国际工程投标报价
#pragma mark *********** 1Z103091 国际工程投标报价的程序

#pragma mark 知识点:国际工程投标报价的程序
/*
 
 */

#pragma mark 知识点:组织投标报价班子
/*
 

 组织一个业务水平高、经验丰富、精力充沛的投标报价班子是投标获得成功的基本保证。
 
 一个好的投标报价班子的成员应由经济管理类人才、专业技术类人才、商务金融类人才、合同管理类人才组成，最好是懂技术、懂经济、懂商务、懂法律和会外语的复合型、外向型、开拓型人才。
 
 投标班子除了应由各专业领域的人才组成，同时还应注意保持班子人员的相对稳定，积累和总结以往经验，不断提高其素质和水平，以形成一个高效率的工作集体，从而提高投标报价的竞争力。
 
 */
#pragma mark 知识点:研究招标文件
/*
 
 (一)关于合同条件方面
 
     1. 要核准下列准确日期:投标截止日期和时间;投标有效期;招标 文件中规定的由合同签订到开工的允许时间;总工期和分阶段 验收的工期;缺陷通知期。
     2. 关于保函与担保的有关规定。
     3. 关于保险的要求。
     4. 关于误期赔偿费的金额和最高限额的规定。
     5. 关于付款条件。
     6. 关于物价调整条款。
     7. 应搞清楚商务条款中有关报价货币和支付货币的规定。
     8. 关于税收。
     9. 关于不可抗力造成损害的补偿办法和规定、中途停工的处理办法和补救措施。
     10. 关于争端解决的有关规定。
     11. 承包商可能获得补偿的权利方面。
 
 (二)关于承包商责任范围和报价要求方面
 
     1.应当注意合同属于单价合同、总价合同还是成本加酬金合同等，对于不同的合同类型，承包商的责任和风险是不一样的，应根据具体情况分别核算报价。
 
     2. 认真落实需要报价的详细范围，不应有任何含糊不清之处。 例如，报价是否包含勘察工作，是否包含施工详图设计，是否包括 进场道路和临时水电设施以及永久设备的供货及其范围等。以保证在 投标报价中不错报、不漏报。
 
 
 (三)技术规范和图纸方面
 
     工程技术规范是按工程类型来描述工程技术和工艺的内容和特点，对设备、材料、施工和安装方法等所规定的技术要求，以及对工程质量进行检验、试验和验收所规定的方法和要求。
 
     研究工程技术规范，特别要注意研究该规范是否参照或采用英国规范、美国规范或是其他国际技术规范，本公司对此技术规范的熟悉程度，有无特殊施工技术要求和有无特殊材料设备技术要求，有关选择代用材料、设备的规定，以便采用相应的定额，计算有特殊要求的项目价格。
 
     图纸分析要注意平、立、剖面图之间尺寸、位置的一致性，结构图与设备安装图之间的一致性，当发现矛盾之处应及时提请招标人澄清并修正。
 
 
 */
#pragma mark 知识点:进行各项调查研究
/*
 
 开展各项调查研究是标价计算之前的一项重要准备工作，是成功投标报价的基础，主要内容包括以下方面。
 
     1. 市场、政治、经济环境调查
     2. 施工现场自然条件调查
     3. 现场施工条件调查
     4. 劳务规定、税费标准和进出口限额调查
     5. 工程项目业主的调查
     6. 竞争对手的调查
 
 */
#pragma mark 知识点:标前会议与现场勘查
/*
 
 (一)标前会议
 
     1.对工程内容范围不清的问题应当提请说明，但不要表示或提出任何修改设计方案的要求。
 
     2. 对招标文件中图纸与技术说明互相矛盾之处，可请求说明应以何者为准，但不要轻易提出修改技术要求。如果自己确实能提出对业主有利的修改方案，可在投标报价时提出，并做出相应的报价供业主选择而不必在会议中提出。
 
     3. 对含糊不清、容易产生歧义理解的合同条件，可以请求给予 澄清、解释，但不要提出任何改变合同条件的要求。
 
     4. 投标人应注意提问的技巧，不要批评或否定业主在招标文件中 的有关规定，提问的问题应是招标文件中比较明显的错误或疏漏， 不要将对己方有利的错误或疏漏提出来，也不要将己方机密的设计 方案或施工方案透露给竞争对手，同时要仔细倾听业主和竞争对手 的谈话，从中探察他们的态度、经验和管理水平。
 
 (二)现场勘查

     现场勘察一般是标前会议的一部分，招标人会组织所有投标人进行现场参观和说明。投标人应准备好现场勘察提纲并积极参加这一活动。事先参加现场勘察的所有人员应认真地研究招标文件中的图纸和技术文件，同时应派有丰富工程施工经验的工程技术人员参加。现场勘察中，除一般性调查外，还应结合工程专业特点有重点地进行勘察。由于能到现场参加勘察的人员毕竟有限，因此可对大型项目进行现场录像，以便回国后给参与投标的全体人员和专家研究。
 
 */
#pragma mark 知识点:工程量复核
/*
 
 工程量复核不仅是为了便于准确计算投标价格，更是今后在实施工程中测量每项工程量的依据，同时也是安排施工进度计划、选定施工方案的重要依据。
 
 当发现遗漏或相差较大时，投标人不能随便改动工程量，仍应按招标文件的要求填报自己的报价，但可另在投标函中适当予以说明。
 
 在核算完全部工程量表中的细目后，投标人可按大项分类汇总工程总量，用以研究采用合适的施工方法和经济适用的施工机械设备。
 
 */
#pragma mark 知识点:生产要素与分包工程询价
/*
 
 (一)生产要素询价
 
     材料价格确定的准确与否直接影响标价中成本的准确性，是影响投标成败的重要因素。生产要素询价主要包括以下四方面。
     1. 主要建筑材料的采购渠道、质量、价格、供应方式。
     2. 施工机械的采购与租赁渠道、型号、性能、价格以及零配件的供应情况。
     3. 当地劳务的技术水平、工作态度与工作效率、雇用价格与手续。
     4. 当地的生活费用指数、食品及生活用品的价格、供应情况。
 
 (二)分包工程询价
 
     分包询价单实际上与工程招标文件基本一致，一般包括以下内容:
     1. 分包工程施工图及技术说明;
     2. 详细说明分包工程在总包工程中的进度安排;
     3. 提出需要分包商提供服务的时间，以及分包商允诺的这段时间的变化范围，以便日后总包进度计划不可避免发生变动时，可使这种变动的影响尽可能地减小;
     4. 说明分包商对分包工程顺利进行应负的责任和应提供的技术措施;
     5. 总包商提供的服务设施及分包商到总包现场认可的日期;
     6. 分包商应提供的材料合格证明、施工方法及验收标准、验收方式;
     7. 分包商必须遵守的现场安全和劳资关系条例;
     8. 工程报价及报价日期、报价货币。
 
     上述资料主要来源于招标文件和承包商的施工计划。当收到分包商的报价后，承包商应从分包保函是否完整、核实分项工程的单价、保证措施是否有力、确认工程质量及信誉、分包报价的合理性等方面进行分析。
 
 */
#pragma mark *********** 1Z103092 国际工程投标报价的组成
/*
 国际工程投标总报价组成：
 
     人工费
     材料费
     施工机具使用费
 
     待摊费用
 
         现场管理费
 
             工作人员费
             办公费
             差旅交通费
             文体宣教费
             固定资产使用费
             生活设施使用费
             工具用具使用费
             劳动保护费
             检验试验费
             其他费用

         其他待摊费
 
             临时设施工程费
             保险费
             税金
             保函手续费
             经营业务费
             工程辅助费
             贷款利息
             总部管理费
             利润
             风险费

     开办费
 
     分包工程费
 
         分包报价
         总包管理费和利润
 
     暂定金额(招标人备用金)
 
 */
#pragma mark 知识点:国际工程投标报价的组成
/*
 

 国际工程投标报价要准确划分报价项目和待摊费用项目。报价项目就是工程量清单上所列的项目，例如平整场地、土方工程、混凝土工程、钢筋工程等等，其具体项目随招标工程内容及招标文件规定的计算方法而异。待摊费用项目不在工程量清单上出现，而是作为报价项目的价格组成因素隐含在每项综合单价之内。

 现场管理费、临时工程设施费、保险费、税金等是在工程量清单中没有单独列项的费用项目，需将其作为待摊费用分摊到工程量清单的各个报价分项中去。
 
 */
#pragma mark 知识点:人工、材料和施工机械基础单价计算
/*
 
 (一)工日基价的计算

     工日基价是指国内派出的工人和在工程所在国招募的工人，每个工作日的平均工资。一般来说，在分别计算这两类工人的工资单价后，再考虑功效和其他一些有关因素以及人数，加权平均即可算出工日工资基价。
 
 (二)材料、半成品和设备预算价格的计算
 
     应按当地采购、国内供应和从第三国采购分别确定。
 
     1. 当地采购
 
         在工程所在国当地采购的材料设备，其预算价格应为施工现场交货价格。通常按下式计算:
 
             预算价格=市场价+运输费+采购保管损耗
 
     2. 国内供应
 
         通常按下式计算:
 
             材料、设备价格=到岸价+海关税+港口费+运杂费+保管费+运输保管损耗+其他费用
 
     3. 从第三国采购
 
         从第三国采购的材料、设备价格，其预算价格的计算方法类似于国内供应材料、设备价格的计算。
 
         如果同一种材料、设备来自不同的供应来源，则应按各自所占比重计算加权平均价格，作为预算价格。
 
 (三)施工机具使用费的计算
 
     1. 施工机械使用费
 
         施工机械使用费由基本折旧费、场外运输费、安装拆卸费、燃料动力费、机上人工费、维修保养费以及保险费等组成。
 
         其中，基本折旧费，如果是新购设备，应考虑拟在本工程中摊销的折旧比率，一般折旧年限按不超过五年计算。
 
             基本折旧费=(机械预算价格 - 残值) × 折旧比率
 
         机械预算价格可根据施工方案提出的施工机械设备清单及其来源确定。
 
         残值是工程结束时施工机械设备的残余价值，应按其可用程度和可能的去向考虑确定。除可转移到其他工程上继续使用或运回国内的贵重机械设备外，一般可不计残值。
 
     2. 仪器仪表使用费
 
         仪器仪表使用费是指工程施工所需使用的仪器仪表的摊销及维修费用。
 
             仪器仪表使用费=工程使用的仪器仪表摊销费+维修费
 */
#pragma mark 知识点:待摊费
/*
 
 (一)现场管理费
 
     现场管理费是指由于组织施工与管理工作而发生的各种费用，涵盖费用项目较多，主要包括下列几方面。
 
         1. 工作人员费
         2. 办公费
         3. 差旅交通费
         4. 文体宣教费
         5. 固定资产使用费
         6. 国外生活设施使用费
         7. 工具用具使用费
         8. 劳动保护费
         9. 检验试验费
         10. 其他费用
 
 (二)其他待摊费用
 
     其他待摊费用包括以下几方面。
 
     1. 临时设施工程费
     2. 保险费
     3. 税金
     4. 保函手续费
     5. 经营业务费
     6. 工程辅助费
     7. 贷款利息
     8. 总部管理费
     9. 利润
     10. 风险费
 
 */
#pragma mark 知识点:开办费
/*
 
 有些招标项目的报价单中单列有开办费(或称初期费用)一项，指正式工程开始之前的各项现场准备工作所需的费用。如果招标文件没有规定单列，则所有开办费都应与其他待摊费用一起摊入到工程量表的各计价分项价格中。它们究竟是单列还是摊入工程量其他分项价格中，应根据招标文件的规定计算。开办费在不同的招标项目中包括的内容可能不相同，一般可能包括以下内容。
 1. 现场勘察费 2. 现场清理费 3. 进场临时道路费
 4. 业主代表和现场工程师设施费 5. 现场试验设施费
 6. 施工用水电费 7. 脚手架及小型工具费 8. 承包商临时设施费 9. 现场保卫设施和安装费用 10. 职工交通费 11. 其他杂项
 
 */
#pragma mark 知识点:暂定金额
/*
 
 暂定金额是业主在招标文件中明确规定了数额的一笔资金，标明用于工程施工，或供应货物与材料，或提供服务，或以应付意外情况，亦称待定金额或备用金。每个承包商在投标报价时均应将此暂定金额数计入工程总报价，但承包商无权做主使用此金额，这些项目的费用将按照业主工程师的指示与决定，全部或部分使用。
 
 */

#pragma mark *********** 1Z103093 单价分析和标价汇总的方法
#pragma mark 知识点:分项工程的单价分析
/*
 

 分项工程单价也叫工程量单价，是指工程量清单上所列项目的单价，例如基槽开挖、钢筋混凝土梁、柱等。分项工程单价的计算是工程估价中最重要的基础工作。分项工程单价通常为综合单价，包括直接费、间接费和利润等。

 单价分析就是对工程量清单中所列分项单价进行分析和计算，确定出每一分项的单价和合价。单价分析之前，应首先计算出工程中拟使用的人工、材料、施工机具使用费的基础单价，还要选择好适用的工程定额，然后对工程量清单中每一个分项进行分析与计算。
 
 单价分析的方法与步骤如下。
 
 1. 计算分项工程的单位工程量人、料、机费用
 
         单位工程量人、料、机费用 a=单位工程量人工费+单位工程量的材料费+单位工程量施工机具使用费
 
         本分项工程人、料、机费用 A =本分项工程的单位工程量人、料、机费用 a ×本分项工程量
 
     分项工程人、料、机费用常用的估价方法有定额估价法、作业估价法和匡算估价法等。
 

     使用定额估价法时，应具备较准确的人工、材料、机械台班的消耗定额以及人工、材料和机械台班的使用单价。一般拥有较可靠定额标准的企业，定额估价法应用较为广泛。

     应用定额估价法是以定额消耗标准为依据，并不考虑作业的持续时间，因此当机械设备所占比重较大，适用均衡性较差，机械设备搁置时间过长而使其费用增大，这种机械搁置而又无法在定额估价中给予恰当的考虑时，这时就应采用作业估价法进行计算更为合适。
 

     作业估价法是先估算出总工作量、分项工程的作业时间和正常条件下劳动人员、施工机械的配备，然后计算出各项作业持续时间内的人工和机械费用。为保证估价的正确和合理性，作业估价法应包括:制定施工计划，计算各项作业的资源费用等。

     匡算估价法是指估价师根据以往的实际经验或有关资料，直接估算出分项工程中人工、材料、机具的消耗量，从而估算出分项工程的人、料、机单价。采用这种方法，估价师的实际经验直接决定了估价的准确程度。因此，往往适用于工程量不大，所占费用比例较小的那部分分项工程。
 
 2. 求整个工程项目的人、料、机费用
 
     整个工程项目的人、料、机费用等于所有分项工程人、料、机费用之和，以 ΣA 表示。
 
 3. 求整个工程项目的待摊费用 ΣB
 4. 计算分摊系数 β 和本分项工程分摊费 B
 
     分摊系数等于整个工程项目的待摊费用之和除以所有分项的人、料、机费用之和。
 
         β= (ΣB/ΣA) ×100%
 
     式中，本分项工程分摊费 B= 本分项工程人、料、机费用 A × 分摊系数 β 本分项工程的单位工程量分摊费
 
         b= 本分项工程的单位工程量人、料、机费用 a ×分摊系数 β
 
 5. 计算本分项工程的单价 U 和合价 S
 
     本分项工程单价 U=本分项工程的单位工程量人、料、机费用 a +本分项工程的单位工程量分摊费 b
                  =本分项工程的单位工程量人、料、机费用 a×(1+分摊系数 β )
     本分项工程合价 S= 本分项工程单价 U × 本分项工程量 Q
 
 */
#pragma mark 知识点:标价汇总
/*
 
 将工程量清单中所有分项工程的合价汇总，即可算出工程的总标价。
 
     总标价=分项工程合价+分包工程总价+暂定金额
 
 */

#pragma mark *********** 1Z103094 国际工程投标报价的分析方法
#pragma mark 知识点:国际工程投标报价的对比分析
/*
 
 标价的对比分析是依据在长期的工程实践中积累的大量的经验数据，用类比的方法，从宏观上判断计算标价的合理性，可采用下列宏观指标和评审方法。
 
 1. 分项统计计算书中的汇总数据，并计算其占标价的比例指标。
 2. 通过分析人、料、机总费用和总的管理费的比例关系，劳务费和 材料费的比例关系，临时设施和机具设备费与人、料、机总费用的比例 关系，利润、流动资金及其利息与总标价的比例关系等，从宏观上分析 标价结构的合理性。
 3. 探讨上述平均人月产值和人年产值的合理性和实现的可能性。 如果从本公司的实践经验角度判断这些指标过高或过低，就应当考虑 所采用定额的合理性。
 4. 参照同类工程的经验，扣除不可比因素后，分析单位工程价格 及用工、用料量的合理性。
 5. 从上述宏观分析得出初步印象后，对明显不合理的标价构成部 分进行微观方面的分析检查。重点是在提高工效、改变施工方案、 降低材料设备价格和节约管理费用等方面提出可行措施，并修正初步 计算标价。
 
 */
#pragma mark 知识点:国际工程投标报价的动态分析
/*
 

 标价的动态分析是假定某些因素发生变化，测算标价的变化幅度，特别是这些变化对目标利润的影响。该项分析类似于项目投资的敏感性分析，主要考虑工期延误、物价和工资上涨以及其他可变因素的影响，通过对于各项价格构成因素的浮动幅度进行综合分析，从而为选定投标报价的浮动方向和浮动幅度提供一个科学的、符合客观实际的范围，并为盈亏分析提供量化依据，明确投标项目预期利润的受影响水平。
 
 */
#pragma mark ***********  1Z103095 国际工程投标报价技巧
#pragma mark 知识点:根据招标项目的不同特点采用不同报价
/*
 
 1. 报价可高一些的工程
 
     (1) 施工条件差的工程;
     (2) 专业要求高的技术密集型工程，而本公司在这方面有专长，声望也较高;
     (3) 总价低的小型工程以及自己不愿做、又不方便不投标的工程;
     (4) 特殊的工程，如港口码头、地下开挖工程等;
     (5) 工期要求急的工程;
     (6) 竞争对手少的工程;
     (7) 支付条件不理想的工程。
 
 2. 报价可低一些的工程
 
     (1) 施工条件好的工程;
     (2) 工作简单、工程量大而一般公司都可以做的工程;
     (3) 本公司目前急于打入某一市场、某一地区，或在该地区面临工程结束，机械设备等无工地转移时;
     (4) 本公司在附近有工程，而本项目又可利用该工地的设备、劳务，或有条件短期内突击完成的工程;
     (5) 竞争对手多，竞争激烈的工程;
     (6) 非急需工程;
     (7) 支付条件好的工程。
 
 
 */

#pragma mark 知识点:适当运用不平衡报价法

/*
 
 不平衡报价法也叫前重后轻法。不平衡报价是指一个工程项目的投标报价，在总价基本确定后，调整内部各个项目的报价，以期既不提高总价从而影响中标，又能在结算时得到更理想的经济效益。一般可以在以下几个方面考虑采用不平衡报价法。
 
 1. 能够早日结账收款的项目(如开办费、土石方工程、基础工程等) 可以报得高一些，以利资金周转，后期工程项目(如机电设备、安装 工程、装饰工程等)可适当降低。
 2. 经过工程量核算，预计今后工程量会增加的项目，单价适当提高， 这样在最终结算时可获得超额利润，而将工程量可能减少的项目单价 降低，工程结算时损失不大。
 3. 设计图纸不明确，估计修改后工程量要增加的，可以提高单价， 而工程内容说明不清的，则可降低一些单价。
 
 但是不平衡报价一定要建立在对工程量表中工程量仔细核对分析的基础上，特别是对报低单价的项目，如工程量执行时增多将造成承包商的重大损失。另外，一定要控制在合理幅度内，以免引起业主反对，甚至导致废标。如果不注意这一点，有时业主会挑选出报价过高的项目，要求投标者进行单价分析，对单价分析中过高的内容进行压价，以致承包商得不偿失。
 
 */

#pragma mark 知识点:注意计日工的报价
/*
 
 如果是单纯对计日工报价，可以报高一些，以便在日后业主用工或 使用机械时可以多盈利。但如果招标文件中有一个假定的"名义工程量" 时，则需要具体分析是否报高价，以免提高总报价。总之，要分析 业主在开工后可能使用的计日工数量确定报价方针。
 
 */
#pragma mark 知识点:适当运用多方案报价法
/*
 
 对一些招标文件，如果发现工程范围不很明确，条款不清楚或很不 公正，或技术规范要求过于苛刻时，可在充分估计投标风险的基础上， 按多方案报价法处理。即先按原招标文件报一个价，然后再提出"如 某条款作某些变动，报价可降低多少......"，报一个较低的价。这样 可以降低总价，吸引业主。或是对某些部分工程提出按"成本补偿合同" 方式处理，其余部分报一个总价。
 */
#pragma mark 知识点:适当运用“建议方案”报价
/*
 
 有时，招标文件中规定可以提出建议方案，即可以修改原设计方案，提出投标者的方案。投标者这时应组织一批有经验的设计和施工工程师，对原招标文件的设计方案仔细研究，提出更合理的方案以吸引业主，促成自己方案中标。
 
 这种新的建议方案一般要求能够降低总造价或提前竣工或使工程运用 更合理。但要注意的是对原招标方案一定要标价，以供业主 比较。增加 建议方案时，不要将方案写得太具体，保留方案的技术关键，防止业主 将此方案交给其他承包商。同时，要强调的是建议方案一定要比较成熟， 或过去有这方面的实践经验。因为投标时间不长，如果仅为中标而匆忙 提出一些没有把握的建议方案，可能引起很多后患。
 */
#pragma mark 知识点:适当运用突然降价法
/*
 
 报价是一件保密性很强的工作，但是对手往往通过各种渠道、手段来刺探情况，因此在报价时可以采取迷惑对方的方法。即先按一般情况报价或表现出自己对该工程兴趣不大，而到快投标截止时，再突然降价。采用这种方法时，一定要在准备投标报价的过程中考虑好降价的幅度，在临近投标截止日期前，根据情报信息与分析判断，再作最后决策。
 
 另外如果由于采用突然降价法而中标，因为开标只降总价，那么就可以在签订合同后再采用不平衡报价方法调整工程量表内的各项单价或价格，以期取得更好的效益。
 
 */
#pragma mark 知识点:适当运用先亏后盈法
/*
 
 有的承包商，为了打进某一地区市场，依靠国家、财团和自身的雄厚资本实力，而采取一种不惜代价，只求中标的低价报价方案。应用这种方法的承包商必须有较好的资信条件，并且提出的施工方案也先进可行，同时要加强对公司情况的宣传，否则即使标价低，业主也不一定选中。
 
 */
#pragma mark 知识点:注意暂定工程量的报价

/*
 
 暂定工程量有三种:
 
 一种是业主规定了暂定工程量的分项内容和暂定总价款，并规定所有投标人都必须在总报价中加入这笔固定金额，但由于分项工程量不很准确，允许将来按投标人所报单价和实际完成的工程量付款。
 
 对于这第一种情况，由于暂定总价款是固定的，对各投标人的总报价水平竞争力没有任何影响，因此，投标时应当对暂定工程量的单价适当提高。这样做，既不会因今后工程量变更而吃亏，也不会削弱投标报价的竞争力。
 

 另一种是业主列出了暂定工程量的项目和数量，但并没有限制这些工程量的估价总价款，要求投标人既列出单价，也应按暂定项目的数量计算总价，当将来结算付款时可按实际完成的工程量和所报单价支付。

 对于这第二种情况，投标人必须慎重考虑。如果单价定高了，同其他工程量计价一样，将会增大总报价，影响投标报价的竞争力;如果单价定低了，将来这类工程量增大，将会影响收益。一般来说，这类工程量可以采用正常价格。如果承包商估计今后实际工程量肯定会增大，则可适当提高单价，使将来可增加额外收益。
 
 第三种是只有暂定工程的一笔固定总金额，将来这笔金额做什么用，由业主确定。
 
 对于这第三种情况对投标竞争没有实际意义，按招标文件要求将规定的暂定款列入总报价即可。
 
 
 */


#pragma mark 知识点:合理运用无利润算标法

/*
 
 缺乏竞争优势的承包商，在迫不得已的情况下，只好在投标中根本不考虑利润去夺标。这种办法一般是处于以下条件时采用:
 
 1. 有可能在得标后，将大部分工程分包给索价较低的一些分包商;
 2. 对于分期建设的项目，先以低价获得首期工程，尔后赢得机会 创造第二期工程中的竞争优势，并在以后的实施中赚得利润;
 3. 较长时期内，承包商没有在建的工程项目，如果再不得标，就 难以维持生存。因此，虽然本工程无利可图，只要能有一定的管理费 维持公司的日常运转，就可设法度过暂时的困难，以图将来东山再起。
 
 */
#pragma mark *********** 1Z103096 国际工程投标报价决策的影响因素
#pragma mark 知识点:国际工程投标报价决策的影响因素
/*
 
 影响国际工程投标报价决策的因素主要有成本估算的准确性、期望利润、市场条件、竞争程度、公司的实力与规模。此外，在投标报价决策时，还应考虑风险偏好的影响。
 
 成本估算的准确度如何，直接影响到公司领导层的决策。
 
 竞争程度作为决定性的因素，对一个承包商的投标能否成功与否显然是一个极为关键的因素。
 
 */

#pragma mark 知识点:国际工程投标报价的策略
/*
 
 投标报价策略是指投标人在投标过程中从企业整体和长远利益出发，结合企业经营目标，并根据企业内部的各种资源和外部环境而进行的一系列谋划和策略。即它是投标人研究如何以最小的代价取得最大的经济效益。投标人在激烈的投标过程中，如何制定适当的投标报价策略是决定其投标能否成功的关键。
 
 由于投标人的经营能力和经营环境的不同，出于不同目的需要，对同一招标项目，可以有不同投标报价目标的选择。
 
 1. 生存策略
 
     投标报价是以克服企业生存危机为目标，争取中标可以不考虑种种利益原则。
 
 2. 补偿策略
 
     投标报价是以补偿企业任务不足，以追求边际效益为目标。以亏损为代价的低报价，具有很强的竞争力。
 
 3. 开发策略
 
     投标报价是以开拓市场，积累经验，向后续投标项目发展为目标。投标带有开发性，以资金、技术投入手段，进行技术经验储备，树立新的市场形象，以便争得后续投标的效益。其特点是不着眼一次投标效益，用低报价吸引投标人。
 
 4. 竞争策略
 
     投标报价是以竞争为手段，以低盈利为目标，报价是在精确计算报价成本基础上，充分估计各个竞争对手的报价目标，以有竞争力的报价达到中标的目的。
 
 5. 盈利策略
 
     投标报价充分发挥自身优势，以实现最佳盈利为目标，投标人对效益无吸引力的项目热情不高，对盈利大的项目充满自信，也不太注重对竞争对手的动机分析和对策研究。
 
     不同投标报价目标的选择是依据一定的条件进行分析后决定的。竞争性投标报价目标是投标人追求的普遍形式。
 
 */




