#pragma mark - ****************************************************************** 1Z101000 工程经济 (26个考点) 【 84页，22~24分】
#pragma mark  ******************************* 1.设备更新分析
#pragma mark  ******************************* 2.设备租赁与购买方案的比选分析
#pragma mark  ******************************* 3.价值工程在工程建设中的应用
#pragma mark  ******************************* 4.新技术、新工艺和新材料应用方案的技术经济分析方法
#pragma mark  ******************************* 5.技术方案现金流量表的编制
#pragma mark  ******************************* 6.技术方案不确定性分析
#pragma mark  ******************************* 7.技术方案经济效果评价
#pragma mark  ******************************* 8.资金时间价值的计算及应用
#pragma mark - ****************************************************************** 1Z102000 工程财务(25个考点) 【 70页，22~25分】
#pragma mark  ******************************* 1.财务会计基础
#pragma mark  ******************************* 2.成本与费用
#pragma mark  ******************************* 3.收入
#pragma mark  ******************************* 4.利润和所得税费用
#pragma mark  ******************************* 5.企业财务报表
#pragma mark  ******************************* 6.财务分析
#pragma mark  ******************************* 7.筹资管理
#pragma mark  ******************************* 8.流动资产财务管理
#pragma mark - ****************************************************************** 1Z103000 建设工程估价(44个考点)【158页，52~55分】
#pragma mark  ******************************* 1.建设工程项目总投资
#pragma mark  ******************************* 2.建设工程项目设计概算
#pragma mark  ******************************* 3.建筑安装工程费用项目的组成与计算
#pragma mark  ******************************* 4.建设工程定额
#pragma mark  ******************************* 5.建设工程项目施工图预算
#pragma mark  ******************************* 6.工程量清单编制
#pragma mark  ******************************* 7.工程量清单计价
#pragma mark  ******************************* 8.计量与支付
#pragma mark  ******************************* 9.国际工程投标报价
