

/*
        目  录
1Z301000 建设工程基本法律知识
        1Z301010 建设工程法律体系
        1Z301020 建设工程法人制度
        1Z301040 建设工程物权制度
        1Z301050 建设工程债权制度
        1Z301060 建设工程知识产权制度
        1Z301070 建设工程担保制度
        1Z301080 建设工程保险制度
        1Z301090 建设工程法律责任制度
1Z302000 施工许可法律制度
        1Z302010 建设工程施工许可制度
        1Z302020 施工企业从业资格制度
        1Z302030 建造师注册执业制度
1Z303000 建设工程发承包法律制度
        1Z303010 建设工程招标投标制度
        1Z303020 建设工程承包制度
        1Z303030 建筑市场信用体系建
1Z304000 建设工程合同和劳动合同法律制度
        1Z304010 建设工程合同制度
        1Z304030 相关合同制戌
1Z305000 施工环保、节能和文物保护法律制度
        1Z3050 10 施工现场 环境保 护制
        1Z305020 施工节约能源制度
        1Z305030 施工文物保护制度
1Z306000 建设工程安全生产法律制度
        1Z306010 施工安全生产许可证制度
        1Z306020 施工安全生产责任和安全生产教育培训制度
        1Z306030 施工现场安全防护制度
        1Z306040 施工安全事故的应急救援与调查处
        1Z306050 建设单位和相关单位的建设工程安全责任制度
1Z307000 建设工程质量法律制度
        1Z307010 工程建设标兆
        1Z307020 施工单位的质量责任和义
        1Z307030 建设单位及相关单位的质量责任和义务
        1Z307040 建设工程竣工验收制度
        1Z307050 建设工程质量保修制度
1Z308000 解决建设工程纠纷法律制度
        1Z3080 10 建 设工程 纠 纷主 要 种类 和 法 律解 决 途
        1Z308020 民事诉讼制度
        1Z308030 仲裁制度
        1Z308040调解与和解制度与争议评审
        1Z308050 行政强制、行政复议和行政诉讼制度

*/
#pragma mark - ************** 理论
#pragma mark 主体  法人
#pragma mark 客体  物权
#pragma mark 行为  代理
#pragma mark 责任


#pragma mark - ************** 1Z301010 建设工程法律体系

#pragma mark 法律体系框架 （建筑法属于行政法）
/*
 【重点】
 某法律部门包括哪些法律
 某部法律属于哪个法律部门

 
 部门法 根据一定标准、原则所制定的同类法律规范的总称
 
 一、宪法及宪法相关法
     宪法相关法
         是指《中国人民代表大会组织法》、《地方各级人民代表大会和地方各级人民政府组织法》、《中华人民共和国国籍法》、《中华人民共和国国务院组织法》、《中华人民共和国民族区域自治法》等法律
 
 二、民法商法
     民法是规定并调整平等主体的公民间、法人间及公民与法人间的财产关系和人身关系的法律规范的总称。
     商法是调整市场经济关系中商人及其商事活动的法律规范的总称。
     我国采用的是民商合一的立法模式。商法被认为是民法的特别法和组成部分。
     《民法通则》、《合同法》、《物权法》、《侵权责任法》、《公司法》、《招标投标法》等属于民法商法
 
 三、行政法
     作为行政法调整对象的行政关系，主要包括行政管理关系、行政法制监督关系、行政救济关系、内部行政关系 。
     《行政处罚法》、《行政复议法》、《行政许可法》、《环境影响评价法》、《城市房地产管理法》、《城乡规划》、《建筑法》等属于行政法。
 
 四、经济法
     经济法是调整在国家协调、干预经济运行的过程中发生的经济关系的法律规范的总称。
     《统计法》、《土地管理法》、《标准化法》、《税收征收管理法》、《预算法》、《审计法》、【《节约能源法》】、《政府采购法》、《反垄断法》等属于经济法。
 五、社会法
     社会法是调整劳动关系、社会保障和社会福利关系的法律规范的总称。
     《残疾人保障法》、《矿山安全法》、《劳动法》、《职业病防治法》、《安全生产法》、《劳动合同法》等属于社会法。
     《劳动合同法》≠《合同法》 ；《合同法》属于民法商法
 
 六、刑法
     《刑法》是这一法律部门的主要内容。
 
 七、诉讼与非诉讼程序法
 
 我国三大诉讼法 《民事诉讼法》、《行政诉讼法》、《刑事诉讼法》
 非诉讼程序法主要是《仲裁法》
 
 
 【经济法和民商法是同一等级】
 宪法及相关法             宪法、组织法、选举法、民族区域自治法、国籍法
 民商法 (【平等】)           民法通则、物权法、合同法、侵权责任法、公司法、招投标法
 行政法 (【政府】)           行政处罚法、行政复议法、行政许可法、环境影响评价法、城市房地产管理法、城乡规划法、建筑法
 经济法 (【调控】)           统计法、土地管理法、标准化法、税收征收法、预算法、审计法、节约能源法、政府采购法、反垄断法
 社会法 (【弱者】)           残疾人保障法、矿山安全法、劳动法、职业病防治法、安全生产法、劳动合同法
 刑法                   刑法(犯罪、刑罚)
 诉讼与非诉讼程序法       民事诉讼法、行政诉讼法、刑事诉讼法、仲裁法
 */

#pragma mark 法的形式 (制定部门、具体的文件  只能由法律规定的事项  地方立法权扩容)
/*
 【重点】
     掌握 1谁制定 2谁公布 3特征 4效力 5规定事项
 
 我国法的形式是制定法形式
     法律是由国家主席签署主席令予以公布
     行政法规由总理签署国务院令予以公布
     地方性法规、自治条例和单行条例
             1.省、自治区、直辖市的人大及其常委会，可以制定地方性法规
             2.设区的市的人大及其常委会，可以对【城乡建设与管理、环境保护、历史文化保护】等方面的事项制定地方性法规
                 设区的市的地方性法规须报省、自治区的人大及其常委会批准后实施
     部门规章是由部门首长签署命令后予以公布
         没有法律或者国务院的行政法规、决定、命令的依据，部门规章不得设定减损公民、法人和其他组织权利或者增加其义务的规范，不得增加本部门的权力或者减少本部门的法定职责。
     地方政府规章由省长或市长签署命令后予以公布
             设区的市的人民政府制定地方政府规章，限于【城乡建设与管理、环境保护、历史文化保护】等方面的事项
 
 宪法                                  全国人大                               《宪法》及宪法相关法等
 法律(法)                               全国人大及常委会                        《建筑法》、《城乡规划法》
 行政法规(条例)                           国务院                               《建设工程质量管理条例》
 地方性法规、自治条例和单行条例(条例)        省、【设区市】人大及常委会 民族自治地方人大      《北京市建筑市场管理条例》《****自治州建筑条例》
 部门规章(规定、办法、细则)                国务院各部、委                           《招投标公告发布暂行办法》
 地方政府规章(规定、办法)                  省、【设区市政府 】                           《安徽省建设工程造价管理办法》


 注意:
 关于法的形式:习惯法、宗教法、判例 是法的形式 但不是我国法的形式，国际法是我国法的形式。
 宪法地位和效力 最高效力的根本大法。
 下列事项只能制定法律:（只能由法律规定）
     1.国家主权的事项;
     2.各级人民代表大会、人民政府、 人民法院和人民检察院的产生、组织和职权;
     3.民族区域自治制度、特别行政区 制度、基层群众自治制度;
     4.犯罪和刑罚;
     5.对公民政治权利的剥夺、限制人身 自由的强制措施和处罚;
     6.税种的设立、税率的确定和税收征收管理等税收基本 制度;
     7.对非国有财产的征收、征用;
     8.民事基本制度;
     9.基本经济制度以及 财政、海关、金融和外贸的基本制度;
     10.诉讼和仲裁制度。
 地方立法权扩容:设区市(城乡建设与管理、环境保护、历史文化保护)
 
 */


 #pragma mark 法的效力等级（需要裁决的特殊情况）

/*
 宪法至上
 
 上位法优于下位法
         (同一级别的人大大于政府、上级高于下级)
 特别法优于一般法
 新法优于旧法
 
 需要裁定的特殊情况
     同一机关制订的规定之间的冲突解决（谁制定谁裁决）:
             法律之间不一致，由全国人大常委会裁决
             行政法规之间不一致，由国务院裁决
     地方法规与部门规章之间的冲突解决 （两家不偏袒）
            由国务院提出意见，国务院以为：
                适用地方法规，国务院决定直接适用
                适用部门规章，国务院提请全国人大常委会裁定
     部门规章之间、部门规章与地方政府规章之间的冲突解决 由国务院决定（由家长裁定）
     根据授权制定的法规与法律规定不一致，不能确定如何适用时，由全国人大常委会裁决
 */


#pragma mark 备案和审查

/*
 
 行政法规、地方性法规、自治条例和单行条例、规章（不包括宪法、法律）应当在公布后的30日内依照下列规定报有关机关备案
 
    法规、规章                                                   备案机关（公布30日内）
 行政法规                                                   全国人大常委会
 地方性法规、自治条例和单行条例                                国务院+全国人大常委会
 部门规章                                                       国务院
 省级规章(省、自治区、直辖市政府制定)                            国务院+省级人大常委会
 市级规章(设区的市、自治州政府制定)                  国务院+省级人大常委会+省级人民  、政府+市级人大常委会
 授权制定的法规                                                授权决定规定的机关
 
 报备不能越级，如设区的市人大制定的地方性法规，由省人大常委会报全国人大常委会和国务院备案。
 
 
 
 
 
 
 
 */
#pragma mark - ************** 建设工程法人制度

#pragma mark 法人成立的条件

/*
 
 组织不一定是法人
 
1依法成立;
         设立法人必须经过政府主管机关的批准或者核准登记
2有必要的财产或者经费;
         法人的财产或者经费必须与法人的经营范围或者设立目的相适应
3有自己的名称、组织机构和场所;
         法人的场所是确定法律管辖的依据
4能独立承担民事责任。
         法人必须能够以自己的财产或者经费承担在民事活动中的债务

 法人住所/法定代表人
注意:
     法人的法定代表人是自然人（不是法人），法人以它的主要办事机构所在地为住所
     企业的法定代表人是自然人
 
思考:联合体可以投标，是不是法人? 项目经理部/财务部/法务部? 子公司和分公司?
 
 */
#pragma mark 法人分类

/*
 
    分为企业法人和非企业法人(包括行政法人、事业法人、 社团法人)
 
法人资格：
    企业法人依法经工商行政管理机关核准 登记后取得法人资格
    机关和事业单位法人成立之日具有资格，部分事业单位需要登记
 
    企业法人分立、合并，其权利和义务由变更后的法人享有和承担。
 
    有独立经费的机关（行政法人）从成立之日起，具有法人资格
    具有法人条件的事业单位、社会团体（事业法人、社团法人）依法不需要办理法人登记的，从成立之日起，具有法人资格
         依法需要办理法人登记的，经核准登记，取得法人资格
 */

#pragma mark 法人在建设工程中的地位
/*
 法人是建设工程中的基本主体（即最主要的主体，但不是唯一主体）
 
 法人确立了建设领域国有企业的所有权和经营权的分离
 
 施工单位、勘察设计单位、监理单位通常是具有法人资格的组织。
 但有时候，建设单位也可能是没有法人资格的其他组织。
 */
#pragma mark 企业法人与项目经理部的法律关系
/*
 项目经理部：
         对于大中型施工项目，施工企业应当在施工现场设立项目经理部；
         小型施工项目，可以由施工企业根据实际情况选择适当的管理方式
 
        项目经理部不具有法人资格，无法独立承担民事责任，
             属于施工企业非常设性下属机构，不是施工企业内部常设机构，为完成某项任务而设。
        项目经理部行为的法律后果由企业法人承担。
 问题：
 一个施工项目是否必须设立项目经理部

项目经理：
         项目经理是企业法人授权在建设项目上的管理者。
         在每个施工项目上必须有一个经企业法人授权的项目经理
 
 问题:
         项目经理签字的材料款，如果不按时支付?
         一个施工项目是否必须有项目经理
 
 
 分公司、项目经理、项目经理部、法定代表人均不具有独立法人资格，
 但子公司具有法人资格
 分公司【使用】总公司的营业执照及资质证书承揽工程       分公司==未成年子女
 子公司【不得】使用母公司的营业执照及资质证书承揽工程     子公司==成年子女
*/
#pragma mark - ************** 建设工程代理制度

#pragma mark 三方当事人，两个法律关系
/*
    建设工程代理制度
 (三方当事人，两个法律关系)
 被代理人委托代理人在代理权限内，以被代理人的名义与第三人实施具有法律意义的行为，被代理人对代理行为承担民事责任
 
 特征:
     1. 代理权限范围;         代理人实施代理行为时有独立进行意思表示的权利，否则，只能视为传达意思表示的使者
     2. 以被代理人名义;
     3. 法律意义;
     4. 后果归属于被代理人。
 */

#pragma mark 代理的种类
/*
 代理的种类：
     委托代理
         按照被代理人的委托行使代理
         招标代理、采购代理、诉讼代理
     法定代理
         根据法律的规定行使代理权
         只针对无民事行为能力人和限制民事行为能力人  监护人是其法定代理人
         监护人行使监护代理权
     指定代理
         有关单位或法院指定
         对无民事或限制民事行为能力的人指定代理
 
 
 
 建设工程的承包活动不得委托代理。
         招标活动、诉讼活动、采购活动可委托代理
         禁止转包、主体结构禁止分包
 委托代理，可以用书面形式，也可以用口头形式，但法律规定用书面的，应该用书面。
 授权委托书应载明:
     代理人的姓名或名称、
     代理事项、权限和期间，
     并由委托人签名或盖章。
 委托书授权不明的，被代理人应当向第三人承担民事责任，代理人负连带责任
 
 
 有些委托代理，代理人必须具备相应的资格才能代理
         比如招标代理
 */

#pragma mark 代理关系的终止
/*
    委托代理终止的情形和法定代理终止的情形易混（代理人或被代理人死亡导致的代理终止情形）

    委托代理终止 ：
        代理期限届满或代理事务完成
        被代理人取消委托或代理人辞去委托
        代理人死亡或丧失民事行为能力
        作为被代理人或者代理人的法人终止
 
    法定/指定代理终止：
        被代理人取得或恢复民事行为能力
        指定代理的人民法院或指定单位取消指定
        被代理人或代理人死亡
        代理人丧失民事行为能力
        由于其他原因引起的被代理人和代理人之间的监护关系消灭

注意：被代理人死亡，委托代理关系不一定终止
 */

#pragma mark 无权代理和表见代理 转代理 复代理
/*
 
 注意各自的法律效果
 
 无权代理与表见代理(区别:1、无权代理:无权，待定; 2、表见代理:无权，有效)
 表见代理是无权代理的一种特殊情况
 
 无权代理三种情形:
    1自始未经授权;
    2超越代理权;
    3代理权已终止。
 无权代理只有经过被代理人的追认，被代理人才承担民事责任。
 未经追认的行为，由行为人承担民事责任
 【无权代理的后果是效力待定】
 
 表见代理四个条件:
    1无权代理;
    2善意相对人有理由相信行为人有代理权的，
        情形包括行为人持有本人发出的委任状、已加盖公章的空白合同书或者有显示本人向向行为人授予代理权的通知函告等证明文件;
    3 本人有过失;
    4相对人为善意
 
 法律效果:无权代理追认有效
 表见代理该行为有效(被代理人无拒绝权，可追偿)
 
 【表见代理是一种特殊的无权代理】
 
 
 转代理:事先需同意，事后追认，紧急情况，为保护被代理人利益除外。（必须紧急且保护利益）
         事先取得同意的，有效代理
         事先未取得同意的，效力待定（紧急情况除外）
 复代理:代理人为处理代理事物，为被代理人选任其他人进行代理被称为复代理。
 
 知道他人以本人名义实施不做否认表示的视为同意
 */

#pragma mark 代理的责任承担（ 代理中的四个连带责任）
/*
 谁有错谁担责 都有错承担连带责任
 
 代理中的四个连带责任
 1. 委托书授权不明，被代理人应当向第三人承担民事责任，代理人负连带责任;
 2. 代理人和第三人串通，损害被代理人利益的，代理人和第三人负连带责任;
 3. 第三人知道行为人无权代理还与之实施民事行为，第三人和行为人连带责任;
 4. 违法代理行为，被代理人和代理人连带。
 
 1，4代理内部出问题; 2，3代理外部出问题。
 */



#pragma mark - ************** 建设工程物权制度

#pragma mark 物权的特征和种类
/*
一、物权的含义和法律特征
物权是指权利人依法对特定的物享有直接支配和排他的权利。   物包括动产和不动产。
 
物权的特征:支配权、绝对权、财产权、排他性
 
施工单位的施工活动是为了形成物——建设工程
 
二、物权种类
 所有权(最基本的权利):
         自己的财产
         占有、使用、收益、处分权(核心)
 四个用益物权:
         他人的财产
         (占有、使用、收益)
         土地承包经营权、建设用地使用权、宅基地使用权和地役权 （【除此之外都不是用益物权 租赁权不是用益物权】）
         因不动产或动产被征收、征用，致使用益物权消灭或者影响用益物权行使的，用益物权人有权获得相应补偿
 担保物权(为债而生，优先受偿)
         抵押权、质押权、留置权、定金、保证
 
*/
#pragma mark 与土地相关的物权(土地所有权、建设用地使用权和地役权)
/*
 
 土地所有权 ：哪些归国家所有，哪些归集体所有
 
 
 建设用地使用权 不能买卖 可以转让
 
建设用地使用权
        因建造建筑物、构筑物及其附属设施而使用国家所有的土地的权利。
         只能存在于国家所有的土地上，不包括农村土地
使用权人取得占有、使用、收益的权利，有权利用该土地建造建筑物等。 —— 房地产开发(房随地走，地随房走，房地一体)
可以在土地的地表、地上或者地下分别设立。新设立的建设用地使用权，不得损害已设立的用益物权。
设立建设用地使用权，可以采取出让(有偿)或者划拨(无偿)等方式。
     工业、商业、旅游、娱乐和商品住宅等【经营性用地】以及【同一土地上有两个以上意向用地者】的，应当采用招标、拍卖等公开竞价方式出让。
     国家严格限制以划拨方式设立建设用地使用权。
建设用地使用权自登记时设立。 不登记不设立
 
 建设用地使用权人应当合理利用土地，不得改变土地用途，需要改变土地用途的，应当依法经有关行政主管部门批准
 
*/

#pragma mark  建设用地使用权人的权利
/*
 
 建设用地使用权人的权利：
    有权将建设用地使用权转让、互换、出资、赠与、抵押 （不能质押）
        应订立书面合同;
        使用期限由当事人约定，但不得超出剩余期限;
        应当向登记机构申请变更登记
        土地与地上附着物一并处分(房随地走，房地一体)
    用地期满续期的权利
        住宅用地，期满自动续期
        非住宅用地，依法律规定办理
 
 建设用地使用权消灭的，出让人应当及时办理注销登记
 */

#pragma mark 地役权(约定)—— 因地生利
/*

地役权指为了使用自己不动产的便利或提高其效益而按合同约定利用他人不动产的权利
 
应采用书面形式订立，自合同生效时设立。
未经登记，不得对抗善意第三人。(可登记可不登记，和建设用地使用权相区别)
 
 地役权合同一般包括下列条款:
 (1)当事人的姓名或者名称和住所;
 (2)供役地和需役地的位置;
 (3)利用目的和方法;
 (4)利用期限;
 (5)费用及其支付方式;
 (6)解决争议的方法。
 
土地上已设立土地承包经营权、建设用地使用权、宅基地使用权等权利的，未经用益物权人同意，土地所有权人不得设立地役权。


需役地转让的，受让人同时享有地役权;供役地转让的，地役权对受让人具有约束力。
 
例:某建设单位为方便施工现场运输，借用项目相邻单位道路通行，双方约定建设单位每月支付20000元费用。
 
 
 【地役权、相邻权】
 */

#pragma mark 物权的设立、变更、转让、消灭和保护
/*
1.不动产物权的设立、变更、转让和消灭
    一般情况依法登记生效，自记载于不动产登记簿时生效;不登记，不生效。
    依法属于国家所有的自然资源，可不登记。
    不动产所在地的登记机构办理。
 
不动产登记与合同效力的关系：
    当事人之间订立有关设立、变更、转让和消灭不动产物权的合同，除法律另有规定或者合同另有约定外，自合同成立时生效;
    未办理物权登记的，不影响合同效力。

 2.动产物权设立和转让
 
     动产物权以占有和交付为公示手段。
     动产物权设立和转让，自交付时发生效力。
     船舶、航空器和机动车等物权的设立、变更、转让和消灭，未经登记，不得对抗善意第三人
 
 总结
 
 不动产物权      登记设立主义      自登记时设立(不登记不设立)
 例外:地役权     登记对抗主义      自地役权合同生效时设立，可以不登记。但未经登记不得对抗善意第三人
 
 一般动产物权     交付主义        自交付时设立(不登记也设立)
 特殊动产物权(车辆、船舶、航空器、企业动产等)    登记对抗主义  自交付时设立(不登记也设立，但未经登记不得对抗善意第三人)
 
 
 三、物权的保护
     因物权的归属、内容发生争议的，利害关系人可以请求确认权利。
 
     无权占有不动产或者动产的，权利人可以请求返还原物。
     妨害物权或者可能妨害物权的，权利人可以请求排除妨害或者消除危险。
     造成不动产或着动产损毁的，权利人可以请求修理、重做、更换或者恢复原状。
     侵害物权，造成权利人损害的，权利人可以请求损害赔偿也可以请求承相其他民事责任，
     对于物权保护方式，可以单独适用，也可以根据权利被侵害的情形合并适用
 
     侵害物权，除承担民事责任外，违反行政管理规定的，依法承担行政责任；构成犯罪的，依法追究刑事责任。
 */

#pragma mark - ************** 建设工程债权制度
#pragme mark 债的基本法律关系
/*
 
 债是按照合同的约定或者法律规定，在当事人之间产生的【特定的权利和义务关系】。
 
 债的内容是主体双方的权利与义务，即债权与债务。
 
 物权是绝对权，债权是相对权。
 债权具有相对性:主体、内容、责任相对。
 */
#pragme mark 债的发生根据
/*
    1.合同之债  最主要、最普遍   （施工合同 、材料买卖合同）
 
    2.侵权之债  没有法律依据侵害财产权和人身权（施工噪声）
        悬挂物、搁置物脱落，所有人、管理人或使用人承担责任(除非能证明自己没有过错) //所有人、管理人或使用人 三个中其中一个承担责任
        建筑物倒塌，建设单位与施工单位承担连带责任；因其他责任人原因的，由其他责任人承担侵权责任
         抛掷物品或坠落物品，难以确定侵害人，除能够证明自己不是侵权人的外，由可能加害的使用人补偿
    3. 不当得利
         没有法律或合同根据，有损于他人而取得的利益。
         得利者与受害者间形成。得利者应将所得的不当利益返还给受损失的人。
     4. 无因管理
         无法律或受托义务，而是自觉为他人管理事务的行为。管理人和受益人间形成。
 */

#pragme mark 建设工程债的常见种类
/*
 
 (一)施工合同债 (注意债权、债务的相对性)
        建设单位和施工单位。完成施工任务?支付工程款?
 (二)买卖合同债 （注意买方）
        材料设备的买方可能是建设单位，也可能是施工单位。
 (三)侵权之债
        噪声扰民，居民是债权人，施工单位或建设单位是债务人。
 */
#pragma mark - ************** 建设工程知识产权制度
#pragme mark  知识产权的法律特征

/*
 
 知识产权是权利人对其创造的 智力成果 依法享有的权利。
 我国的知识产权包括 著作权(版权)、专利权、商标专用权、发现权、发明权以及其他科技成果权。
 著作权(版权)、专利权、商标专用权 构成了我国知识产权的主体
 
 知识产权是一种无形财产权。特征如下:
 一、财产权和人身权的双重属性 【稿费、署名权】
 二、专有性 （排他性）
 三、地域性
 四、期限性
 
 知识产权常见种类
 */
#pragma mark 专利权 （保护期及开始计算时间）
/*
 
 专利权——指权利人在法律规定的期限内，对其发明创造所享有的 制造、使用和销售的专有权。
 
 保护对象:
         发明、
         实用新型
         外观设计(发明:从无到有。实用新型和 外观设计:有中改良)
 
 授予条件:
         发明和实用新型(新颖性、创造性和实用性);
         外观设计( 新颖性、富有美感和适于工业应用)
 
 专利人的权利:制造、使用、许诺销售、销售、进口其专利产品。
 
 保护期限:
         发明专利权20年;
         实用新型和外观设计10年;
         均自申请日起计算。
 
 专利申请日
         国务院专利行政主管部门收到专利申请文件之日为申请日
         如果申请文件是邮寄的，以寄出的邮戳日为申请日
 专利权的授予
         发明专利权、实用新型和外观设计专利权自公告之日起生效
 
 
 
 */
#pragma mark 商标权 （保护期及开始计算时间）

/*
 商标权
 1、指商标所有人对其注册商标享有的具体权利，
        只包括财产权，商标设计者的人身权受著作权法保护。
 2、商标专用权包括使用权和禁止权两方面。
         商标专用权的保护对象是经过国家商标管理机关核准注册的商标。
 
 商标专用权的保护对象是【经过国家商标管理机关核准注册的商标】
 
 注册商标需要改变其标志的，应当重新提出【注册】申请
 需要变更注册人名义、地址或其他注册事项的，应当提出【变更】申请
 
 3、商标有效期为10年，
        自核准注册之日起算;（不是申请之日）
        注册商标有效期满，需要继续使用的，应当在应当在期满前12个月内申请续展注册，
         在此期间未能提出申请的，可以给予6个月的宽限期。
         宽展期满仍未提出申请的，注销其注册商标
         每次续展注册的有效期为10年
 */
#pragma mark 著作权 （客体、保护期及开始计算时间）

/*
 著作权(版权)
         ——作者及其他著作权人依法对文学、艺术和科学作品所享有的专有权。
 
 客体:
         文字作品(【招投标文件、工作报告、施工企业的名称及标志】)、
         建筑作品、
         图形作品(工程设计图、产品设计图)、
         【计算机软件】。
 
 保护期限:
         从创作完成开始
         人身权（署名权、修改权、保护作品完整权）：不受限制
         公民发表权、使用权、获得报酬权为作者终生及其死后50年;
         合作作品， 以最后死亡作者为准;
         法人及其他组织作品，为首次发表后50年，但自创造完成后50年未发表的，不再保护。
         作者的署名权、修改权、保护作品完整权不受限制。
 
 主体(作者及其他享有著作权的公民、法人或其他组织，国家也可以成为著作权的主体)
 
 （著作权保护创作人的权利）
 种类                          形式                      著作权归属
 
 单位作品                 单位意志创作作品，如招、投标文件       单位
 
 职务作品(内部)           为完成工作任务而创作的作品，          一般由作者享有
                            如设计师与设计图纸           (2年内未经单位同意不得许可第三人使用)
                        (单位作品的作者是单位，           单位在业务范围内优先使用
                        而职务作品的作者是公民个人)          特殊(主要利用单位的物质技术条件，并由单位承担责任)
                                                     作者只享有署名权，其他权利归单位
 
 委托作品 (外部)          接受单位委托创作的作品，                按合同约定;
                            如勘察设计文件             合同无约定时推定为受托人 (受托人，就是付出了劳动的一方)
 
 【勘察设计文件的著作权由作者和单位共同所有】
 */

#pragma mark 计算机软件的法律保护
/*
 计算机软件的法律保护:
         (1)软件著作权属于软件开发者(在软件上署名的)，合作作品和委托作品有约按约、无约归实际开发人
         (2)软件合法复制品所有人可以装置、备份复制品，但不能通过任何方式提供给他人使用，并在丧失所有权时，负责将备份复制品销毁。
         (3)可以为了把该软件用于实际的计算机应用环境或者改进其功能、性能而对复制品进行必要的修改，但未经许可不可向任何第三人提供修改后的软件。
         (4)软件著作权制度存在合理使用(学习和研究)，可以不经软件著作权人许可，不向其支付报酬。
 
 */

#pragma mark 建设工程知识产权的保护
/*
 建设工程知识产权的保护
 
 建设工程知识产权权利人的权益受到损害的情况包括违约和侵权两种情况，当事人可以寻求的保护途径包括民法保护、行政法保护和刑法保护。
 
 建设工程知识产权发生纠纷后，由当事人协商解决;不愿协商或协商不成的，可以起诉，也可以请求知识产权行政主管部门处理。
 
 (一)建设工程专利权的保护 (诉前保全)
 
 专利权人或者利害关系人有证据证明他人正在实施或者即将实施侵犯专利权的行为， 如不及时制止将会使其合法权益受到难以弥补的损害的，可以在起诉前向人民法院申请采取责令停止有关行为的措施。
 
 申请人提出申请时，应当提供担保;不提供担保的，驳回申请。
 
 人民法院应当自接受申请之时起四十八小时内作出裁定;有特殊情况需要延长的， 可以延长四十八小时。裁定责令停止有关行为的，应当立即执行。当事人对裁定不服的，可以申请复议一次;复议期间不停止裁定的执行。
 
 (二)商标权的保护:
 
         《商标法》规定，注册商标的专用权，以 核准注册的商标 和 核定使用的商品为限
 下列属于侵犯注册商标专用权:
         (1)未经商标注册人的许可，在同一种商品或者类似商品上使用与其注册商标相同或者近似的商标的;(造假货)
         (2)销售侵犯注册商标专用权的商品的;(卖假货)
         (3)伪造、擅自制造他人注册商标标识或者销售伪造、擅自制造的注册商标标识的 ;(造或卖假商标)
         (4)未经商标注册人同意，更换其注册商标并将该更换商标的商品又投入市场的;  (贴牌)
         (5)给他人的注册商标专用权造成其他损害的。
 
 (三)著作权的保护
 对于著作权的保护，主要是民法保护。
 
 */

#pragma mark 建设工程知识产权侵权的法律责任
/*
 建设工程知识产权侵权的法律责任
         在建设工程知识产权侵权的民事责任中，最主要的是赔偿损失。
 4种确定方法:
         一、按照权利人因被侵权所受到的实际损失确定;  （权利人受损）
         二、实际损失难以确定的，可以按照侵权人因侵权所获得的利益确定; （侵权人获利）
         三、权利人的损失或者侵权人获得的利益难以确定的，参照倍数合理确定;
         四、以上都难以确定的，人民法院可以根据专利权的类型、侵权行为的性质和情节等因素，确定给予一定数额的赔偿。
         赔偿数额还应当包括权利人为制止侵权行为所支付的合理开支。
 
 */
#pragma mark - ************** 建设工程担保制度

#pragma mark 担保与担保合同的规定
/*
 担保与担保合同的规定
         一、担保方式:
                 保证、抵押、质押、留置和定金
         二、第三人为债务人向债权人提供担保时，可以要求债务人提供反担保。
             反担保适用《担保法》担保的规定。
         三、担保合同是主合同的从合同，主合同无效，担保合同无效。
 */

#pragma mark 保证
/*
    保证
 
 
 【注意保证的双方当事人】
 保证的概念 :
         是指保证人和债权人约定，当债务人不履行债务时，保证人按照约定履行债务或者承担责任的行为。
 
         最高额保证。
 
 保证人与债权人应当以书面形式订立保证合同
 
 保证人资格：
     (1)国家机关不得为保证人;但经国务院批准为使用外国政府或者国际经济组织贷款进行转贷的除外  【国家机关一律不得为保证人 是错误的】
     (2)学校、幼儿园、医院等以公益为目的的事业单位、社会团体不得为保证人;
     (3)企业法人的分支机构、职能部门不得为保证人，    有书面授权可以授权范围内提供担保
 具有代为清偿能力的法人、其他组织或公民，可以做保证人。如银行、担保公司
 
 
 保证方式:
     一般保证
     连带责任保证 :约定不明或没有约定
 
 一般保证的保证人在主合同纠纷未经审判或仲裁，并就债务人财产依法强制执行仍不能履行债务前，对债权人可以拒绝承担保证责任。
 
 保证范围:
        主债权、利息、
        违约金、
        损害赔偿金
        实现债权费用，
 没有约定或约定不明确的，应对全部债务承担责任。
 
 保证期间
    保证期间:
         有约定按约定；无约定，主债务履行期届满之日起6个月(未约定)
    保证期间合同变更
         债务人变更应取得保证人书面同意;未经同意不再承担保证责任(债务转让)
         债权人变更，保证继续有效;(债权转让)
         变更主合同，应取得保证人书面同意(主合同转让)
         未经保证人同意，变更加重保证人负担的，加重部分不再承担保证责任；减轻的，仍应承担保证责任
 
 
 建设工程施工常用的担保种类：
         银行保函
         保证书
         第三人的信用担保
         担保公司担保
 
         种类                             主体间关系                          保证内容
 
         施工投标保证金                投标人向招标人提供               投标人为自己的有效行为担保
         (招标估算价2%)
 
         履约保证金                   中标人向招标人提供              保证施工合同顺利履行
         (中标合同价10%)
 
         工程款支付担保                招标人向中标人提供             保证按照合同约定支付工程款
 
         预付款担保                  承包人向发包人提供               避免承包人拿到预付款后跑路或挪用
 
 
 招标人可以在招标文件中要求投标人提交投标保证金，中标人提交履约保证金【即要求提交必须交，没要求可不提，不是必须提】
 招标人要求中标人提供履约保证金,招标人应当同时应向中标人提供工程款支付担保
 */

#pragma mark 抵押
/*
 
 (不转移对抵押物的占有；债务人或第三人都可以抵押；动产和不动产都可以抵押；抵押物不能直接归债权人所有，优先受偿)
 
 抵押(不转移对抵押物的占有)
 
 一、概念
        债务人或者第三人不转移对财产的占有，将该财产作为债权的担保。
        债务人不履行债务时，债权人有权以该财产折价或以拍卖、变卖该财产的价款优先受偿的担保方式。
        债务人或者第三人称为抵押人，债权人称为抵押权人。
 二、抵押物
     (一)可以抵押的财产
        1、建筑物和其他土地附着物;
        2、建设用地使用权;
        3、以招标、拍卖、公开协商等方式取得的荒地等土地承包经营权;
        4、生产设备、原材料、半成品、产品 ;
        5、正在建造的建筑物、船舶、航空器;
        6、交通运输工具;
        7、法律、行政法规 未禁止抵押的其他财产
     (二)不得抵押的财产 （公有的和有问题的不能抵押）
         1、土地所有权;
         2、耕地、宅基地、自留地、自留山等集体所有的土地使用权 ;
         3、学校、幼儿园、医院等以公益为目的的事业单位、社会团体的教育设施、医疗卫生设施和其他社会公益设施;
         4、所有权、使用权不明或有争议的财产;
         5、依法被查封、扣押、监管的财产。
     (三)抵押权的产生
         (1)不动产登记生效:
                 建筑物;林木;建设用地使用权;荒地承包经营权;城市房地产;正在建造的建筑物。
         (2)动产合同生效时设立(未经登记不能对抗善意第三人):
                 生产设备、原材料、半成品、产品;交通运输工具;正在建造的船舶、航空器。
 三、抵押权的效力
     (1)抵押担保的范围
 
             主债权及利息、
             违约金
             损害赔偿金
             实现抵押权的费用。
             当事人也可以在抵押合同中约定抵押担保的范围。
 
     (2)抵押人有义务妥善保管抵押物并保证其价值。
             抵押人转让抵押物的价款，超过债权的部分归抵押人所有，不足部分由【债务人】清偿。（不足部分不是由抵押人清偿）
             转让抵押物的价款不得明显低于其价值。
             抵押人转让已登记抵押财产的，必须通知抵押权人并告知受让人，否则转让行为无效
             抵押人转让抵押物的价款，应当向抵押权人提前清偿所担保的债权或者向与抵押权人约定的第三人提存
     (3)抵押权与其担保的债权同时存在。
             抵押权不得与债权分离而单独转让或者作为其他债权的担保。
 
  四、抵押权的实现
 
        抵押权人可以与抵押人协议以抵押物折价或拍卖、变卖所得优先受偿
 
        实现顺序：（登记>顺序>比例）
             已登记的，按登记先后顺序;顺序相同，按比例清偿;
             未登记的，按合同生效先后顺序;顺序相同，按比例清偿;
             已登记的先于未登记清偿
 */

#pragma mark 质押
/*
 【抵押和质押都是优先受偿权 不能直接去的所有权】
 
 质押(必须转移对质押物的占有，这是与抵押最主要的区别)
 
 概念
    是指债务人或第三人将其动产或权利移交债权人占有，用以担保债权的实现， 当债务人不能履行债务时，债权人依法有权就该动产或权利优先得到清偿的担保法律行为。
 
 质权是一种约定的担保物权，以转移占有为特征。
 债务人或第三人为出质人，债权人为质权人，移交的动产或权利为质物。
 
 质押的分类:
    动产质押(能够用作质押的动产没有限制)
    权利质押:
         (1)汇票、 支票、本票、债券、存款单、仓单、提单;
         (2)依法可以转让的股份、股票;
         (3)依法可以转让的商标专用权、专利权、著作权中的财产权;
         (4)依法可以质押的 其他权利。
         注意:无房产证
 */

#pragma mark 留置权
/*
 留置权（法定担保物权）
        是指债权人按合同约定占有债务人的动产，当债务人在约定期限内不能履行债务时，债权人依法有权依法留置该动产，以该财产折价或拍卖、变卖所得优先受偿。
 
 留置的动产只能是债务人的 不能是第三人的
 
 施工单位拿不到工程款，拒绝交工不属于留置，属于抗辩权
 
 
 适用:
     保管、运输、加工承揽等法律规定可以留置的其他合同。
 注意:
    当事人可以在合同中约定不得留置标的物。
    留置权负有妥善保管留置物的义务。因保管不善致使留置物灭失或者损毁的，留置权人应当承担民事责任。
 
 注意:留置权>已登记抵押权>质权>未登记抵押权
 
 
 
 欠什么留什么 是留置
 欠什么用别的留抵  是质押
 */

#pragma mark 定金
/*
 定金
    履行后，抵作价款或收回
 
 
 定金合同:
        实践合同(交付定金合同生效)
        书面合同
        和违约金不可同时适用
【必须是书面合同、必须交付定金时生效，不可与违约金同时适用，20%】
 
 定金罚则
     (1)交付定金方违约:没收定金
     (2)收受定金方违约:双倍返还
 
 定金限额
     (1) 不超过合同金额20%
     (2)超过部分无效，视为预付款
 */
#pragma mark - ************** 建设工程保险制度

#pragma mark 保险概述
/*

 保险概述
    危险的存在是保险产生的前提。
    保险制度上的危险具有损失发生的不确定性，包括发生与否的不确定性、发生时间的不确定性和发生后果的不确定性。
 */
 #pragma mark 保险合同
 /*
 保险合同
  
 保险合同
    投保人与保险人约定保险权利义务关系的协议。
  
 投保人
    指与保险人订立保险合同，并按照合同约定负有支付保险费义务的人。
 保险人
    是指与投保人订立保险合同，并按照合同约定承担赔偿或者给付保险金责任的保险公司。
 被保险人
    是指其财产或者人身受保险合同保障，享有保险金请求权的人。
    投保人可以为被保险人。
 受益人
    是指人身保险合同中由被保险人或者投保人指定的享有保险金请求权的人 。
    投保人、被保险人可以为受益人。
  
 财产保险
    是以财产及其有关利益为保险标的的保险。
 人身保险
    是以人的寿命和身体为保险标的的保险。
  
    投保人可以按照合同约定向保险人【一次支付】全部保险费或者【分期支付】保险费。
    保险人对人寿保险的保险费，【不得用诉讼方式】要求投保人支付。

  在合同有效期内，保险标的的危险程度显著增加的，被保险人应当按照合同约定及时通知保险人，保险人可以按照合同约定增加保险费或者解除合同。

  
 建筑工程一切险和安装工程一切险属于?  财产保险合同
  */
#pragma mark 保险索赔
/*
 
 保险索赔
 保险索赔证明:
    保单、建设工程合同、事故照片、鉴定报告以及保单中规定的证明文件。
 计算损失大小:
    保险单上载明的保险财产全部损失，应当按照全损进行索赔。
    如果一个项目同时由多家保险公司承保，按比例。
 */
#pragma mark 建筑工程一切险
/*
 建筑工程一切险(及第三者责任险)
 
 1、建筑工程一切险
        是承保各类民用、工业和公用事业建筑工程项目，在建造过程中因自然灾害或意外事故而引起的一切损失的险种。
 2、投保人
        发包人，如委托承包人投保，保费由发包人承担。
 被保险人
        (1)业主或工程所有人;
         (2)承包商或分包商;
         (3)技术顾问等。
 
 3、承保范围:
        自然事件和意外事故
     除外责任:
         (1)保风险——必然发生的损失不保;
         (2)保自然事件、意外 事故——因被保险人疏于管理而发生的损失不保;
         (3)保建造/安装过程—— 开工前、竣工后的损失不保。
 
     (1)保风险，
            必然发生的损失(如材料损耗/机械磨损/维修检修费用)不保。
     (2)保自然灾害或意外事故，
            因被保险人疏于管理而发生的损失(如设计错误 /施工方法不当/材料不合格/停电断电造成的)不保。
     (3)战争/暴乱/恐怖袭击/罢工等属于除外责任，不保。
     (4)保建造/安装过程，保险财产中工程 业主已经验收合格或实际接收的部分 不保。
 
 4、第三者责任险:
        意外事故引起工地内及邻近区域的第三者人身伤亡、 疾病或财产损失;
        诉讼费用以及事先经保险人书面同意而支付的其他费用。
 
 5、赔偿金额:
        以法院或政府部门裁定为准，但不得超过保险单明细表中对应列明的每次事故赔偿限额;
        最高赔偿责任不得超过本保险单明细表中列明的累计赔偿限额。
 
 6、保险期限
         1起始:开工时或材料设备运抵工地时(以先发生者为准)
         2终止:验收合格时或实际占有使用时(以先发生者为准)
         3任何情况下，保险期限的起始或终止不得超出保险单明细表中列明的保险生效日或终止日。
 */
#pragma mark 安装工程一切险
/*
 安装工程一切险
 安装工程一切险的保险责任自保险工程在工地动工或用于保险工程的材料、设备运抵工地之时起始，至工程所有人对部分或全部工程签发验收证书或验收合格，或工程所有人实际占有或使用接收该部分或全部工程之时终止，以先发生者为准。
 
 1、保险期内一般应包括一个试车考核期
 2、试车考核期的保险责任一般不超过3个月，否则应另加收保险费
 3、对旧机器设备不负考核期的保险责任，也不承担其维修期的保险责任
 
 无论是建筑工程一切险还是安装工程一切险，在任何情况下，保险期限的起始和终止不得超出保险单明细表中列明的试车和考核期限。
 
 */
#pragma mark 工伤保险和建筑职工意外伤害险
/*
 工伤保险和建筑职工意外伤害险
 
 鼓励施工单位应当为施工现场从事危险作业的人员办理意外伤害险(法定非强制性，属于商业保险)
 施工企业应当为职工参加工伤保险(法定强制险，属于社会保险)
 
 */
#pragma mark 保险代理人和保险经纪人
/*
 保险代理人和保险经纪人
 
 保险代理人——保险人的委托
 保险经纪人——投保人的委托
*/
#pragma mark - ************** 建设工程法律责任制度


#pragma mark  法律责任
/*
 民事责任 行政处分 行政处罚 刑法
 
 
 法律责任
    是指行为人由于违法行为、违约行为或者法律规定而应承担的不利后果。
 5种责任
    (违宪、刑事、民事、行政和国家赔偿责任)，
 4个特征
    (存在法律义务、不利的后果、国家专门机关依照法定程序、国家强制力作保障)。
*/
 #pragma mark  民事责任
 /*
 民事责任 ：主要是财产责任
     违约责任:合同
     侵权责任 （过错、无过错）
         人身责任
         财产责任
 
承担民事责任的方式：
     停止侵害
     排除妨碍
     消除危险
     返还财产
     恢复原状
     修理、重作、更换
     赔偿损失
     支付违约金
     消除影响、恢复名誉(人身)
     赔礼道歉(人身)
 承担民事责任的方式， 可以单独适用，也可以合并适用。
 
 建设工程主要民事责任:
     返还财产(合同无效、被撤销)
     修理(质量问题或竣工验收不合格)
     赔偿损失(违约造成损失)
     支付违约金(违约不一定造成损失)
 
  */
#pragma mark  行政责任
/*
 行政责任(违法不犯罪)的种类及方式
 
 行政责任包括行政处罚和行政处分
 
 行政责任
    行政处罚
        警告
        罚款
        没收违法所得
        没收非法财物
        责令停产停业
        暂扣吊销许可证/营业执照
        行政拘留
    行政处分
        警告
        记过
        记大过
        降职
        降薪
        留用察看
        开除
 
 建筑行业特殊行政处罚:责令限期改正、责令停业整顿、取消投标资格、责令停止施工、降低资质、吊销或撤销资质证书
 
 */
#pragma mark  刑罚
/*
 刑罚种类
    主 刑
        管制
        拘役【不是拘留】
        有期徒刑
        无期徒刑
        死刑
    附 加 刑
        罚金【不是罚款】
        没收财产【不是没收违法所得】
        剥夺政治权利
        驱逐出境 (可单独适用）
 
 
 行政处罚（轻）     刑罚（重）
 
 拘留             拘役
 罚款             罚金
 没收违法所得      没收财产
 没收非法财物
 
 建设工程常见刑事责任
     一、工程重大安全事故罪:（工程质量）
            建设单位、设计单位、施工单位、工程监理单位违反国家规定，降低工程质量标准，造成重大安全事故的行为。（没有勘察单位）
             对直接责任人员处 5 年以下有期徒刑或者拘役，并处罚金
     【注释】重特大安全事故的标准:死亡≥10人，或重伤≥50人，或直接经济损失≥5000万元。
     二、重大责任事故罪:
            本罪的客观方面，表现为在生产、作业中【违反有关安全管理的规定】(如挪用安全管理费)，或者【强令他人冒险作业】【违章指挥】，因而发生重大伤亡事 故或者造成其他严重后果的行为。
     (1死3伤100万)
     三、重大劳动安全事故罪:
            本罪的客观方面，表现为在生产、作业中【安全生产设施】 或【安全生产条件】不符合国家规定，发生重大伤亡事故或造成其他重大严重后果。
     四、串通投标罪:
            投标人相互串通投标报价，损害招标人或者其他投标人利益，情节严重的，处3年以下有期徒刑或者拘役，并处或者单处罚金。投标人与招标人串通投标，损害国家、集体、公民的合法利益的，依照以上规定处罚。
 */

#pragma mark - ************** 建设工程施工许可制度

/*
 
 施工许可制度
         对建设工程法定的开工条件进行审核的制度。
 
 */

#pragma mark 1Z302011 施工许可证和开工报告的适用范围

/*
 
一 、施工许可证的适用范围
 
     (一) 需要办理施工许可证的建设工程
    《施工许可办法》规定，在我国境内从事各类
         (1) 房屋建筑及其附属设施的【建造】、【装修装饰】和【与其配套的线路、管道、设备的安装】，以及
         (2) 城镇市政基础设施工程的施工，
     建设单位在开工前应当向工程所在地的县级以上地方人民政府住房城乡建设主管部门申请领取【施工许可证】
 
    (二)不需要办理施工许可证的建设工程一一太小的、太大的、太急的、太老的(文物修缮)、临时的、保密的、农民自建低层住宅
        1.限额以下的小型工程
            《施工许可办法》规定，工程投资额在30万元以下或者(或者≠且)建筑面积在300平米以下的建筑工程，可以不申请办理施工许可证。 (30 或300)
                 【总投资1500万，建筑面积295 m的建筑工程一一小型工程 不需要办理施工许可证。】
                 注:  一一面积很小或投资很小  不需要办理施工许可证
        2.抢险救灾等工程  【防洪设施≠抢险救灾; 灾后重建≠抢险救灾】
            《建筑法》规定，抢险救灾及其他临时性房屋建筑和农民自建低层住宅的建筑活动，不适用本法。
 
 【不需要办理的：（满足任意一条就不用办理）
            抢险救灾
            农民自建低层住宅的建筑活动
            30万以下的
            300平米
 】
 
     (三) 不重复办理施工许可证的建设工程
 
            《建筑法》规定，按照【国务院】规定的权限和程序批准开工报告的建筑工程(一一西气东输、南水北调)，不再领取施工许可证
            开工报告与施工许可证“二择一”
            开工报告的批准单位是国务院 【不是住建部】，住建部只管房建和公路;不是建设单位、也不是监理单位
     (四)另行规定的建设工程
         《建筑法》规定，军用房屋建筑工程建筑活动，由国务院、中央军事委员会依据本法制定。
 
 二、实行开工报告制度的建设工程
 
     开工报告审查的内容主要包括:
         (1)资金到位情况;
         (2) 投资项目市场预测;
         (3) 设计图纸是否满足施工要求;
         (4) 现场条件是否具备“三通一平’  等的要求。
 
     国务院规定的开工报告制度，不同于建设监理中的开工报告工作。
         (1) 性质不同，前者是政府主管部门的一种行政许可制度(=行政审批制度)后者则是监理单位对施工单位开工准备工作的认可;
         (2) 主体不同，前者是建设单位向政府主管部门申报，后者则是施工单位向监理单位提出。
         (3) 内容不同，前者主要是建设单位应具备的开工条件，后者则是施工单位应具备的开工条件
 
 */

#pragma mark 1Z302012 申请主体和法定批准条件

/*
 二、施工许可证的法定批准条件
 
     《建筑工程施工许可管理办法》规定，建设单位申请领取施工许可证，应当具备下列条件，并提交相应的证明文件:
         (一) 依法应当办理用地批准手续的，已经办理该建筑工程用地批准手续
                 【一一房屋建筑的装修装饰，不需要办理用地批准手续】
         (二)在城市、镇规划区的建筑工程，已经取得规划许可证(用地规划+ 工程规划)
                 【一一申请施工许可证是取得建设用地规划许可证的前置条件(X)】
                 1.建设用地规划许可证
                     划拨方式: 先领取【用地规划许可证】-再取得土地使用权
                     出让方式: 先取得土地使用权一再领取【用地规划许可证】
                     应当向城市、县人民政府城乡规划主管部门提出【建设用地(规划)规划许可】申请

         (三)施工场地已经基本具备施工条件，需要征收房屋的，其进度符合施工要求(满足开始施工和连续施工要求） 拆迁全部完成(X )
         (四)已经确定施工企业  （招投标已结束，并签订建设工程承包合同）
                 按照规定应当招标的工程没有招标，应当公开招标的工程没有公开招标，或者肢解发包工程，以及将工程发包给不具备相应资质条件的企业的，所确定的施工企业无效。一一施工合同无效，所确定的施工企业就无效
         (五) 有满足施工需要(设备材料采购、非标准设备制作)的技术资料，施工图设计文件已按规定审查合格

                 施工图设计文件应当对其涉及【公共利益、公众安全、工程建设强制性标准】的内容进行审查。
         (六)有保证工程质量和安全的具体措施
                 按照规定办理了工程质量、安全监督手续
                 《质量条例》规定，建设单位在领取口施工许可证或者开工报告前，应当按照国家有关规定办理工程质量监督手续
                 《安全条例》规定，建设单位在申请领取施工许可证时，应当提供建设工程有关安全施工措施的资料.依法批准开工报告的建设工程，建设单位应当自开工报告批准之日起15 内(1-2012)，将保证安全施工的措施报送有关部门备案。
                         【领取施工许可证时，要提供安全措施资料;开工报告批准之日起15日，进行安全措施备案;
                         安全措施: 施工许可证是先提供，开工报告是后备案。】
                 《安全条例》规定，建设行政主管部门在审核发放施工许可证时，应当对建设工程是否有安全施工措施进行审查，对没有安全施工措施的，不得颁发施工许可证。

         (七)按照规定应当委托监理的工程已委托监理
             《质量条例》规定，下列建设工程必须实行监理:
                 (1) 国家重点建设工程;
                 (2) 大中型公用事业工程;
                 (3) 成片开发建设的住宅小区工程;
                 (4) 利用外国政府或者国际组织贷款、援助资金的工程;
                 (5) 国家规定必须实行监理的其他工程。
         (八)建设资金已经落实
             【已经落实 不是全部到位】
             《施工许可管理办法》规定，建设工期不足1年的,到位资金原则上不得少于工程合同价的50%，建设工期超过1年的，到位资金原则上不得少于工程合同价的30%。【合同价 不是总投资  一时间短的系数大】
             建设单位应当提供本单位截至申请之日【无拖欠工程款情形的承诺书】或者能够表明其无拖欠工程款情形的其他材料，以及【银行出具的到位资金证明】，有条件的可以实行银行付款保函或者其他第三方担保
         (九)法律、行政法规规定的其他条件  ------兜底条款
                 只有法律和行政法规，才有权增加施工许可证新的申领条件。
                《施工许可管理办法》规定，县级以上地方人民政府住房城乡建设主管部门不得违反法律法规规定，增设办理施工许可证的其他条件。
                目前，已增加的施工许可证申领条件主要是消防设计审核
             《消防法》规定，依法应当经公安机关消防机构进行消防设计审核的建设工程(2类(1)大型人员密集场所(2)其他特殊工程)  未经依法审核或者审核不合格的，不得给予施工许可，建设单位、施工单位不得施工;
                             --对于(1)(2)消防设计审核合格是领取施工许可证的前置条件。
                 其他（不是必须消防设计审核的）建设工程取得施工许可后经依法抽查不合格的，应当停止施工。
                             ---对于其他工程先领取施工许可证，再抽查，不合格的停止施工
     发证机关应当自收到申请之日起15日内，对符合条件的申请颁发施工许可证; 对于不符合条件的，书面通知建设单位，并说明理由。对于证明文件不齐全或者失效的，应当当场或者5日内一次告知建设单位需要补正的全部内容。

 */

#pragma mark 1Z302013 延期开工、核验和重新办理批准的规定

/*
 
 一、申请延期的规定
     《建筑法》规定，建设单位应当自领取施工许可证之日起3个月内开工。因故不能按期开工的，应当向发证机关申请延期; 延期以两次为限，每次不超过3个月(一一最多可延期6个月，自领证之日最长9个月内开工)
     既不开工又不申请延期或者超过延期时限的，施工许可证【自行废止】
 
 二、核验施工许可证的规定
         核验 已开工项目  前提是“在建的”工程，“没开工的”涉及不到“重新核验”
         《建筑法》规定，在建的建筑工程因故中止施工的，建设单位应当自中止施工之日起一个月内，向发证机关报告 ,并按照规定做好建筑工程的维护管理工作 ; 。建筑工程工时  应当向发证机关报告(2-2017); 中止施工满一年的工程恢复施工前，建设单位应当报发证机关核验施工许可证
                 (一一谁领证，谁报告)
                  中止施工 由建设单位做好维护管理工作  暂停施工 ，由施工单位做好维护管理工作
                     中止施工 不等于 暂停施工; )
 三、重新办理批准手续的规定
     《建筑法》规定,按照国务院有关规定批准开工报告的建筑工程，因故不能按期开工或者中止施工的，应当及时向批准机关报告情况。
     因故不能按期开工超过6个月的，应当重新办理开工报告的批准手续
 (2-2012) (1-2016)。
 
 
 */

#pragma mark 1Z302014 违法行为应承担的法律责任

/*
 
 二、规避办理施工许可证应承担的法律责任
 
     《施工许可管理办法》规定，对于未取得施工许可证或者为规避办理施工许可证将工程项目分解后擅自施工的，由有管辖权的发证机关责令停止施工，限期改正，对建设单位处工程合同价款1%以上2%以下罚款; 对施工单位处3万元以下罚款。
 
 三、骗取和伪造施工许可证应承担的法律责任
 
     《施工许可管理办法》规定,建设单位采用欺骗、贿赂等不正当手段取得施工许可证的，由原发证机关撤销施工许可证，责令停止施工，并处1万元以上3万元以下罚款; 构成犯罪的，依法追究刑事责任。一一建设单位已骗到(撤销)，罚1-3万
 
     建设单位隐瞒有关情况或者提供虚假材料申请施工许可证的，发证机关不予受理或者不予许可，并处1万元以上3 万元以下罚款; 构成犯罪的，依法追究刑事责任。一一没骗到，罚1-3万
 
     建设单位伪造或者涂改施工许可证的，由发证机关责令停止施工，并处1万元以上3万元以下罚款; 构成犯罪的，依法追究刑事责任。一一伪造涂改，罚1-3万
 
 四、对单位主管人员等处罚的规定
 
     给予单位罚款处罚的，对单位直接负责的主管人员和其他直接责任人员处单位罚款数额5%以上10%以罚款。
     单位及相关责任人受到处罚的，作为不良行为记录予以通报。
 
 */

#pragma mark - ************** 1Z302020 施工企业从业资格制度



#pragma mark 1Z302021 企业资质的法定条件和等级

/*
/*
 
 
 一、施工企业资质的法定条件一一有钱、有人、有业绩、有装备
 
     企业应当按照其拥有的下述条件申请建筑业企业资质。
         1.资质升级需4个条件，2.首次(增项)申请资质不需要(三)，3.保资质不需要(三)。
         (一)有符合规定的净资产
         (二)有符合规定的主要人员(一一注册建造师、工程技术人员、施工现场管理人员等)
         (三)有符合规定的已完成工程业绩(一一三级企业除外)
         (四)有符合规定的技术装备
 二、施工企业的资质序列、类别和等级
 
     (一)施工企业的资质序列
         《企业资质管理规定》规定,建筑业企业资质分为施工总承包资质、专业承包资质、施工劳务资质三个序列。
 
          【建设单位】可以将 施工总承包工程 发包给 具有【施工总承包资质的单位】，也可以将 专业工程 发包给 具有【专业承包资质的单位】
          具有【施工总承包资质的单位】 可以将 专业工程 分包给 具有【专业承包资质的单位】 也可以将劳务作业 分包给 具有【施工劳务资质的单位】
          具有【专业承包资质的单位】 也可以将劳务作业 分包给 具有【施工劳务资质的单位】
 
         【建设单位不能将劳务直接发包】
 
 
                                    建设单位
 
                施工总承包单位                                     专业承包单位
 
        专业承包单位      劳务承包单位                                劳务承包单位
 
        劳务承包单位

 
     (二)施工企业的资质类别和等级
 
         施工总承包资质、专业承包资质按照工程性质和技术特点分别划分为若干资质类别，各资质类别按照规定的条件划分为若干资质等级。
         施工劳务资质不分类别与等级
 
         施工总承包资质序列设有12个类别。施工总承包资质一般分为4个等级，即特级、一级、二级和三级。
         专业承包序列设有36个类别。专业承包序列一般分为3个等级(一级、二级、三级)。
 
 
 三、施工企业的资质许可
 
     (一)施工企业资质管理体制
         企业违法从事建筑活动的，违法行为发生地的县级(一一通用) 以上地方人民政府住房城乡建设主管部门或者其他有关部门应当依法查处，并将违法事实、处理结果或者处理建议及时告知该建筑业企业资质的许可机关。
 
 四、施工企业资质证书的申请、延续和变更
 
     (一)企业资质的申请
 
         《企业资质管理规定》规定,企业可以申请一项或多项建筑业企业资质。
         企业首次申请或增项申请资质，应当申请【最低等级资质】。
         企业申请建筑业企业资质，应当提交以下材料:一一不包括业绩
             (1)建筑业企业资质申请表及相应的电子文档;
             (2) 企业营业执照正副本复印件;
             (3) 企业章程复印件;
             (4) 企业资产证明文件复印件一有钱;
             (5) 企业主要人员证明文件复印件一一有人;
             (6) 企业资质标准要求的技术装备的相应证明文件复印件一一有装备;
             (7)企业安全生产条件有关材料复印件;
             (8) 按照国家有关规定应提交的其他材料。
     (二)企业资质证书的延续
                    安全生产许可证  建造师注册证书印章  企业资质证书
            有效期      3年             3年           5年
            届满前      3月             30日          3月
            延续        3年             3年           5年
         资质许可机关应当在建筑业企业资质证书有效期届满前做出是否准予延续的决定; 逾期未做出决定的，视为准予延续。
 
     (三)企业资质证书的变更
 
         1.办理企业资质证书变更的程序
 
             企业在建筑业资质证书有效期内名称、地址、注册资本、法定代表人等发生变更的，应当在工商部门办理变更手续后1个月内办理资质证书变更手续。
             ------企业资质证书变更走2 步(@工商部门变更营业执照一@建设主管部门变更资质证书)
 
         2.企业更换、遗失补办建筑业企业资质证书  ----遗失: 先声明再补办
                 企业遗失建筑业企业资质证书的，在申请补办前应当在公众媒体上刊登遗失声明。
         3.企业发生合并、分立、改制的资质办理
                 企业发生合并、分立、重组以及改制等事项，需承继原建筑业企业资质的，应当申请重新核定建筑业企业资质等级。
     (四)不予批准企业资质升级申请和增项申请的规定
 
         企业申请建筑业企业资质升级、资质增项，在申请之日起前1年至资质许可决定作出前，有下列情形之一的，资质许可机关不予批准(一一企业信用不良):
             (1) 超越本企业资质等级或以其他企业的名义承揽工程(一一挂靠)，或允许其他企业或个人以本企业的名义承揽工程的(一一被挂靠);
             (2)与建设单位或企业之间相互串通投标，或以行贿等不正当手段谋取中标的;
             (3) 未取得施工许可证擅自施工的;
             (4) 将承包的工程转包或违法分包的;
             (5) 违反国家工程建设强制性标准施工的;
             (6) 恶意拖欠分包企业工程款或者劳务人员工资的;
             (7) 隐瞒或谎报、拖延报告工程质量安全事故，破坏事故现场、阻碍对事故调查的;
             (8) 按照国家法律、法规和标准规定需要持证上岗的现场管理人员和技术工种作业人员未取得证书上岗的;
             (9) 未依法履行工程质量保修义务或拖延履行保修义务的;
             (10) 伪造、变造、倒卖、出租、出借或者以其他形式非法转让建筑业企业资质证书的;
             (11) 发生过较大以上质量安全事故或者发生过两起以上一般质量安全事故的(一一一般事故2起不予批准，其他事故1起不予批准);
             (12) 其它违反法律、法规的行为。

     (五) 企业资质证书的撤回、撤销和注销
             一撤回一合法取得，不再具备条件; 撤销一行政机关违法颁发;因无效，而注销(确保证书失效) ;吊销  (违法)情节严重的，吊销
 
         1.撤回一一撤回一合法取得，不再具备条件
             取得建筑业企业资质证书的企业，应当保持资产、主要人员、技术装备(一一无业绩要求)等方面满足相应建筑业企业资质标准要求的条件。
 
             企业不再符合相应资质标准要求条件的，应当责令其限期改正并向社会公告，整改期限最长不超过3个月;
             企业整改期间不得申请建筑业企业资质的升级、增项；不能承揽新的工程
             逾期仍未达到要求条件的，资质许可机关可以撤回其建筑业企业资质证书。
 
             被撤回建筑业企业资质证书的企业，可以在资质被撤回后3个月内，向资质许可机关提出核定低于(不是高于大等于)原等级同类别资质的申请。
 
 
 
         2.撤销一一撤销一行政机关违法颁发
 
             有下列情形之一的，资质许可机关应当撤销建筑业企业资质:
                 (1) 资质许可机关工作人员滥用职权、玩忽职守准予资质许可的;
                 (2) 超越法定职权准予资质许可的;
                 (3) 违反法定程序准予资质许可的;
                 (4) 对不符合资质标准条件的申请企业准予资质许可的;
                 (5) 依法可以撤销资质许可的其他情形。
                 以欺骗、贿赂等不正当手段取得资质许可的，应当予以撤销。
 
         3.注销一一注销一因无效，而注销(确保证书失效)
             有下列情形之一的，资质许可机关应当依法注销建筑业企业资质，并向社会公布其建筑业企业资质证书作废，企业应当及时将建筑业企业资质证书【交回】资质许可机关:
                 (1)资质证书有效期届满，未依法申请延续的;
                 (2) 企业依法终止的;
                 (3) 资质证书依法被撒回、撤销或吊销的;
                 (4) 企业提出注销申请的;
                 (5)法律、法规规定的应当注销建筑业企业资质的其他情形。

 五、外商投资建筑业企业的规定
     (二) 申请设立外商投资建筑业企业应当提交的资料
         中外合资经营建筑业企业、中外合作经营建筑业企业，中方合营者的出资总额不得低于注册资本的25%。
     (三)外商投资建筑业企业的工程承包范围
 
         【注】1(1)外资>50%的项目; (2)外资<50%，中企不能独立实施，省建设厅批准的项目。
         外资建筑业企业只允许在其资质等级许可的范围内承包下列工程:
         (1) 全部由外国投资、外国赠款、外国投资及赠款建设的工程;
         (2) 由国际金融机构资助并通过根据贷款条款进行的国际招标授予的建设项目;
         (3)外资>50%的中外联合建设项目，以及外资<50%，但因技术困难而不能由中国建筑企业独立实施，经省、自治区、直辖市建设行政主管部门批准的中外联合建设项目;
         (4) 由中国投资，但因技术困难而不能由中国建筑企业独立实施的建设项目，经省、自治区、直辖市建设行政主管部门批准，可以由中外建筑企业联合承揽。
     (四)外商投资建筑业企业的监督管理
             承揽施工总承包工程的外商投资建筑业企业，建筑工程主体结构的施工必须由其自行完成。
             外商投资建筑业企业与其他建筑业企业联合承包，应当按照资质等级低的企业的业务许可范围承包工程。
 */
 #pragma mark 1Z302022 禁止无资质或越级承揽工程的规定
 
 /*
  
 一、禁止无资质承揽工程
  
         严禁个人承揽分包工程业务。“包工头”(X);“挂靠”(X)。
  
         《解释》规定,  ‘实际施工人以转包人、违法分包人为被告起诉的，人民法院应当依法受理。
          实际施工人以发包人为被告主张权利的，人民法院可以追加转包人或者违法分包人为本案当事人，发包人只在欠付(承包人)工程价款的范围内对实际施工人承担责任”。
  
          一下图中: 甲欠乙500万,乙欠丙600万,丙只可以向甲主张500万。
         甲(发包人)  .......  乙(承包人)( 违法分包人、转包人）........  丙(实际施工人)
  
  
 二、禁止越级承揽工程一一禁止超越资质
      (一)联合共同承包对资质的有关法律规定
         《建筑法》规定，两个以上不同资质等级(一一相同类别)的单位实行联合共同承包的，应当按照资质等级低的单位的业务许可范围承揽工程。
  
          (1)不同等级和不同类别，不受“资质等级低”限制;
                  如甲是房屋建筑工程(类别)特级(等级)，乙是公路工程(类别)一级(等级)，甲乙组成联合体是房屋建筑工程特级，公路工程一级。
  
          (2)联合共同承包(联合体投标)一般适用于大型或结构复杂(不是技术复杂) 的建设工程项目。
          (3)联合承包各方(联合体各方)都必须具有与其承包工程相符合的资质条件，不能超越资质等级联合承包。
          (4)联合(共同)承包的各方(联合体各方)对承包合同的履行承担连带责任
          (5)联合体不是法人。
  
  */
#pragma mark 1Z302023 禁止以他企业或他企业以本企业名义承揽工程的规定

/*

 《建筑法》规定,禁止建筑施工企业超越本企业资质等级许可的业务范围或者以任何形式用其他建筑施工企业的名义承搅工程  （禁止超越资质、禁止挂靠)。
 禁止建筑施工企业以任何形式允许其他单位或者个人使用本企业的资质证书、营业执照  以本企业的名义承揽工程(一一禁止被挂靠)
 

 《分包管理办法》规定，分包工程发包人没有将其承包的工程进行分包，在施工现场所设项目管理机构的 【项目负责人、技术负责人、项目核算负责人、质量管理人员、安全管理人员】不是工程承包人本单位人员的，【视同】允许他人以本企业名义承揽工程(一一视同被挂靠)。
 【五类人必须是本单位人员】
 
 */
#pragma mark 1Z302024 违法行为应承担的法律责任

/*
 【注意和安全生产许可证的违法责任相比较】
 
 一、企业申请办理资质违法行为应承担的法律责任
 
  《资质管理规定》中规定,申请人隐瞒有关情况或者提供虚假材料申请建筑业企业资质的，不予受理或者不予行政许可，并给予警告，申请人在年内不得再次申请建筑业企业资质    -------没骗到，警告，1年内不得再申请
 以欺骗、贿赂等不正当手段取得建筑业企业资质证书的，由县级以上地方人民政府建设主管部门或者有关部门给予警告，并依法处以罚款，申请人3年内不得再次申请建筑业企业资质   ------已骗到，撤销，3年内不得再申请
 
 
 
 
 */

#pragma mark - ************** 1Z302030 建造师注册执业制度

#pragma mark 1Z302032  建造师考试、注册和继续教育的规定

/*
 
  未取得注册证书和执业印章的，不得担任大中型建设工程项目的施工单位项目负责人，不得以注册建造师的名义从事相关活动。
  -----小型项目的项目经理可以由非建造师担任
 
 
  二、一级建造师的注册
        (一)申请初始注册、延续注册
 
            初始注册者，可自资格证书签发之日起3年内提出申请。逾期未申请者，须符合本专业继续教育的要求后方可申请初始注册。
            注册建造师注册证书和执业印章由本人保管，任何单位(发证机关除外)和个人不得扣押注册建造师注册证书或执业印章。
 
        (二)变更注册和增项注册

            在注册有效期内，注册建造师变更执业单位，应当与原聘用单位解除劳动关系，并按照规定办理变更注册手续，变更注册后仍延续原注册有效期

            注册建造师需要增加执业专业的，应当按照规定申请专业增项注册、

            注册建造师应当通过企业按规定及时申请办理变更注册、续期注册等相关手续。
            多专业注册的注册建造师，其中一个专业注册期满仍需以该专业继续执业和以其他专业执业的，应当及时办理续期注册。

            注册建造师变更聘用企业的，应当在与新聘用企业签订聘用合同后的1个月内，通过新聘用企业申请办理变更手续。
            因变更注册申报不及时影响注册建造师执业、导致工程项目出现损失的，由注册建造师所在聘用企业(一一新聘用企业)承担责任，并作为不良行为记入企业信用档案。
 
             聘用企业与注册建造师解除劳动关系的，应当及时申请办理注销注册或变更注册。
             聘用企业与注册建造师解除劳动合同关系后无故不办理注销注册或变更注册的，注册建造师可向省级建设主管部门]申请注销注册证书和执业印章。
             注册建造师要求注销注册或变更注册的，应当提供与原聘用企业解除劳动关系的有效证明材料。
             建设主管部门经向原聘用企业核实，聘用企业在7日内没有提供书面反对意见和相关证明材料的，应予办理注销注册或变更注册。
 
         (三)不予注册和注册证书的失效、注销
 
             《注册建造师管理规定》规定，申请人有下列情形之一的，不予注册:
                 (1) 不具有完全民事行为能力的;
                 (2) 申请在两个或者两个以上单位注册的;（申请两个单位注册 不予注册；两个单位受聘的，吊销）
                 (3) 未达到注册建造师继续教育要求的;
                 (4) 受到刑事处罚，刑事处罚尚未执行完毕的;
                 (5) 因执业活动受到刑事处罚，自【刑事处罚执行完毕之日】起至申请注册之日止不满5年的;
                 (6) 因前项规定以外的原因(非执业活动)受到刑事处罚,自处罚决定之日起至申请注册之日止不满3年的;
                 (7) 被吊销注册证书，自【处罚决定之日】起至申请注册之日止不满2年的;
                 (8) 在申请注册之日前3年内担任项目经理期间，所负责项目发生过重大质量和安全事故的;
                 (9) 申请人的聘用单位不符合注册单位要求的;
                 (10)年龄超过65周岁的;
                 (11) 法律、法规规定不予注册的其他情形。

             注册建造师有下列情形之一的，其注册证书和执业印章失效:（换单位 原单位证和章就失效）
                 (1)聘用单位破产的;
                 (2) 聘用单位被吊销营业执照的;
                 (3) 聘用单位被吊销或者撤回资质证书的;
                 (4) 已与聘用单位解除聘用合同关系的;
                 (5) 注册有效期满且未延续注册的;
                 (6) 年龄超过65周岁的;
                 (7) 死亡或不具有完全民事行为能力的;
                 (8) 其他导致注册失效的情形。

             注册建造师有下列情形之一的，由注册机关办理注销(一一因无效，而注销) 手续，收回注册证书和执业印章或者公告其注册证书和执业印章作废:
                 (1) 有以上规定的注册证书和执业印章失效情形发生的;
                 (2) 依法被撤销注册的;
                 (3) 依法被吊销注册证书的;
                 (4) 受到刑事处罚的;
                 (5) 法律、法规规定应当注销注册的其他情形。

 三、一级建造师的继续教育
 
     接受继续教育,既是注册建造师应当享有的权利，也是注册建造师应当履行的义务。
     注册建造师按规定参加继续教育，是申请初始注册、延续注册、增项注册和重新注册的必要条件。
 
     1.必修课、选修课的学时和内容
         注册一个专业的建造师在每一注册有效期内应参加继续教育不少于120学时，其中必修课60学时，选修课60学时。注册两个及以上专业的，每增加一个专业还应参加用增加专业60学时的继续教育，其中必修课30学时选修课30学时。---60(公共课)+60(专业课) XN(专业数量)
 
         每一注册有效期内，充抵继续教育选修课学时累计不得超过60学时。
 
         注册建造师在参加继续教育期间享有国家规定的工资、保险、福利待遇。
 
 
 */

#pragma mark 1Z302033 建造师的受聘单位和执业岗位范围

/*
 一、建造师的受聘单位
 
         《注册建造师管理规定》规定，取得资格证书的人员应当受聘于一个具有建设工程勘察、设计、施工、监理、招标代理、造价咨询等一项或者多项资质的单位，经注册后方可从事相应的执业活动。
         担任施工单位项目负责人的，应当受聘并注册于一个具有施工资质的企业。
 
 二、一级建造师的执业范围
 
     一级建造师可以担任特级、一建筑业企业资质的建设工程项目施工的项目经理
 
     (一) 执业区域范围
 
         一级注册建造师可在全国范围内以一级注册建造师名义执业。
 
     (二)执业岗位范围
 
         大中型工程施工项目负责人必须由本专业注册建造师担任。
         一级注册建造师可担任大、中、小型工程施工项目负责人。
         一一一级建造师可以担任特级、一级、二级、三级企业大、中、小型施工项目的项目经理。但大中型施工项目必须是本专业建造师(一一如小型市政项目可以由建筑专业的建造师担任项目经理一一大中型必须专业对口)。
 
     注册建造师不得同时担任两个及以上建设工程施工项目负责人。发生下列情形之一的除外:
     (1)同一工程相邻分段发包或分期施工的;
     (2) 合同约定的工程验收合格的;
     (3) 因非承包方原因致使工程项目停工超过120 天(含)，经建设单位同意的（本款需三个条件）
 

     【仅仅经受聘企业同意 不能更改施工项目负责人； 经发包方同意 可以更换】
     注册建造师担任施工项目负责人期间原则上不得更换。如发生下列情形之一的，应当办理书面交接手续后更换施工项目负责人:
     (1) 发包方与注册建造师受聘企业已解除承包合同的;
     (2) 发包方同意更换项目负责人的;
     (3) 因不可抗力等特殊情况必须更换项目负责人的。
     注册建造师担任施工项目负责人，在其承建的建设工程项目【竣工验收或移交项目手续办结前】，除以上规定的情形外，不得变更注册至另一企业
 
     建设工程合同履行期间变更项目负责人的，企业应当于【项目负责人变更5个工作日】内报建设行政主管部门和有关部门及时进行网上变更。
 

     (三) 执业工程范围
         注册建造师应当在其注册证书所注明的专业范围内从事建设工程施工管理活动。
 
 */

#pragma mark 1Z302034 建造师的基本权利和义务

/*
 
 一、建造师的基本权利
 
     建造师经注册后，有权以建造师名义担任建设工程项目施工的项目经理。
 
     《注册建造师管理规定》规定，注册建造师享有下列权利:
     (1) 使用注册建造师名称;
     (2) 在规定范围内从事执业活动;
     (3) 在本人执业活动中形成的文件上签章;
     (4) 保管和使用本人注册证书、执业印章;
     (5) 对本人执业活动进行解释和辩护;
     (6) 接受继续教育;
     (7) 获得相应的劳动报酬;
     (8) 对侵犯本人权利的行为进行申述。
 
     建设工程施工活动中形成的有关工程施工管理文件，应当由注册建造师签章。施工单位签署质量合格的文件上，必须有注册建造师的签章
     只有注册建造师签章完整的工程施工管理文件方为有效。

         “应当”是指令性规范，“必须”是强制性规范。违反强制性规范的，文件确定无效。一一签章=签字十盖章(“或”x)
 
 
     建设工程合同包含多个专业工程的，担任施工项目负责人的注册建造师，负责该工程施工管理文件签章(一一多个专业工程一起发包: 签章不要求专业对口)。
     专业工程独立发包时，注册建造师执业范围涵盖该专业工程的，可担任该专业工程施工项目负责人(一  专业工程独立发包: 项目经理必须专业对口)。
 
     分包工程施工管理文件应当由分包企业注册建造师签章(一一分包施工管理文件: 分包建造师签章)。
     分包企业签署质量合格的文件上，必须由担任总包项目负责人的注册建造师签章(一一分包质量合格的文件: 分包建造师+总包项目负责人签章)
 
     修改注册建造师签章的工程施工管理文件，应当征得所在企业同意后，由注册建造师本人进行修改;
     注册建造师本人不能进行修改的，应当由企业指定同等资格条件的注册建造师修改，并由其签字并加盖执业印章。
      【修改必须征得企业同意，本人修改，企业指定，同等资格】
 
 
 二、建造师的基本义务
 
     《注册建造师管理规定》规定，注册建造师应当履行下列义务:
     (1) 遵守法律、法规和有关管理规定，恪守职业道德;
     (2)执行技术标准、规范和规程;
     (3) 保证执业成果的质量，并承担相应责任;
     (4) 接受继续教育，努力提高执业水准;
     (5) 保守在执业中知悉的国家秘密和他人的商业、技术等秘密;
     (6) 与当事人有利害关系的，应当主动回避;
     (7) 协助注册管理机关完成相关工作。
 
     担任建设工程施工项目负责人的注册建造师在执业过程中，应当及时、独立完成建设工程施工管理文件签章,无正当理由不得拒绝在文件上签字并加盖执业印章。担任建设工程施工项目负责人的注册建造师对其签署的工程管理文件承担相应责任
 
 三、注册机关的监督管理
     有下列情形之一的，注册机关依据职权或者根据利害关系人的请求，可以撤销注册建造师的注册(一行政机关违法颁发):
     (1)注册机关工作人员滥用职权、玩忽职守作出准予注册许可的;
     (2) 超越法定职权作出准予注册许可的;
     (3) 违反法定程序作出准予注册许可的;
     (4) 对不符合法定条件的申请人颁发注册证书和执业印章的;
     (5) 依法可以撤销注册的其他情形。
     申请人以欺骗、贿赂等不正当手段获准注册的，应当予以撤销
 
 《注册建造师执业管理办法(试行)》规定，注册建造师违法从事相关活动的，违法行为发生地县级以上地方人民政府建设主管部门或有关部门应当依法查处，并将违法事实、处理结果告知注册机关; 依法应当撤销注册的，应当将违法事实、处理建议及有关材料报注册机关，注册机关或有关部门应当在7个工作日内作出处理，并告知行为发生地人民政府建设行政主管部门或有关部门。
 
 注册建造师异地执业的,工程所在地省级人民政府建设主管部门应当将处理建议转交注册建造师注册所在地省级人民政府建设主管部门，注册所在地省级人民政府建设主管部门应当在14个工作日内作出处理，并告知工程所在地省级人民政府建设行政主管部门。
 
 */

#pragma mark  1Z302035 违法行为应承担的法律责任

/*
 
 
 一、建造师注册违法行为应承担的法律责任重点
 
 《注册建造师管理规定》中规定，隐瞒有关情况或者提供虚假材料申请注册的，建设主管部门不予受理或者不予注册，并给予警告，申请人1年内不得再次申请注册。一一没骗到，警告，1年内不得再申请
 以欺骗、贿赂等不正当手段取得注册证书的，由注册机关撤销其注册，3年内不得再次申请注册，并由县级以上地方人民政府建设主管部门处以罚款。一一已骗到，撤销，3年内不得再申请
 聘用单位为申请人提供虚假注册材料的，由县级以上地方人民政府建设主管部门或者其他有关部门给予警告，责令限期改正; 逾期未改正的，可处以1万元以上3万元以下的罚款。
 
 二、建造师继续教育违法行为应承担的法律责任
 
 注册建造师应按规定参加继续教育，接受培训测试，不参加继续教育或继续教育不合格的不予注册

 对于采取弄虚作假等手段取得《注册建造师继续教育证书》的，一经发现，立即取消其继续教育记录，并记入不良信用记录，对社会公布。
 
 三、无证或未办理变更注册执业应承担的法律责任
 
 《注册建造师管理规定》中规定，未取得注册证书和执业印章，担任大中型建设工程项目施工单位项目负责人，或者以注册建造师的名义从事相关活动的，其所签署的工程文件无效，由县级以上地方人民政府建设主管部门或者其他有关部门给予警告，责令停止违法活动，并可处以1万元以上3万元以下的罚款。
 
 未办理变更注册而继续执业的，由县级以上地方人民政府建设主管部门或者其他有关部门责令限期改正;逾期不改正的，可处以5000元以下的罚款。
 
 六、注册执业人员未执行法律法规及因过错造成质量事故应承担的法律责任
 
 【安全】注册执业人员未执行法律法规(=未执行强标)的，责令停止执业3个月以上1年以下;情节严重的，吊销执业资格证书, 5年内不予注册; 造成重大安全事故的,  终身不予注册。
 【节能】注册执业人员未执行民用建筑节能强制性标准的，责令停止执业3个月以上1年以下 ;2 情节严重的，吊销执业资格证书，5年内不予注册。
 【质量】 注册执业人员违反法律法规规定，因过错造成质量事故的，责令停止执业1年: 造成重大质量事故的，吊销执业资格证书，5年内不予注册; 情节特别恶劣的，终身不予注册。
         【注】 重大安全事故，终身不予注册;
               重大质量事故，5年内不予注册; 情节特别恶劣的,终身不予注册。
 【转包】 注册执业人员未执行法律法规，在认定有转包行为的项目中担任施工单位项目负责人的，吊销其执业资格证书，5年内不予注册，且不得再担任施工单位项目负责人。
 【挂靠】 对认定有挂靠行为的个人，不得再担任该项目施工单位项目负责人; 有执业资格证书的吊销其执业资格证书，5年内不予执业资格注册; 造成重大质量安全事故的，吊销其执业资格证书， 终身不予注册。
 

 */
#pragma mark - ************** 建设工程招标投标制度
/*
    视为串标 / 属于串标
 
 */

 #pragma mark ****** 一、招标前的准备工作(定范围/定标准/定方式/定场所)
/*
建设工程法定招标的范围、招标方式和交易场所
*/
#pragma mark 法定招标的范围
/*
 一个工程是否招标，需要考虑【范围+规模】两个条件，只有两个条件同时满足才必须招标
 
 法定招标的范围（三个工程必须满足四个标准）
     必须招标的项目范围(工程和资金性质—三类工程)
         大型基础设施、公用事业等关系社会公共利益、公众安全的项目(工程) （个人投资的也必须招标）
         全部或者部分使用国有资金投资或者国家融资的项目（资金）
         使用国际组织或者外国政府贷款、援助资金的项目（资金）
      项目规模 (四个标准)（二一添作五 事不过三）
         施工合同单项合同估算价200万元以上
         重要设备、材料等货物采购合同单项合同估算价100万元以上
         勘察、设计、监理等单项合同估算价50万元以上
         总投资额3000万元以上
 【解释】
 基础设施:
         能源项目
         交通运输项目
         通讯项目
         水利项目
         城市设施
         环境保护
 公用事业:
         市政
         教科文卫体
         商品住宅
 国有资金:
        1. 使用各级财政预算的项目
        2. 政府性专项建设资金
        3. 国企事业单位自有资金 (且国有投资者拥有控制权)
 国家融资:
        1. 国债项目
        2. 国家借款
        3. 国家政策性贷款
        4. 国家授权投资主体融资
 外国资金:
        1.国际贷款
        2.外国贷款
        3.国际救助
 
 
 可以不招标的施工项目：（在不适宜招标的情况下，可以不招标）
     涉及国家安全、国家秘密或抢险救灾
     用扶贫资金实行以工代赈或使用农民工
     需要采用不可替代的专利或专有技术（不可替代\专有）
     采购人依法能够自行建设、生产或提供
     需要向原中标人采购，否则影响施工或功能配套要求的
     已通过招标方式选定的特许经营项目投资人依法能够自行建设、生产、提供的
 
 3+4-5 必须招标
 5可以不招标

 */
#pragma mark 建设工程招标方式
/*
 建设工程招标方式
 
 一、公开招标
     采用招标公告的方式邀请不特定组织
     范围:
        全部使用国有资金或占控股、主导地位的依法必须招标的项目，【应当】公开招标
        例外是可以邀请招标（属于邀请招标范围的可以邀请招标 人少钱多）
 二、邀请招标
     采用投标邀请书的方式邀请三个以上组织
     范围：【必须公开招标的项目，符合以下条件的可以邀请招标】
             技术复杂或特殊要求或受自然环境限制，只有少量潜在投标人可供选择（人少）
             采用公开招标方式的费用占项目合同金额的比例较大（钱多）
     国务院发展计划部门确定的【国家重点项目】和省级政府确定的【地方重点项目】不适宜公开招标的，经相应政府批准可以邀请招标
 
 【国家重点项目和地方重点项目，应当公开招标；不适宜公开招标的，经批准可以邀请招标】
 【国有资金占控股或主导地位的依法必须招标的项目，应当公开招标；但投标人太少或费用过大的，可以邀请招标】
 
 三、总承包招标
     招标人可以依法对工程以及与工程建设有关的货物、服务全部或者部分实行总承包招标
 四、两阶段招标
     适用范围:【技术复杂】或者【无法精确拟定技术规格】的项目，可以进行两阶段招标
     第一阶段，投标人提交不带报价的技术建议，招标人技术建议确定技术标准和要求，编制招标文件（技术标）
     第二阶段，第一阶段提交技术建议的投标人提交包括最终技术方案和投标报价的投标文件（商务标 交报价 交投标保证金）
    只有提技术标的投标人才能进行第二阶段的投标
 */
#pragma mark 建设工程招标交易场所
/*
 建设工程招标交易场所
 
 《招投标条例》规定，招标投标交易场所不得与行政监督部门存在隶属关系，不得以营利为目的。
     国家鼓励利用信息网络进行电子招标投标
 
 一、设区的市级以上地方人民政府可以根据实际需要，建立统一规范的招标投标交易场所
 电子招投标活动完成招标投标交易 、公共服务、行政监督三项活动。
 
 数据电文形式与纸质形式的招标投标活动具有同等法律效力。
 
 二、招标人或者其委托的招标代理机构应当在资格预审公告、招标公告或者投标邀请书中载明潜在投标人访问电子招标投标交易平台的网络地址和方法。
 三、相关公告（【资格预审公告和招标公告 ，不包括投标邀请书】）应当在【电子招标投标交易平台】和【国家指定的招标公告媒介】同步发布;
 四、投标人应当在投标截止时间前完成投标文件的传输递交，并可以补充、修改或者撤回;
 五、投标截止时间前未完成投标文件传输的，视为撤回投标文件。
     投标截止时间后 送达的投标文件，电子招标投标交易平台应当拒收。
 */

 #pragma mark ****** 二、招投标的基本程序(招标/投标/开标/评标/定标/签合同)
/*
 
 招标基本程序和禁止肢解发包、限制排斥投标人的规定
 
 招标基本程序:
     公开、公平、公正、诚实信用原则。
 建设工程招标的基本程序包括:
     履行项目审批手续、
             按照国家有关规定需要履行项目审批、核准手续的依法必须进行招标的项目，其【招标范围、招标方式、招标组织形式】应当报项目审批、核准部门审批、核准
     委托招标代理机构、编制招标文件及标底、
     发布招标公告或投标邀请书、
     资格审查、
     开标、
     评标、
     中标 、
     签订合同、
     终止招标。
 
 */

#pragma mark  履行项目审批手续
/*
 履行项目审批手续
 
 资金来源已经落实
 
 审批事项:
     按规定履行手续，依法必须招标项目 审批其【招标范围（3+4-5）、方式（公开招标/邀请招标）和组织形式（自己招标/委托招标）】
 
 招标基本程序:
 */

#pragma mark 委托招标代理机构
/*
 委托招标代理机构
 
《招投标法》规定，招标人具有编制招标文件和组织评标能力的，可以自行办理招标事宜。（能编、能评）
 依法必须进行招标的项目，招标人自行办理招标事宜的，应当向有关行政监督部门【备案】。
 
《招投标法》规定，招标代理机构是依法设立的社会中介组织 。
 招标代理机构应当具备下列条件:
 (1)有从事招标代理业务的营业场所和相应资金;（有钱）
 (2)有能够编制招标文件和组织评标的相应专业力量;（有能力）
 (3)有符合本法规定条件、可以作为评标委员会成员人选的技术、经济等方面的专家库。（专家库）
 
 《招投标条例》规定，招标代理机构不得在所代理的招标项目中投标或者代理投标，也不得为所代理的招标项目的投标人提供咨询。
 
 */

#pragma mark 编制招标文件及标底
/*
 1、招标文件的内容:
     招标文件应当包括【招标项目的技术要求】、【对投标人资格审查的标准】、【投标报价要求】和【评标标准】等所有实质性要求和条件以及【拟签订合同的主要条款】。
 2、提交投标文件的时间
     招标人应当确定投标人编制投标文件所需要的合理时间;
     但是，依法必须进行招标的项目，自招标文件开始【发出之日】起至投标人提交投标文件截止之日止，最短不得少于20日。（【依法必须招标 编制时间不少于20天】）
 3、招标文件(资格预审文件)的修改或澄清
     招标人对已发出的招标文件进行必要的澄清或者修改的，应当在招标文件要求提交投标文件截止时间至少十五日前，以书面形式通知所有招标文件收受人。
     该澄清或者修改的内容为招标文件的组成部分。
     招标人澄清或者修改资格预审文件， 应当在提交资格预审申请文件截止时间至少3日前，以书面形式通知所有获取资格预审文件的潜在投标人。
     不足3日或者15日的，招标人应当顺延提交资格预审申请文件或者投标文件的截止时间。
 
    资格预审文件或招标文件的发售期不得少于5日
 
 【只要在截标之前，招标人都有权修改或者澄清】
 
 【编制日期、发售日期、修改日期】（20 5 15\3 ）
 
 
 招标人应当在招标文件中载明【投标有效期】，投标有效期从【提交投标文件的截止之日】起算
    投标有效期自提交投标文件截止时间开始，至招标文件固定的结束时间止，但发出中标通知书后，投标有效期自动终止
 【截标时间==开标时间==投标有效期开始时间==投标保证金有效期开始时间==公布标底时间】

 
 4、对招标文件的异议
     潜在投标人或者其他利害关系人对招标文件有异议的，应当在投标截止时间10日前提出。招标人应当自收到异议之日起3日内作出答复;作出答复前， 应当暂停招标投标活动。
 （10 3 ）
 
 5、标底
     招标人可以自行决定是否编制标底。
     一个招标项目只能有一个标底。标底必须保密。
     招标项目设有标底的，招标人应当在开标时公布。
    接受委托编制标底的中介机构不得参加受托编制标底项目的投标，也不得为该项目的投标人编制投标文件或者提供咨询

 6、最高(最低)投标限价
     招标人设有最高投标限价的，应当在招标文件中明确最高投标限价或者最高投标限价的计算方法。
     招标人不得规定最低投标限价。
 
     国有资金投资的建筑工程招标的，应当设有最高投标限价;
     非国有资金投资的建筑工程招标的，可以设有最高投标限价或者招标标底。
 
     招标设有最高投标限价的，应当在招标【不是开标】时公布：
                 1.最高投标限价的总价
                 各单位工程的：
                     2.分部分项工程费
                     3.措施项目费
                     4.其他项目费
                     5.规费
                     6.税金
 
     全部使用国有资金投资或者以国有资金投资为主的建筑工程，应当采用工程量清单计价;
     非国有资金投资的建筑工程，鼓励采用工程量清单计价。
 
     工程量清单应当作为招标文件的组成部分。
 
 
 */

#pragma mark 发布招标公告或投标邀请书
/*
 发布招标公告或投标邀请书
 
 (1)招标公告(招标邀请书)的内容
     应当载明招标人的名称和地址、招标项目的性质、数量、实施 地点和时间以及获取招标文件的办法等事项。
 (2)招标文件(资格预审文件)的发售
     资格预审文件或者招标文件的发售期不得少于5日。
     招标人发售资格预审文件、招标文件收取的费用应当限于补偿印刷、邮寄的成本支出，不得以营利为目的。
 
 */

#pragma mark 资格审查
/*
 资格审查
 
 资格预审的分类:分为资格预审(投标前)和资格后审(开标后)
 
 资格预审:
     1依法必须进行招标的项目提交资格预审申请文件的时间， 自资格预审文件【停止发售】之日起不得少于5日。
     2国有资金占控股或者主导地位的依法必须进行招标的项目，招标人应当组建资格审查委员会审查资格预审申请文件。
          资格审查委员会及其成员应当遵守招标投标法和本条例有关评标委员会及其成员的规定。
     3未通过资格预审的申请人不具有投资资格。
          通过资格预审的申请人少 3个的，应当重新招标。
          【通过资格预审的申请人不少于3个的，一律开标  ❌】
     4对资格预审文件的异议
         潜在投标人或者其他利害关系人对资格预审文件有异议的，应当在提交 资格预审申请文件截止时间2日前提出。招标人应当自收到异议之日起3 日内作出答复;作出答复前，应当暂停招标投标活动。
 
 资格后审:招标人采用资格后审办法对投标人进行资格审查的，应当在开标后由评标委员会按照招标文件规定的标准和方法对投标人的资格进行审查。
 
 */

#pragma mark 招投标的时间要求
/*
    招标文件或资格预审文件发售时间：    资格预审文件或者招标文件的发售期不得少于5日
    招标文件编制时间：               依法必须进行招标的项目，自招标文件开始【发出之日】起至投标人提交投标文件截止之日止，最短不得少于20日
    招标文件修改时间：               招标人对已发出的招标文件进行必要的澄清或者修改的，应当在招标文件要求提交投标文件截止时间至少十五日前，以书面形式通知所有招标文件收受人
    资格预审申请时间：               依法必须进行招标的项目提交资格预审申请文件的时间， 自资格预审文件【停止发售】之日起不得少于5日
    资格预审文件的修改时间：          招标人澄清或者修改资格预审文件， 应当在提交资格预审申请文件截止时间至少3日前，以书面形式通知所有获取资格预审文件的潜在投标人
 
    对招标文件异议：                潜在投标人或者其他利害关系人对招标文件有异议的，应当在投标截止时间10日前提出。招标人应当自收到异议之日起3日内作出答复;作出答复前， 应当暂停招标投标活动
    对资格预审文件的异议：           潜在投标人或者其他利害关系人对资格预审文件有异议的，应当在提交 资格预审申请文件截止时间2日前提出。招标人应当自收到异议之日起3 日内作出答复;作出答复前，应当暂停招标投标活动
 
 
    公示中标候选人                 依法必须进行招标的项目，招标人应当自收到评标报告之日起3日内公示中标候选人，公示期不得少于3日
 
    合同签订时间：                 招标人和中标人应当自中标通知书【发出之日起（30）日内】，按照招标文件和中标人的投标文件订立书面合同;
    中标备案：                    依法必须招标的建设项目，招标人应当自确定中标人之日起 (15 )日内， 向有关行政监督部门提交招标投标情况的书面报告
 
    退还投标保证金                 招标人最迟应当在书面合同签订后【5日内】向中标人和未中标的投标人退还投标保证金及银行同期存款利息
                                投标人在截标之前撤回投标文件的，也是收到申请之日起5日内退还
 */

#pragma mark 开标
/*
 开标
 
 
 1.开标时间和地点
     开标应当在招标文件确定的提交投标文件截止时间的同一时间公开进行;
     开标地点应当为招标文件中预先确定的地点。
 2.程序
     开标由招标人主持，邀请所有投标人参加。
     开标时，由投标人或者其推选的代表检查投标文件的密封情况，也可以由招标人委托公证机构检查并公证;经确认无误后，由工作人员当众拆封，宣读投标人名称、投标价格和投标文件的其他主要内容。
     招标人在招标文件要求提交投标文件的截止时间前收到的所有投标文件，开标时都应当当众予以拆封、宣读。
     开标过程应当记录，并存档备查。
 
    投标人少于3个的，不得开标，招标人应当重新招标
 
【投标文件，提交后，可以撤回，必须进入投标有效期后才具有法律效力】
 */

#pragma mark 评标
/*
 评标
 
 1.评标委员会
     评标由招标人依法组建的评标委员会负责。
     依法必须进行招标的项目，其评标委员会由招标人的代表和有关技术、 经济等方面的专家组成，成员人数为5人以上单数(含5人)，其中经济、技术专家不少于成员总数的2/3。
     与投标人有厉害关系的人不得进入相关项目的评标委员会；已经进入的应当更换
     评标委员会成员的名单在中标结果确定前应当保密。
     评标委员会专家随机抽取，招标人代表不能随机抽取
 （>=5人单数 + >2/3 ）
 
 2.评标
     评标委员会经评审，认为所有投标都不符合招标文件要求的，可以否决所有投标。
     依法必须进行招标的项目的所有投标被否决的，招标人应当依法重新招标。
 
     评标委员会成员应当依照招标投标法和本条例的规定，按照招标文件规定的评标标准和方法，客观、公正地对投标文件提出评审意见。
     招标文件没有规定的评标标准和方法不得作为评标的依据。
     评标委员会不得对评标标准进行细化
 
     评标委员会成员不得私下接触投标人，不得收受投标人给予的财物或者其他好处，不得向招标人征询确定中标人的意向，不得接受任何单位或者个人明示或者暗示提出的倾向或者排斥特定投标人的要求，不得有其他不客观、不公正履行职务的行为。
 
 3.标底
     招标项目设有标底的，招标人应当在开标时公布。
     标底只能作为评标的参考，不得以投标报价是否接近标底作为中标条件，也不得以投标报价超过标底上下浮动范围作为否决投标的条件。
 
 4.否决投标（必考）
     1投标文件未经投标单位盖章和单位负责人签字;（都没有的否决，有一个就不能否决）
     2投标联合体没有提交共同投标协议;
     3投标人不符合国家或者招标文件规定的资格条件;
     4同一投标人提交两个以上不同的投标文件或者投标报价，但招标文件要求提交备选投标的除外;
     5投标报价低于成本或者高于招标文件设定的最高投标限价;
     6投标文件没有对招标文件的实质性要求和条件作出响应;
     7投标人有串通投标、弄虚作假、行贿等违法行为。
 
 5.投标人对投标文件的澄清和说明 （必考）
     评标委员会可以要求投标人对投标文件中含义不明确的内容作必要澄清或说明，但是澄清或者说明不得超出投标文件的范围或改变投标文件的实质性内容。
     投标文件中有含义不明确的内容、明显文字或者计算错误，评标委员会认为需要投标人作出必要澄清 、说明的 ，应当书面通知该投标人 。
 
     投标人的澄 清、说明应当采用书面形式，并不得超出投标文件的范围或者改变投标文件的实质性内容。【书面往来】
     评标委员会不得暗示或者诱导投标人作出澄清、说明，不得接受投标人主动提出的澄清、说明。
 
 6.评标后工作
     评标完成后， 评标委员会应当向招标人提交书面评标报告和中标候选人名 单。
     中标候选人应当不超过3个，并标明排序。（3个以下的候选人）
     评标报告应当由评标委员会全体成员签字。对评标结果有不同意见的评标委员会成员应当以书面形式说明其不同意见和理由，评标报告应当注明该不同意见。
     评标委员会成员拒绝在评标报告上签字又不书面说明其不同意见和理由的，视为同意评标结果。
 
 
 */

#pragma mark 定标
/*
 定标
 
 中标人的投标应当符合下列条件之一
 1、能够最大限度地满足招标文件中规定的各项综合评价标准
 2、能够满足招标文件的实质性要求，并且经评审的投标价格最低；但是投标价格低于成本的除外（中标的是经过评审的最低投标价，而不是指报价最低的投标）
 
 中标人的确定
 (1)招标人根据评标委员会提出的书面评标报告和推荐的中标候选人确定中标人，招标人也可以【授权评标委员会直接确定】中标人。
     国有资金占控股或主导地位的依法必须招标的项目，招标人应当确定排名第一的中标候选人为中标人;
 (2)排名第一的中标候选人放弃中标、不可抗力、不交履约保证金的，招标人可以按照中标候选人名单排序依次确定其他中标候选人为中标人，也可以重新招标。
 
 【
     国有资金占控股或主导地位的依法必须招标的项目，
        1.必须公开招标
        2.招标人应当组建资格审查委员会审查资格预审申请文件
        3.招标人应当确定排名第一的中标候选人为中标人;
 】
 
 中标候选人的经营、财务状况发生较大变化或者存在违法行为，招标人认为可能影响其履约能力的，应当在发出中标通知书前由原评标委员会按照招标文件规定的标准和方法审查确认。
 
 依法必须进行招标的项目，招标人应当自收到评标报告之日起3日内公示中标候选人，公示期不得少于3日
 
 在确定中标人前，招标人不得与投标人就投标价格、投标方案等实质性内容进行谈判【确定中标人后，招标人和中标人也不能谈】
 
 */

#pragma mark 签订合同
/*
 合同的签订
 (1)招标人和中标人应当自中标通知书【发出之日起（30）日内】，按照招标文件和中标人的投标文件订立书面合同;
 (2)招标人和中标人不得再行订立背离合同实质性内容的其他协议
     招标人和中标人应当依法签订书面合同，合同的标的、价款、质量、履行期限等主要条款与招标文件和中标人的投标文件的内容一致
     当事人就同设工程另行订立的建设工程施工合同与经过备案的中标合同实质性内容不一致的，应当以备案的中标合同作为结算工程价款的根据。
     招标人与中标人另行签订的合同违法无效
 
     对备案的中标合同可以进行协商变更【行情发生变化，如备案合同是可调价合同，可以变更;如备案合同是固定价，不可变更】
 
 依法必须招标的建设项目，招标人应当自确定中标人之日起 【15 】日内， 向有关行政监督部门提交招标投标情况的书面报告。
 
 
 《质量条例》规定，建设单位将建设工程肢解发包的，责令改正，处工程合同价款 0.5%以上 1%以下的罚款
 对全部或者部分使用国有资金的项目，并可以暂停项目执行或者暂停资金拨付
 
 */
//投标人、投标文件和投标保证金
#pragma mark  投标人
/*
 投标人
 
     投标人参加依法必须进行招标项目的投标，不受地区或者部门的限制
     招标人不得组织单个或者部分潜在投标人踏勘现场（分批次踏勘也不行）
 
     与招标人存在利害关系可能影响招标公正性的法人、其他组织或者个人，不得参加投标，否则投标无效
     单位负责人为同一人或者存在控股、管理关系的不同单位，不得参加【同一标段投标】或者【未划分标段的同一招标项目投标】【不是同一招标项目，有修饰词】，否则投标无效
     投标人发生合并、分立、破产等重大变化的，不再具备资格预审文件、招标文件规定的资格条件或者其投标影响招标公正性的，其投标无效。
 
 
 */

#pragma mark  联合体投标
/*
 联合体投标的含义:
     两个以上法人或其他组织组成
 
 资质条件要求
     均应具备资质
     就低不就高(同一专业)
 
 共同投标协议
     必须签订，否则，否决投标
 
 联合体各方的责任
     (1)共同与投标人签订合同，且承担连带责任
     (2)不得重复投标，否则投标无效
     (3)联合体应当在提交资格预审申请文件前组成。
     资格预审后不得随意改变联合体的构成，否则投标无效。
     各方在同一项目中以自己名义单独投标或参加其他联合体投标的，相关投标均无效。
 
 《招投标条例》规定，招标人应当在资格预审公告、招标公告或者投标邀请书中载明是否接受联合体投标
 */

#pragma mark  投标文件
/*
 
 应当按照招标文件的要求编制投标文件 应当对招标文件的实质性要求和条件作出响应
 招标项目属于建设施工项目的，投标文件的内容应当包括1.拟派出的项目负责人与主要技术人员的简历、业绩和2.拟用于完成招标项目的机械设备等
 投标报价应当根据工程量清单、工程计价有关规定、企业定额、市场价格信息等编制
 
 投标文件的修改或撤回
     在投标截止日期前，可补充、修改、撤回投标文件，并书面通知招标人
 
 投标文件的送达与签收
     时间:
         招标文件规定的截止时间前
     密封要求:
         招标人收到投标文件后，应当签收保存，不得开启
     有效投标数量:
         3个及以上
     拒收:
         未通过预审、逾期送达或者未按招标文件要求密封的
 
 */

#pragma mark  投标保证金
/*
 形式
    现金
    银行保函
    保兑支票
    银行汇票
    现金支票
 
 金额
     不超过招标项目估算价的2%，如果是施工项目也不能超过80万
 
  有效期
     与投标有效期一致
 
 作用:
     在投标有效期内随意撤销投标或中标后不提交履约保证金和签署合同，招标人有权不退投标保证金
 
 现金或支票形式的保证金应当从其基本账户转出
 投标人应当按照招标文件要求的方式和金额，将【投标保证金随投标文件提交】给招标人或委托的招标代理机构
 
 
 两阶段招标，招标人要求投标人提交投标保证金的，应在第二阶段提出
 
 招标人退还投标保证金的时间
     招标人终止招标的，应当及时退还所收取的【投标保证金及银行同期存款利息】
     投标人撤回提交投标文件的，招标人应当自收到投标人书面撤回通知之日起【5日内】退还投标保证金，不退同期存款利息
     投标截止后投标人撤销投标文件的，招标人可以不退还投标保证金
     招标人最迟应当在书面合同签订后【5日内】向中标人和未中标的投标人退还投标保证金及银行同期存款利息
 
 */
 #pragma mark ****** 三、禁止行为(限制排斥潜在投标人/串标)
/*
 
 */

#pragma mark  禁止限制、排斥投标人
/*
 禁止限制、排斥投标人
 
 招标人有下列行为之一的，属于以不合理条件限制、排斥潜在投标人或者投标人:
     (一)就同一招标项目向潜在投标人或者投标人提供有差别的项目信息;
     (二)设定的资格、技术、商务条件与招标项目具体特点和实际需要不适应或与合同履行无关;
     (三)依法必须进行招标的项目以特定行政区域或者特定行业的业绩、奖项作为加分条件或者中标条件;
     (四)对潜在投标人或者投标人采取不同的资格审查或者评标标准;
     (五)限定或者指定特定的专利、商标、品牌、原产地或者供应商;
     (六)依法必须进行招标的项目非法限定潜在投标人或者投标人的所有制形式或者组织形式;
     (七)以其他不合理条件限制、排斥潜在投标人或者投标人;
 
 招标人不得组织单个或者部分潜在投标人踏勘项目现场。
 
 */

#pragma mark  禁止串通投标和其他不正当竞争行为的规定
/*
 1Z303014 禁止串通投标和其他不正当竞争行为的规定
 
 考点十八:禁止串通投标及其他不正当竞争行为的规定
 
 一、禁止投标人相互串通
     有下列情形之一的，属于投标人相互串通投标:
        投标人之间协商投标报价等投标文件的实质性内容
        投标人之间约定中标人
        投标人之间约定部分投标人放弃投标或者中标
        属于同一集团、协会、商会等组织成员的投标人按照该组织要求协同投标
        投标人之间为谋取中标或者排斥特定投标人而采取的其他联合行动
 
     有下列情形之一的，视为投标人相互串通投标:
         不同投标人的投标文件由同一单位或者个人编制
         不同投标人委托同一单位或者个人办理投标事宜
         不同投标人的投标文件载明的项目管理成员为同一人
         不同投标人的投标文件异常一致或者投标报价呈规律性差异
         不同投标人的投标文件相互混装
         不同投标人的投标保证金从同一单位或者个人的账户转出
 
 二、禁止招标人与投标人串通投标
     有下列情形之一的，属于招标人与投标人串通投标:
         招标人在开标前开启投标文件并将有关信息泄露给其他投标人
         招标人直接或者间接向投标人泄露标底、评标委员会成员等信息
         招标人明示或者暗示投标人压低或者抬高投标报价
         招标人授意投标人撤换、修改投标文件
         招标人明示或者暗示投标人为特定投标人中标提供方便
         其他串通行为
 
 投标人以行贿手段谋取中标是一种严重的违法行为，其法律后果是中标无效
 投标人不得以他人名义投标或以其他方式弄虚作假骗取中标
 使用通过受让或者租借方式获取的资格、资质证书的，属于以他人名义投标
 */
 #pragma mark ****** 四、争议解决(异议和投诉)
/*
 
                                         投标人异议及投诉程序（四种情况两步走 其他直接投诉）
 
 对资格预审文件提出异议        提交资格预审文件截止时间2日前提出               招标人自收到异议之日起3日 内答复，答复前，暂停招投标活动
 
 对招标文件提出异议           提交投标文件截止时间10日前提出                 招标人自收到异议之日起3日 内答复，答复前，暂停招投标活动
 
 对开标提出异议              开标现场提出                                 招标人当场作答并书面记录
 
 对评标结果提出异议           中标候选人公示期间提出(2014)                  招标人自收到异议之日起3日 内答复，答复前，暂停招投标活动
 
 以上四种情况必须先向招标人提出异议，招标人不答复，或投标人对招标人答复不服的，可以向招标办投诉
 
 其他事项                   知道或应当知道之日起10日内                      直接向招标办投诉
 
 投诉人就同一事项向两个以上有权受理的行政监督部门投诉的，由最先收到投诉的行政监督部门负责处理
 
 招标人违法行为应承担的法律责任
         招标人不按照规定对异议作出答复，继续进行招标投标活动的，由有关行政监督部门责令改正，拒不改正或者不能改正并影响中标结果的，依照《条例》第八十二条的规定处理，招标、投标、中标无效，依法重新招标或者评标
 
 中标人违法行为应承担的法律责任
         【中标人无正当理由不与招标人订立合同，在签订合同时向招标人提出附加条件，不按照招标文件要求提交履约保证金的，取消其中标资格，招标保证金不予退还】
         中标人不履行与招标人订立的合同的，履约保证金不予退还，给招标人造成的损失超过履约保证金数额的，还应当对超过部分予以赔偿；没有提交履约保证金的，应当对招标人的损失承担赔偿责任。
     　　中标人不按照与招标人订立的合同履行义务，情节严重的，有关行政监督部门取消其【二至五年】参加招标项目的投标资格并予以公告，直至由工商行政管理机关吊销营业执照
 
 */
#pragma mark - ************** 建设工程发承包制度

/*
 
 一、建设工程发包的基本规定
 
         按照合同约定，建筑材料、建筑构配件和设备由工程承包单位采购的，发包单位不得指定承包单位购入用于工程的建筑材料、建筑构配件和设备被或者指定生产厂、供应商
         【由工程承包单位采购的，发包单位不得指定，若指定承包单位有权拒绝】
 
         《拖欠农民工工资问题的意见》中规定，政府投资项目一律不得以施工企业带资承包的方式进行建设，并严禁将带资承包有关内容写入工程承包合同及补充条款。
             对长期拖欠工程款结算或拖欠工程款的建设单位，有关部门不得批准其新项目开工建设。
 
 二、建设工程承包的基本规定
 
     《建筑工程施工转包违法分包等违法行为认定查处管理办法(试行)》规定存在下列情形之一的，属于建设单位违法发包：
     　　（一）建设单位将工程发包给个人的；
     　　（二）建设单位将工程发包给不具有相应资质或安全生产许可的施工单位的；
     　　（三）未履行法定发包程序，包括应当依法进行招标未招标，应当申请直接发包未申请或申请未核准的；
     　　（四）建设单位设置不合理的招投标条件，限制、排斥潜在投标人或者投标人的；
     　　（五）建设单位将一个单位工程的施工分解成若干部分发包给不同的施工总承包或专业承包单位的；
     　　（六）建设单位将施工合同范围内的单位工程或分部分项工程又另行发包的；
     　　（七）建设单位违反施工合同约定，通过各种形式要求承包单位选择其指定分包单位的；
     　　（八）法律法规规定的其他违法发包行为。
 */

#pragma mark 建设工程总承包的规定
/*
 
 总承包分为工程总承包和施工总承包两大类
 
 《建筑法》规定，建筑工程的发包单位可以将建筑工程的【勘察、设计、施工、设备采购】【一并发包】给一个工程总承包单位，也可以将建筑工程勘察、设计、施工、设备采购的【一项或者多项发包】给一个工程总承包单位。【不包括监理】
 
 
 总承包企业的资质管理
        我国对工程总承包不设专门的资质。
        凡具有工程勘察、设计或者施工总承包资质的企业都可以依法从事资质许可范围内相应等级的建设工程总承包业务。
        但是，承接施工总承包业务的，必须是取得【施工总承包资质】的企业。
        工程勘察、设计、施工企业也可以组成联合体对工程项目进行联合总承包。
 
 工程总承包单位与工程项目管理
     《指导意见》规定，工程总承包单位可以接受建设单位委托，按照合同约定承担工程项目管理业务，但不应在同一个工程项目上同时承担工程总承包和工程项目管理业务，也不应与承担工程总承包或者工程项目管理业务的另一方企业有隶属关系或者其他利害关系。
 
 
 总承包单位的责任
         建筑工程总承包单位按照总承包合同的约定对建设单位负责；
         分包单位按照分包合同的约定对总承包单位负责。
         总承包单位和分包单位就分包工程对建设单位承担连带责任。
 
         《质量条例》规定，建设工程实行总承包的，总承包单位应当对全部建设工程质量负责；
         总承包单位依法将建设工程分包给其他单位的，分包单位应当按照分包合同的约定对其分包工程的质量向总承包单位负责，总承包单位与分包单位对分包工程的质量承担连带责任。
         《民法通则》规定，负有连带义务的每个债务人，都负有清偿全部债务的义务，履行了义务的人，有权要求其他负有连带义务的人偿付他应当承担的份额
 */



#pragma mark 建设工程共同承包的规定
/*
 
 一、共同承包的适用范围
 
         【大型建筑工程或者结构复杂】的建筑工程，可以由两个以上的承包单位联合共同承包。
         共同承包的各方对承包合同的履行承担连带责任。
 
 二、共同承包的资质要求
 
         《建筑法》规定，两个以上不同资质等级的单位实行联合共同承包的，应当按照资质等级低的单位的业务许可范围承揽工程。
 
 三、共同承包的责任
        《招投标法》规定,联合体中标的,联合体各方应当共同与招标人签订合同,就中标项目向招标人承担连带责任
        《建筑法》规定，共同承包的各方对承包合同的履行承担连带责任。
 
 */

#pragma mark  建设工程分包的规定
/*
一、分包工程的范围
 
     建筑工程总承包单位可以将承包工程中的部分工程发包给具有相应资质条件的分包单位；但是，除总承包合同中约定的分包外，必须经建设单位认可。【劳务作业的分包可以不经建设单位认可】
 
     禁止承包单位将其承包的全部建筑工程转包给他人，禁止承包单位将其承包的全部建筑工程肢解以后以分包的名义分别转包给他人。
 
     施工总承包的，建筑工程主体结构的施工必须由总承包单位自行完成。
 
     总承包单位（工程总承包和施工总承包）承包工程后可以全部自行完成，也可以将其中的部分工程分包给其他承包单位完成，但依法只能是分包部分，而且是非主体、非关键性工作；如果是施工总承包，其主体结构的施工必须由总承包单位自行完成
 
 【总结】工程分包与劳务分包的区别:
 
                    工程分包                                          劳务分包
         需要建设单位认可或总承包合同约定                               不需要建设单位认可
         主体结构不得分包                                         主体结构中的劳务作业可以分包
        施工总承包(专业承包)企业可以依法将劳务作业分包给劳务分包企业      劳务分包企业不得将劳务再分包
                                相同点:分包单位应具相应有资质
 
 
二、分包单位的条件与认可

     分包工程须经建设单位认可 不等于 建设单位可以直接指定分包人。
 
     《分包管理办法》规定，严禁个人承揽分包工程业务。
     劳务作业分包可不经建设单位认可。《分包管理办法》规定，”建设单位不得直接指定分包工程承包人。
 
     对于建设单位推荐的分包单位，总承包单位有权作出拒绝或者采用的选择。
 
     分包工程承包人由总承包单位来选，但建设单位有否决权。总承包单位选择分包单位，若满足招标的规模和范围要求也应招标。
 
 三、分包单位不得再分包 （分包只能分包一次）
 
     《建筑法》规定,禁止分包单位将其承包的工程再分包。
 

 四、转包、违法分包和挂靠行为的界定
 
 【转包和挂靠的区别】
 
        发包人 发包给 承包人  【转包】给 实际施工人
        发包人 发包给 承包人  允许实际施工人【挂靠】在其名下作业
 
      《质量条例》规定,违法分包，是指下列行为:
         (1)总承包单位将建设工程分包给不具备相应资质条件的单位的;
         (2) 建设工程总承包合同中未有约定，又未经建设单位认可，承包单位将其承包的部分【建设工程】交由其他单位完成的;
         (3) 施工总承包单位将建设工程主体结构的施工分包给其他单位的;
         (4) 分包单位将其承包的建设工程再分包的。
 

     存在下列情形之一的，属于转包:
         (1) 施工单位将其承包的全部工程转给其他单位或个人施工的;
         (2) 施工总承包单位或专业承包单位将其承包的全部工程肢解以后，以分包的名义分别转给其他单位或个人施工的;
         (3) 施工总承包单位或专业承包单位未在施工现场设立项目管理机构或未派驻项目负责人、技术负贵人、质量管理负责人、安全管理负责人等主要管理人员，不履行管理义务，未对该工程的施工活动进行组织管理的(一-@未派驻一一转包; @派驻但无合同保险关系一挂靠);
         (4) 施工总承包单位或专业承包单位不履管理义务，只向实际施工单位收取费用，主要建筑材料、构配件及工程设备的采购由其他单位或个人实施的
         (5) 劳务分包单位承包的范围是施工总承包单位或专业承包单位承包的全部工程，劳务分包单位计取的是除上缴给施工总承包单位或专业承包单位“管理费”之外的全部工程价款的;
         (6) 施工总承包单位或专业承包单位通过采取合作、联营、个人承包等形式或名义，直接或变相的将其承包的全部工程转给其他单位或个人施工的;
         (7) 法律法规规定的其他转包行为。
 
     存在下列情形之一的，属于违法分包:
         (1)施工单位将工程分包给个人的;
         (2) 施工单位将工程分包给不具备相应资质或安全生产许可的单位的;
         (3) 施工合同中没有约定，又未经建设单位认可，施工单位将其承包的部分工程交由其他单位施工的;
         (4) 施工总承包单位将房屋建筑工程的主体结构的施工分包给其他单位的，钢结构工程除外（--- 钢结构工程主体结构可以分包);
         (5) 专业分包单位将其承包的专业工程中非劳务作业部分再分包的;
         (6) 劳务分包单位将其承包的劳务再分包的;
         (7) 劳务分包单位除计取劳务作业费用外，还计取主要建筑材料款、周转材料款和大中型施工机械设备费用的(一一计取的不是全部费用，否则为转包);
         (8) 法律法规规定的其他违法分包行为。
 

     存在下列情形之一的，属于挂靠:
         (1) 没有资质的单位或个人借用其他施工单位的资质承揽工程的;
         (2)有资质的施工单位相互借用资质承揽工程的，包括资质等级低的借用资质等级高的，资质等级高的借用资质等级低的，相同资质等级相互借用的;
         (3) 专业分包的发包单位不是该工程的施工总承包或专业承包单位的(一专业分包的发包单位是该工程的专业承包单位的属于违法分包)，但建设单位依约作为发包单位的除外(一专业分包的发包单位挂靠施工总承包或专业承包);
         (4) 劳务分包的发包单位不是该工程的施工总承包、专业承包单位或专业分包单位的(---劳务分包的发包单位挂靠施工总承包、专业承包单位或专业分包单位) ;
         (5)施工单位在施工现场派驻的项目负责人、技术负责人、质量管理负责人、安全管理负责人中一人以上与施工单位(一  指与建设单位签订施工合同的施工单位)没有订立劳动合同，或没有建立劳动工资或社会养老保险的（---未派驻 转包; 派驻但无合同保险关系一挂靠);
         (6)实际施工总承包单位或专业承包单位与建设单位之间没有工程款收付关系，或者工程款支付凭证上载明的单位与施工合同中载明的承包单位不一致，又不能进行合理解释并提供材料证明的;
         (7) 合同约定由施工总承包单位或专业承包单位负责采购或租赁的主要建筑材料、构配件及工程设备或租赁的施工机械设备，由其他单位或个人采购、租赁或者施工单位不能提供有关采购、租赁合同及发票等证明，又不能进行合理解释并提供材料证明的;
         (8)法律法规规定的其他挂靠行为。
 
 五、分包单位的责任
     《招投标法》规定，中标人应当就分包项目向招标人负责，接受分包的人就分包项目承担连带责任。
 
 */



#pragma mark  1Z303024 违法行为应承担的法律责任
/*
 

 [注释1] 行政处罚由轻到重: 警告并(或)限期改正-罚款-停业整顿-降低资质一吊销资质。
 [注释2] 法律责任问题，单选题，“包括”选最轻的，“不包括”选最重的; 多选题，“包括”从轻到重选1-2 个,“不包括”从重到轻选1-2 个。
 
  一、发包单位违法行为应承担的法律责任
 
     《建筑工程施工转包违法分包等违法行为认定查处管理办法(试行)》规定,建设单位违法发包，拒不整改或者整改仍达不到要求的，致使施工合同无效的，不予办理质量监督、施工许可等手续。
     对全部或部分使用国有资金的项目，同时将建设单位违法发包的行为告知其上级主管部门及纪检监察部门，并建议对建设单位直接负责的主管人员和其他直接责任人员给予相应的行政处分
 
 二、承包单位违法行为应承担的法律责任
 
     《建筑工程施工转包违法分包等违法行为认定查处管理办法(试行)》规定，对认定有转包、违法分包、挂靠、转让出借资质证书或者以其他方式允许他人以本单位的名义承揽工程等违法行为的施工单位，可依法限制其在3个月内不得参加违法行为发生地的招标投标活动、承揽新的工程项目，并对其企业资质是否满足资质标准条件进行核查，对达不到资质标准要求的限期整改，整改仍达不到要求的，资质审批机关撤回其资质证书。一一第1次，停3个月
 
     对2年内发生2次转包、违法分包、挂靠、转让出借资质证书或者以其他方式允许他人以本单位的名义承揽工程的施工单位，责令其停业整顿6个月以上，停业整顿期间，不得承搅新的工程项目。----第2次，停6个月
 
     对2年内发生3次以上转包、违法分包、挂靠、转让出借资质证书或者以其他方式允许他人以本单位的名义承揽工程的施工单位，资质审批机关降低其资质等级。一-第3次，降低资质
 
 */
#pragma mark - ************** 1Z303030 建筑市场信用体系建设

/*
 
    《建筑业企业资质管理规定》规定，建筑业企业信用档案，应当包括企业基本情况、资质、业绩、工程质量和安全、合同履约、社会投诉和违法行为等情况。
    企业的信用档案信息按照有关规定向社会公开。

    《注册建造师管理规定》中规定，注册建造师信用档案应当包括注册建造师的基本情况、业绩、良好行为、不良行为等内容。
    违法违规行为、被投诉举报处理、行政处罚等情况应当作为注册建造师的不良行为记入其信用档案。
    注册建造师信用档案信息按照有关规定向社会公示。
 
 */



#pragma mark  1Z303031 建筑市场诚信行为信息的分类
/*
 
 
 建筑市场诚信行为信息分为良好行为记录和不良行为记录两大类
 
 良好行为记录  是指受到各级建设行政主管部门和相关专业部门的奖励和表彰所形成的良好行为记录。
 不良行为记录  是指经县级以上建设行政主管部门或者委托的执法监督机构查实和行政处罚所形成的不良行为记录。
 
 */



#pragma mark  1Z303032 建筑市场施工主体不良行为记录认定标准
/*
 
 一、施工单位不良行为记录的认定标准
 
     （一)资质不良行为认定标准一一资质不良 ≥ 承揽不良
 
         (1) 未取得资质证书承揽工程的，或超越本单位资质等级承揽工程的;
         (2) 以欺骗手段取得资质证书承揽工程的;
         (3) 允许其他单位或个人以本单位名义承揽工程的(一一别人用自己的资质: 资质不良);
         (4) 未在规定期限内办理资质变更手续的;
         (5) 涂改、伪造、出借、转让《建筑业企业资质证书》的
         (6) 按照国家规定需要持证上的技术工种的作业人员未经培训、考核，未取得证书上岗，情节严重的

 
     (二)承揽业务不良行为认定标准
        (1)利用向发包单位及其工作人员行贿、提供回扣或者给予其他好处等不正当手段承揽业务的;
        (2) 相互串通投标或与招标人串通投标的，以向招标人或评标委员会成员行贿的手段谋取中标的;
        (3) 以他人名义投标或以其他方式弄虚作假，骗取中标的(一一自己用别人的资质: 承揽不良);
        (4) 不按照与招标人订立的合同履行义务，情节严重的 ;
        (5) 将承包的工程转包或违法分包的。
        【以他人名义投标(自己去承揽) 和 允许其他单位或个人以本单位名义承揽工程的（出借自己资质）】
 
     (三)工程质量不良行为认定标准
 
         (1)在施工中偷工减料的，使用不合格建筑材料、建筑构配件和设备的，或者有不按照工程设计图纸或施工技术标准施工的其他行为的;
         (2) 未按照节能设计进行施工的;
         (3) 未对建筑材料、建筑构配件、设备和商品混凝土进行检测，或未对涉及结构安全的试块、试件以及有关材料取样检测的;
         (4) 工程竣工验收后，不向建设单位出具质量保修书的，或质量保修的内容、期限违反规定的;
         (5) 不履行保修义务或者拖延履行保修义务的。
 
     (四)工程安全不良行为认定标准
 
         (1)- -(10) 略;
         (11）....，.在城市市区内的建设工程的施工现场未实行封闭围挡的;
         (12) 在尚未竣工的建筑物内设置员工集体宿舍的;
         (13）....
         (14) 未对因建设工程施工可能造成损害的毗邻建筑物、构筑物和地下管线等采取专项防护措施的;
         (15) -(19)略;
         (20)施工单位取得资质证书后，降低安全生产条件的，或经整改仍未达到与其资质等级相适应的安全生产条件的;
         (21)-(24)略。
 
     (五)拖欠工程款或工人工资不良行为认定标准
 
         恶意拖欠或克扣劳动者工资的。
 
     [注释]
     (1)以他人名义承揽工程的一一自己用别人的资质: 承揽不良。
     (2)允许其他单位以本单位名义承揽工程的一一别人用自己的资质: 资质不良。
     (3)节能、保修属于质量不良。
     (4)涉及“安全生产许可证”、“施工起重机械和整体提升脚手架、模板等自升式架设设施”均为安全不良。
 
 
 二、注册建造师不良行为记录的认定标准
    一一与施工单位不良行为记录的认定标准对比掌握
 
     《注册建造师执业管理办法(试行) 》规定，注册建造师有下列行为之一，由工程所在地建设主管部门记入注册建造师执业信用档案:
     (1)《注册建造师执业管理办法(试行)》第22 条所列行为;
     (2) 未履行注册建造师职责造成质量、安全、环境事故的;
     (3) 泄露商业秘密的;
     (4) 无正当理由拒绝或未及时签字盖章的;
     (5) 未按要求提供注册建造师信用档案信息的;
     (6) 未履行注册建造师职责造成不良社会影响的;
     (7) 未履行注册建造师职责导致项目未能及时交付使用的;
     (8) 不配合办理交接手续的;
     (9) 不积极配合有关部门监督检查的。

 */



#pragma mark  1Z303033 建筑市场诚信行为的公布和奖惩机制
/*

 一、建筑市场诚信行为的公布
 
     (一)公布的时限
 
         《建筑市场诚信行为信息管理办法》规定，【建筑市场诚信行为】记录信息的公布时间为行政处罚决定做出后7日内(--7 日内上网)，公布期限一般为6个月至3年; 良好行为记录信息公布期限一般为3年
 
         省、自治区和直辖市建设行政主管部负责审查整改结果，对整改确有实效的，由企业提出申请，经批准，可縮短其不良行为记录信息公布期限，但公布期限最短不得少于3 个月; 对于拒不整改或整改不力的单位，信息发布部门可延长其不良行为记录信息公布期限。
 
         《招标投标违法行为记录公告暂行办法》规定，国务院有关行政主管部门和省级人民政府有关行政主管部门应自【招标投标违法行为】行政处理决定作出之日起20 个工作日（----20个工作日内上网)内对外进行记录公告。违法行为记录公告期限为6个月。依法限制招标投标当事人资质等方面的行政处理决定，所认定的限制期限长于6个月的，公告期限从其决定。
 

     (二)公布的内容和范围
 
             属于《全国建筑市场各方主体不良行为记录认定标准》范围的不良行为记录除在当地发布外，还将由建设部统一一在全国公布，公布期限与地方确定的公布期限相同(1-2014)。一一其他不良行为记录的信息，省级建设行政主管部门应在本地区统一公布、
 
             招标投标违法行为记录公告不得公开(不是一律不得公开)涉及国家秘密、商业秘密、个人隐私的记录。但是，经权利人同意公开或者行政机关认为不公开可能对公共利益造成重大影响的涉及商业秘密、个人隐私的违法行为记录，可以公开。
             一一任何情况下涉及国家秘密的一律不得公开; 绝对禁止公开涉及国家秘密的记录。
 
     (三)公告的变更
 
         《建筑市场诚信行为信息管理办法》规定，对发布有误的信息，由发布该信息的省、自治区和直辖市建设行政主管部门进行修正，根据被曝光单位对不良行为的整改情况，调整其信息公布期限
         行政处罚决定经行政复议、行政诉讼以及行政执法监督被变更或被撤销，应及时变更或删除该不良记录，并在相应诚信信息平台上予以公布
 
         被公告的招标投标当事人认为公告记录与行政处理决定的相关内容不符的，可向公告部门提出书面更正申请 并提供相关证据。公告部门在作出答复前不停止对违法行为记录的公告。
         行政处理决定在被行政复议或行政诉讼期间，公告部门依法不停止对违法行为记录的公告，但行政处理决定被依法停止执行的除外。原行政处理决定被依法变更或撤销的，公告部门应当及时对公告记录予以变更或撤销，并在公告平台上予以声明。
 
 二、  建筑市场诚信行为的奖惩机制
 
     《国务院办公厅关于全面治理拖欠农民工工资问题的意见》中规定，加强对企业失信行为的部门协同监管和联合惩戒，对拖欠工资的失信企业，由有关部门依法依规予以限制，使失信企业在全国范围内“一处违法、处处受限”。
     《建筑市场诚信行为信息管理办法》规定，对于一般失信行为，要对相关单位和人员进行诚信法制教育;对有严重失信行为的企业和人员，要对其依法公布、曝光或予以行政处罚、经济制裁; 行为特别恶劣的，要坚决追究失信者的法律责任
 
 */



#pragma mark 1Z303034 建筑市场主体诚信评价的基本规定

/*


 《信用体系建设工作的意见》提出，同步推进 政府对市场主体的守法诚信评价和社会中介信用机构开展的综合信用评价。
 
 一、政府对市场主体的守法诚信评价  (官对民评价)
 
     政府对市场主体的守法诚信评价是政府主导， 以守法为基础，根据违法违规行为的行政处罚记录，对市场主体进行诚信评价。评价内容包括对市场主体违反各类【行政法律规定强制义务】的行政处罚记录以及其他不良失信行为记录。
     评价标准内容【以建筑市场有关的法律责任】为主要依据。
 
 二、社会中介信用机构的综信用评价一一（民一民评价）
 
     社会中介信用机构的综合信用评价是市场主导，【以守法、守信、守德、综合实力】为基础进行综合评价。综合评价中有关建筑市场各方责任主体的优良和不良行为记录等信息要以【建筑市场信用信息平台的记录】为基础。
 */
#pragma mark - ************** 1Z304010 建设工程合同制度

/*
    建设工程合同和劳动合同法律制度
 
        建设工程合同制度
 
 */

#pragma mark 1Z304011 合同的法律特征和订立原则
/*
 
 二、合同的订立原则
 
     (一) 平等原则
             《合同法》规定,合同当事人的法律地位平等，一方不得将自己的意志强加给另一方。
             平等原则的内容:
                 (1) 合同当事人的法律地位律平等。
                 (2) 合同中的权利义务对等。
                 (3) 合同当事人必须就合同条款充分协商，在互利互惠基础上取得一致，合同方能成立。
     (二) 自愿原则
             《合同法》规定，当事人依法享有自愿订立合同的权利，  任何单位和个人不得非法干预。
             自愿原则体现了民事活动的基本特征，是民事法律关系区别于行政法律关系、刑事法律关系的特有原则
     (三) 公平原则
             《合同法》规定，当事人应当遵循公平原则确定各方的权利和义务。
             公平原则主要包括:
                 (1) 订立合同时，要根据公平原则确定双方的权利和义务，不得欺诈，不得假借订立合同恶意进行磋商;
                 (2) 根据公平原则确定风险的合理分配;
                 (3) 根据公平原则确定违约责任。
     (四)诚实信用原则
             《合同法》规定，当事人行使权利、履行义务应当遵循诚实信用原则
             诚实信用原则主要包括:
                 (1)订立合同时，不得有欺诈或其他违背诚实信用的行为;
                 (2) 履行合同义务时，当事人应当根据合同的性质、目的和交易习惯，履行及时通知、协助、提供必要条件、防止损失扩大、保密等义务;
                 (3) 合同终止后，当事人应当根据交易习惯，履行通知、协助、保密等义务，  也称为后契约义务。
     (五)合法原则
             《合同法》规定，当事人订立、履行合同，应当遵守法律、行政法规(一一无地方性法规、部门规章等)，
             尊重社会公德，不得扰乱社会经济秩序，损害社会公共利益。

 */

#pragma mark 合同的分类
/*
        合同的分类
 
         分类 标准                         分类内容                     举例
         法律是否明文规定了合同的名称        有名合同\无名合同           合同法规定15个
         是否相互给付义务                   双务合同\单务合同       赠与、借用属单务合同
         是否需交付标的物                   诺成合同\实践合同   自然人之间借贷、定金合同属实践合同
         是否要特定形式                    要式合同\不要式合同      企业之间借贷、担保合同属要式合同
         是否存在对价关系                   有偿合同\无偿合同       赠与、借用合同属无偿合同
         相互之间主从关系                  主合同\从合同              担保合同属从合同
 
         建设工程合同属于有名、双务、有偿、诺成、要式、主合同
         建设工程合同种类:勘察、设计、施工合同(不包括监理合同)
         建设工程合同实质上是一种特殊的承揽合同
 
 例如，有偿的委托合同，因受托人的过错给委托人造成损失的，委托人可以要求赔偿损失。
 无偿的委托合同，因受托人的故意或者重大过失给委托人造成损失的，委托人可以要求赔偿损失
 【无偿的委托合同 不得要求赔偿损失 ❌】
 
 【注 1】书面形式包括 1合同书、2信件，也包括电报、电传、传真、电子数据交换和电子邮件等3数据电文形式。
 【注 2】建设工程合同、定金合同、融资租赁合同、地役权合同、保证合同、抵押合同、质押合同、全日制劳动合同等应当采用书面形式。——要式合同
 */

#pragma mark 合同订立过程（邀约和承诺）
/*
 
 
  合同订立过程
 
 《合同法》规定，当事人订立合同，采取邀约、承诺的方式。
 【邀约、承诺是合同成立的必要阶段，要约邀请不是】
 
 要约的内容须具有足以使合同成立的主要条款 （邀约和邀约邀请的最主要区别）
 
     要约邀请： (无约束力)
         寄送价目表
         拍卖公告
         招标公告、招标文件、投标邀请书
         招股说明书
         商业广告
    但商业广告的内容符合要约规定的除外
 【要约邀请没有法律约束力，要约、承诺具有法律约束力】
 
 
 要约构成要件:
         内容具体确定(到达生效;(未到达)可撤回、（未承诺前）撤销)
 
 【
    要约到达受要约人时生效，但附有生效条件的除外（投标文件进入投标有效期生效）
    合同双发签字盖章生效，但附有生效条件的除外
 】

 
 承诺的条件
         由受要约人/其代理人向要约人作出
         内容应当与要约的内容一致(实质性内容不能变更，视为新要约)
         在要约有效期内作出承诺(逾期承诺视为新邀约)
 
 承诺应当以通知的方式作出，但根据交易习惯或者要约表明可以通过行为做作出承诺的除外
 
 有关【合同标的、数量、质量、价款或者报酬、履行期限、履行地点和方式、违约责任和解决争议方法】等的变更，是对要约内容的实质性变更
 
 总结:合同的成立一般要经过要约和承诺两个阶段
 
 邀约不可撤销的情形：
         1.要约人确定了承诺期限或以其他形式明示要约不可撤销；
         2.受要约人有理由认为要约是不可撤销的，并已经为履行合同作了准备工作。
 
 【案例】成立≠订立;成立≠生效。依法成立的合同，自成立时生效。附生效条件的合同，自条件成就时生效。
 
 */

#pragma mark 1Z304013 建设工程施工合同的法定形式和内容
/*
 一、建设工程施工合同的法定形式
     《合同法》明确规定，建设工程合同应当采用书面形式。
 
 三、建设工程施工合同的内容
 
     《合同法》规定,施工合同的内容包括  1.工程范围、2建设工期、中间交工工程的开工和竣工时间、工程质量、工程造价、技术资料交付时间、材料和设备供应责任、拨款和结算、俊工验收、质量保修范围和质量保证期、双方相互协作等条款。
 */

#pragma mark 1Z304014 建设工程工期和支付价款的规定
/*
  一、建设工程工期
 
     (二) 暂停施工
         因发包人原因引起的暂停施工，发包人应承担由此增加的费用和(或)延误的工期，并支付承包人合理的利润
         因承包人原因引起的暂停施工，承包人应承担由此增加的费用和(或)延误的工期，且承包人在收到监理人复工指示84天内仍未复工的，视为“承包人明确表示或者以其行为表明不履行合同主要义务的”承包人违约的情形。
         因承包人原因引起的暫停施工,承包人在收到监理人复工指示后84天内仍未复工的，发包人可单方解除施工合同
 
     (三) 工期顺延
         因承包人原因造成工期延误的，承包人支付逾期竣工违约金后，不免除承包人继续完成工程及修补缺陷的义务。
 
     (四)竣工日期
 
     《施工合同(示范文本)》规定，实际竣工日期  一是指工程经竣工验收合格的，以承包人提交竣工验收申请报告之日为实际竣工日期，并在工程接收证书中载明; 因发包人原因，未在监理人收到承包人提交的竣工验收申请报告42 天内完成竣工验收，或完成竣工验收不予签发工程接收证书的(一一拖延验收)，以提交竣工验收申请报告为日期为实际竣工日期; 工程未经竣工验收，发包人擅自使用的，以转移占有工程之日为实际竣工日期。
         条件均发生的，以先发生者为准
 
     《解释》规定,当事人对建设工程实际竣工日期有争议的(一一无争议一按约定)，按照以下情形分别处理:
         (1) 建设工程经竣工验收合格的，以竣工验收合格之日为竣工日期;
         (2) 承包人已经提交竣工验收报告，发包人拖延验收的，以承包人提交验收报告之日为竣工日期;
         (3) 建设工程未经竣工验收，发包人擅自使的，以转移占有建设工程之日为竣工日期。
 
    竣工日期≠竣工验收合格之日，两者无必然联系，竣工日期只和工期责任划分有关。竣工日期和保修期无关。保修期从竣工验收合格之日起计算。()合格日(2)提交日(3)占有日均发生的，以先发生者为准。
     【竣工日期可以理解为施工单位完工日期，竣工验收合格之日时建设单位认可，保修期从建设单位认可之日算】

 二、工程价款的支付
 
     《合同法》规定，合同生效后，当事人就质量、价款或者报酬、履行地点等内容没有约定或者约定不明确的，可以协议补充; 不能达成补充协议的，按照合同有关条款或者交易习惯确定。
 
     如果按照合同有关条款或者交易习惯仍不能确定的，《合同法》规定,
     价格或报酬不明确的，按照订立合同时履行地的市场价格履行;
     履行期限不明确的，债务人可以随时履行，债权人也可以随时要求履行，但应当给对方必要的准备时间。一一如开工时间不明确，施工单位可以随时开工，建设单位也可以随时要求施工单位开工
 
     合同生效后，当事人就质量、价款或者报酬、履行地点等内容有约定，按约定; (2)无约定，协议补充;(3)不能达成补充协议，按照合同有关条款或者交易习惯; 按照合同有关条款或者交易习惯仍不能确定，价款或者报酬不明确的，按照订立合同时履行地的市场价格履行:履行期限不明确的，随时履行
     【约定、协议、交易习惯、其他规定】


     (一)合同价款的确定
         《建筑工程施工发包与承包计价管理办法》规定,招标人与中标人应当根据中标价订立合同。不实行招标投标的工程由发承包双方协商订立合同。
 
         实行工程量清单计价的建筑工程，鼓励发承包双方采用单价方式确定合同价款。建设规模较小、技术难度较低、工期较短的建筑工程，发承包双方可以采用总价方式确定合同价款。紧急抢险、救灾以及施工技术特别复杂的建筑工程，发承包双方可以采用成本加酬金方式确定合同价款。
 
         “黑白合同”“阴阳合同”的纠纷，《解释》规定: 当事人就同一建设工程另行订立的建设工程施工合同与经过备案的中标合同实质性内容不一致的，应当以备案的中标合同作为结算工程价款的根据。
 
         阴合同≠无效合同; 阴阳合同内容没有实质冲突的，阴合同当然也可以作为结算依据; 阴阳合同内容有实质冲突的，以备案的中标合同作为结算依据。
 
    (三)合同价款的调整
 
         《建筑工程施工发包与承包计价管理办法》中规定，发承包双方应当在合同中约定，发生下列情形时合同价款的调整方法
         (1)法律、法规、规章或者国家有关政策变化影响合同价款的:
         (2) 工程造价管理机构发布价格调整信息的;
         (3) 经批准变更设计的;
         (4 )发包方更改经审定批准的施工组织设计造成费用增加的;
         (5) 双方约定的其他因素。
 
     (四) 解决工程价款结算争议的规定
 
         1.视为发包人认可承包人的单方结算价
         《解释》规定,当事人约定，发包人收到竣工结算文件后，在约定期限内不予答复，视为认可竣工结算文件”的，按照约定处理。承包人请求按照竣工结算文件结算工程价款的，应予支持。
 
         2.对工程量有争议的工程款结算
         《解释》规定，当事人对工程量有争议的，按照施工过程中形成的签证等书面文件确认。承包人能够证明发包人同意其施工，但未能提供签证文件证明工程量发生的，可以按照当事人提供的其他证据确认实际发生的工程量。  -签证一其他证据(有签证按签证，无签证按其他证据)
         3.欠付工程款的利息支付
 */

*/

#pragma mark 1Z304015 建设工程赔偿损失的规定
/*

 一、赔偿损失概念和特征
 
     赔偿损失具有以下特征:
     (1) 赔偿损失是合同违约方违反合同义务所产生的责任形式。
     (2) 赔偿损失具有补偿性(≠惩罚性).
     (3) 赔偿损失具有一定的任意性。
     (4) 赔偿损失以赔偿非违约方实际遭受的全部损害为原则。
 
 二、承担赔偿损失责任的构成要件
 
     承担赔偿损失责任的构成要件是:
     (1) 具有违约行为;
     (2) 造成损失后果;
     (3) 违约行为与财产等损失之间有因果关系;
     (4) 违约人有过错，或者虽无过错，但法律规定应当赔偿。
 
 三、赔偿损失的范围一一填平损失
 
     赔偿损失范围包括直接损失和间接损失(一一但损害不可预见的不赔偿)。
     直接损失是指财产上的直接减少。
     间接损失，是指失去的可以预期取得的利益，是指利润而不是营业额。
 
 四、约定赔偿损失与法定赔偿损失
 
     《合同法》规定,当事人可以约定一方违约时应当根据违约情况向对方支付一定数额的违约金，也可以约定因违约产生的损失赔偿额的计算方法。-  如竣工验收不合格，违约金50 万元; 拖延工期一天违约金2000 元。
 
     约定的违约金低于造成的损失的，当事人可以请求人民法院或者仲裁机构予以增加; 约定的违约金过分高于造成的损失的，当事人可以请求人民法院或者仲裁机构予以适当减少。
 
     原则上约定赔偿损失优先于法定赔偿损失。作为约定赔偿损失，一旦发生违约并造成损害以后，受害人不必证明其具体损害范围即可依约获得赔偿。
 
 五、赔偿损失的限制一一不能填平损失一一重点
 
     (一)赔偿损失的可预见性原则一一损害结果与违约行为之间应具有因果关系，否则不赔偿
 
         《合同法》规定，当事人一方不履行合同义务或者履行合同义务不符合约定，给对方造成损失的，损失赔偿额应当相当于因违约所造成的损失，包括合同履行后可以获得的利益，但不得超过违反合同一方订立合同时或者应当预见到的违反合同可能造成的损失。一一损害不可预见的不赔偿(损害不可预见=无因果关系)
 
     (二)采取措施防止损失的扩大
 
         《合同法》规定，当事人一方违约后，对方应当采取适当措施防止损失的扩大; 没有采取适当措施致使损失扩大的，不得就扩大的损失要求赔偿(一-扩大的损失由非违约方承担)。当事人因防止损失扩大而支出的合理费用，由违约方承担(一  合理费用由违约方承担)。
         对于当事人一方违反合同的，另一方不能任凭损失的扩大，在接到对方的通知后，应当及时采取措施防止损失扩大，即使没有接到对方通知，也应当采取适当措施。
 */
#pragma mark  欠付工程款和垫资处理
/*
 欠付工程款和垫资处理不同。
    （已同情无过错一方为原则，欠付，施工单位无过错，垫资（住建部明文要求不要垫资），属不听劝阻，不同情）
 【垫资是有效的 不是禁止的】
 
     欠付工程款 约定利息超过人行同期【贷款】利率，按约定予以支持；未约定，则按人行同期存款利率；【有约定按约定，上不封顶，无约定，按贷款利率】
     垫资 约定利息超过人行同期贷款利率，超过部分不予以支持；未约定，不付利息；【有约定按约定，最高贷款利率，无约定，不支付】
 
     利息从应付工程价款之日(约定之日) 计付。
     当事人对付款时间没有约定或者约定不明的，下列时间视为应付款时间 :
     (1) 建设工程已实际交付的，为交付之日;
     (2) 建设工程没有交付的，为提交竣工结算文件之日;
     (3) 建设工程未交付，工程价款也未结算的，为当事人起诉之日。
     “应付工程价款之日”有约定按约定; 无约定，按照上述(1)交付日-(2)提交日(3)起诉日规定。

 【垫资 ≠ 工程欠款  垫资利息 ≠ 工程欠款利息    】
 
 承包人工程价款优先受偿权(工程拍卖/折价所得)(合同法及司法解释)
     优于抵押权和其他债权
     不得对抗房屋买受人(消费者购房款（自住的、不包括购房用于出租的） 购房者支付全款或大部分款项)
     房屋买受人 > 承包人工程价款 > 抵押权 > 其他债权
     承包人工程价款包括人员报酬、材料款等实际支付费用和垫资，不包括因发包人违约造成的损失 （
         实际支付的部分优先受偿，利息及违约金、质保金和损失不优先受偿）
     优先权期限为6个月，自工程竣工验收之日或合同约定竣工之日起计算【注意和利息的计算时间比较】
 
 */

#pragma mark 1Z304016 无效合同和效力待定合同的规定
#pragma mark 合同生效要具备的条件

/*
合同生效要具备的条件
     当事人具有相应的民事行为能力(主体合格)
     意思表示真实
     不违反法律、行政法规强制性规定或社会公共利益(内容合法)
     具备法律所要求的形式(形式合法)
 
 内容、形式不合法:无效
 主体不合格:待定
 意思表示不真实:可变更、可撤销
 
 
 */

#pragma mark 无效合同

/*
 无效合同的规定(欠缺合法性要件)
 
 无效合同的类型
 
     一方以欺诈、胁迫的手段订立合同，损害国家利益;【不损害国家利益，是可变更、可撤销合同】
     恶意串通，损害国家、集体或者第三人利益;
     以合法形式掩盖非法目的;【逃税】
     损害社会公共利益;
     违反法律、行政法规的强制性规定。
 
 《合同法》规定，合同中的下列免责条款无效
     造成对方人身伤害的
     因故意或者重大过失造成对方财产损失的
 
 (一一违反地方法规、部门规章、地方政府规章不一定无效。如垫资施工合同违反建设部出台的部门规章，但有效一一只有法律、行政法规可规定交易禁区)
 
 
 建设工程无效施工合同的情形
     承包人未取得资质或超越资质
     承包人借用资质
     工程必须招标而未招标或者中标无效
     承包人非法转包、违法分包
 
 无效合同的法律后果
     自始没有法律约束力(签订合同时)
     合同无效不影响合同独立存在的有关争议解决方法条款的效力
 
 法律责任:
     返还财产，不能返还的折价补偿;有过错的一方，应赔偿损失
 
 无效施工合同的工程款结算
     工程竣工验收合格的，应按约定支付承包人工程价款
     修复后工程竣工验收合格的，承包人承担修复费用，应按约定支付承包人工程价款
     修复后工程竣工验收不合格的，不支付承包人工程价款
 
 */

#pragma mark 效力待定合同

/*
 效力待定合同规定(主体不合格)
 
  效力待定合同
     限制民事行为能力人订立的合同(纯获利益或智力相当除外)
     无权代理合同(无代理权、超越代理权或代理权终止)
     无处分权的人处分他人财产的合同(租赁、保管、运输、承揽)
 
 1限制民事行为能力人订立的合同相对人可催告法定代理人在1个月内追认，未最追认表示拒绝;善意相对人有撤销权;
 2无权代理合同，相对人可催告被代理人在1个月内追认，未做表示视为拒绝;被追认之前，善意相对人有撤销权;
 3无权订立合同事后取得处分权或经权利人追认，合同有效
 
 【自己的物品 一物二卖 ：第三人知情 合同无效 ； 不知情 有效】
 【把别人的东西卖掉 ： 不损害别人利益 效力待定 ； 损害 属于串通 无效】
 */

#pragma mark 可撤销合同(法院或仲裁机构撤销)

/*
 【注意这里的撤销不是解除  】
 
 可撤销合同(法院或仲裁机构撤销)
     因重大误解订立的合同(大意、缺乏经验或信息不通)
     在订立合同时,显失公平的合同(价值过于悬殊)
     一方采用欺诈、胁迫手段或乘人之危订立的合同
 
 此时只有受害方可以在一年内行使撤销权，只能请求法院或仲裁机构撤销
 注意:欺诈、胁迫损害国家利益无效
 
 当事人请求变更的，人民法院或者仲裁机构不得撤销
 
 
 撤销权消灭情形:
     撤销权一年内没行使的;
     知道事由后明确表示或以自己的行为放弃撤销权
 撤销的法律后果:自始无效(签合同时)
 
 */

#pragma mark 合同的履行、变更、转让、撤销和终止

/*
 合同的履行、变更、转让、撤销和终止
 
 合同的履行
     合同生效后，当事人不得以主体姓名、名称、法定代表人、负责人、承办人变更而不履行合同义务
 
 合同变更
     应双方协商一致且遵循法定程序
     变更内容约定不明视为合同未变更
 
 合同权利的转让
     不得转让的权利:
         根据合同性质不得转让(如人身性质);
         当事人约定不得转让;
         法律规定不得转让(建设工程合同、监理合同)
     应通知债务人，未经通知，该转让对债务人不发生效力（转让通知到达债务人时生效）
 
     债务人对原债权人的抗辩可以向新债权人主张

     与债权有关的从权利(如担保权利)随之转移，但专属于债权人自身的除外(人身损害赔 ，如军人退役补贴、残疾人补贴)
 
 
 合同义务的转让
     需征得债权人同意，未经债权人同意，债务人转移合同义务的行为对债权人不发生效力
 
 合同中权利和义务一并转让(如采购合同更换当事人)
     当事人一方经对方同意，可以将自己在合同中的权利和义务一并转让给第三人【未经同意该转让行为无效】
 
 
 
 
 合同的终止
 
     合同终止的原因:履行、解除、抵销、提存、混同(同归一人)、免除
 
    合同解除
 
        (一)合同解除的特征
                 合同解除具有如下特征:
                 (1) 合同的解除适用于合法有效的合同，而无效合同、可撤销合同不发生合同解除
                 (2) 合同解除须具备法律规定的条件;
                 (3) 合同解除须有解除的行为;
                 (4) 合同解除使合同关系自始消灭或者向将来消灭，可视为当事人之间未发生合同关系，或者合同尚存的权利义务不再履行。
        合同解除的分类
            约定解除:协商一致
            法定解除:一方通知到达对方(异议期限，有约定按约定，无约定，最长3月内异议)（无需对方同意）
        法定解除条件
             (1)因不可抗力致使不能实现合同目的;
             (2)在履行期限届满之前，当事人一方明确表示或者以自己的行为表明不履行主要债务;
             (3)当事人一方迟延履行主要债务，经催告后在合理期限内仍未履行;
             (4)当事人一方迟延履行债务或其他违约行为致使不能实现合同目的
        解除的法律后果
             合同权利义务中止不影响合同中结算、清理条款和独立存在的解决争议方法的效力
 
 施工合同的解除(司法解释)
     发包人解除合同:
         承包人不履行合同主要义务;
         约定期限内未完工，催告合理期限仍未完工;【仅仅是约定期限没有完工的不能解除】
         工程质量不合格，且拒绝修复;
         非法转包、违法分包
     承包人解除合同（符合下列条件且致使无法施工的，且催告后仍不履行义务的）:
         未按约定支付工程价款;
         提供的主要建筑材料、构配件和设备不符合强制性标准;
         不履行合同约定的协助义务
     解除法律后果:
         工程竣工验收合格的，应按约定支付承包人工程价款
         修复后工程竣工验收合格的，承包人承担修复费用
         修复后工程竣工验收不合格的，不支付承包人工程价款
 
 
 */

#pragma mark 违约责任及违约责任的免除

/*
 
 二、  当事人承担违约责任应具备的条件  承担违约责任 ≠ 承担赔偿损失责任
 
 《合同法》规定，  当事人一方明确表示或者以自己的行为表明不履行合同义务的，对方可以在履行期限届满之前要求其承担违约责任。
 
 承担违约责任，首先是合同当事人发生了违约行为，  即有违反合同义务的行为; 其次，非违约方只需证明违约方的行为不符合合同约定，便可以要求其承担违约责任，而不需要证明其主观上是否具有过错; 第三，违约方若想免于承担违约责任，必须举证证明其存在法定的或约定的免责事由，而法定免责事由主要限于不可抗力，约定的免责事由主要是合同中的免责条款。
 
 
 违约责任及违约责任的免除
 
 
 承担违约责任的种类
     法定责任:
         继续履行、采取补救措施、赔偿损失、停止违约行为
     约定责任:
         支付违约金或定金
 
 违约金和定金
     违约金低于造成的损失时，可请求法院或仲裁机构增加
     违约金过分高于造成的损失时，可请求法院或仲裁机构予以适当减少
 定金罚则(双倍返还)
 
 既约定违约金，又约定定金的，对方可选择其中一条款，但不能同时适用
 
 违约责任的免除
     不可抗力为违约方免除违约责任的法定事由
     不可抗力引起的损失由自己承担
     当事人迟延履行后发生不可抗力的，不能免除责任
     一方因发生不可抗力不能履行合同时，负有通知对方，并在合理期限内提供证明的责任
 
 
 建设工程合同示范文本
 《施工合同(示范文本)》内容:合同协议书、通用合同条款和专用合同条款
 
 法律地位:参考作用，无法律强制性
 
 */
#pragma mark - ************** 1Z304020 劳动合同及劳动关系制度

#pragma mark 1Z304021 劳动合同订立的规定
/*
 
 一、订立劳动合同应当遵守的原则一一劳动合同由《劳动合同法》
 
 用人单位招用劳动者，不得要求劳动者提供担保或者以其他名义向劳动者收取财物; 不得扣押劳动者的居民身份证或者其他证件  -劳动合同禁止一切担保
 
 二、劳动合同的种类
 
     (一)固定期限劳动合同一一约定合同终止时间的劳动合同
 
         超过两次签订固定期限的劳动合同，在劳动者没有《劳动合同法》第39 条和第40 条第1项、第2 项规定(-过错) 的情形，且劳动者本人又没有提出订立固定期限劳动合同的，用人单位就应当与劳动者签订无固定期限劳动合同
     (二)无固定期限劳动合同一一约定无确定终止时间的劳动合同一一无固定期限 ≠ 无期限一一终身合同(1-2015)
         有下列情形之一，劳动者提出或者同意续订、订立劳动合同的，除劳动者提出订立固定期限劳动合同外，应当订立无固定期限劳动合同(一一劳动者有权要求签订无固定期限劳动合同):
         (1) 劳动者在该用人单位连续工作满10 年的;
         (2) 用人单位初次实行劳动合同制度或者国有企业改制重新订立劳动合同时，劳动者在该用人单位连续工作满10年且距法定退休年龄不足10年的;
         (3) 连续订立2次固定期限劳动合同，且劳动者无过错的，续订劳动合同的  2+10(双10规则)
 
         《劳动合同法》规定,用人单位自用工之日起满1年不与劳动者订立书面劳动合同的，则视为用人单位与劳动者已订立无固定期限劳动合同
 
     (三)以完成一定工作任务为期限的劳动合同一一约定以某项工作的完成为合同期限的劳动合同一劳动合同期限: 开工日一竣工日
 
 
 三、劳动合同的基本条款
 
     劳动合同应当具备(=应当约定)以下条款:
     (1) 用人单位的名称、住所和法定代表人或者主要负责人;
     (2)劳动者的姓名、住址和居民身份证或者其他有效身份证件号码;
     (3) 劳动合同期限( ≠ 试用期);
     (4) 工作内容和工作地点;
     (5)工作时间和休息休假;
     (6) 劳动报酬(≠ 福利待遇);
     (7) 社会保险(≠补充保险);
     (8)劳动保护、劳动条件和职业危害防护;
     (9) 法律、法规规定应当纳入劳动合同的其他事项。
 
     劳动合同除上述规定的必备条款外，用人单位与劳动者可以约定(=可以不约定)试用期、培训、保守秘密、补充保险和福利待遇等其他事项。
 
四、订立劳动合同应当注意的事项
 
 (一) 建立劳动关系即应订立劳动合同  劳动合同是实践合同
 
     用人单位自用工之日起即与劳动者建立劳动关系(一一用工之日 ≠ 签订劳动合同之日)。
     《劳动合同法》规定，建立劳动关系，应当订立书面劳动合同。
     已建立劳动关系，未同时订立书面劳动合同的，应当自用工之日起1个月内(一-宽限期) 订立书面劳动合同(1-2014)。（满一年未订立视为订立无固定期限劳动合同）
     用人单位与劳动者在用工前订立劳动合同的，劳动关系用工之日起建立(2-2013)。
 
 (二)劳动报酬和试用期
 
     劳动合同对劳动报酬和劳动条件等标准约定不明确， 引发争议的，用人单位与劳动者可以重新协商; 协商不成的，适用集体合同规定; 没有集体合同或者集体合同未规定劳动报酬的，实行同工同酬; 没有集体合同或者集体合同未规定劳动条件等标准的，适用国家有关规定。
 [注释]
     劳动报酬约定不明一重新协商一集体合同一同工同酬
     劳动条件约定不明一重新协商一集体合同一国国家规定
 
     劳动合同期限3个月以上不满1年的，试用期不得超过1个月;
     劳动合同期限1年以上不满3年的，试用期不得超过2个月;
     3年以上固定期限和无固定期限的劳动合同，试用期不得超过6个月
 
     同一用人单位与同一劳动者只能约定1次试用期(一  -续签合同不得约定试用期)。
     以完成一定工作任务为期限的劳动合同或者劳动合同期限不满3个月的，不得约定试用期。
     试用期包含在劳动合同期限内。
     劳动合同仅终定试用期的，试用期不成立，该期限为劳动合同期限
 
 
 试用期                <1个月        <2个月              <6个月
 劳动合同期限  3个月            1年           3 年
 

 劳动者在试用期的工资不得低于{(a)本单位相同岗位最低档工资或者(b)劳动合同约定工资(转正工资）}的80%（满足其一即可) (2-2014)，并不得低于用人单位所在地的(c)最低工资标准  试用期工资最低为最低标准和80%中较大值)。
 
  max(0.8a ||0.8b,c)
 
     用人单位在试用期解除劳动合同的，应当向劳动者说明理由。
 

     (三)劳动合同的生效与无效
 
     劳动合同由用人单位与劳动者协商一致，并经用人单位与劳动者在劳动合同文本上签字或者盖章生效。
     双方当事人签字或者盖章时间不一致的，以最后一方签字或者盖章的时间为准;
     如果一方没有写签字时间，则另一方写明的签字时间就是合同生效时间。
 
     《劳动合同法》规定,下列劳动合同无效或者部分无效(2-2015-2016):
     (1)以【欺诈、胁迫】的手段或者【乘人之危】，使对方在违背真实意思的情况下订立或者变更劳动合同的;【没有重大误解】
     (2)用人单位免除自己的法定责任、排除劳动者权利的;
     (3) 违反法律、行政法规强性规定的。
     劳动合同部分无效，不影响其他部分效力的，其他部分仍然有效。
     劳动合同被确认无效，劳动者已付出劳动的，用人单位应当向劳动者支付劳动报酬。劳动报酬的数额，参照本单位相同或者相近岗位劳动者的劳动报酬确定。
 
 
     对劳动合同的无效或者部分无效有争议的，由劳动争议仲裁机构或者人民法院确认。
 
 五、集体合同
 
     集体合同由工会代表企业职工一方与用人单位订立。
 
     劳动行政部门自收到集体合同文本之日起15日内未提出异议的，集体合同即行生效。
 
 */

#pragma mark 1Z304022 劳动合同的履行、变更、解除和终止
/*
 
 劳动合同的履行和变更
 
     (一)用人单位应当履行向劳动者支付劳动报酬的义务
 
         劳动报酬通常包括三个部分:
             (1) 货币工资，包括各种工资、奖金、津贴、补贴等;
             (2) 实物报酬:
             (3) 社会保险。
 
         劳动报酬的支付要遵守国家的有关规定:
            (1) 用人单位支付劳动者的工资不得低于当地的最低工资标准;
            (2)工资（ 一工资==货币工资 ≠ 劳动报酬)应当以货币形式按月支付劳动者本人，即不得以实物或有价证券等形式代替货币支付;
            (3) 用人单位应当依法向劳动者支付加班费;
            (4) 劳动者在法定休假日、探亲假期间、产假期间和依法参加社会活动期间 以及非因劳动者原因停工期用人单位应当依法支付工资。
 

         用人单位拖欠或者未足额支付劳动报酬的，劳动者可以依法向当地人民法院申请支付令，人民法院应当依法发出支付令。【不是起诉】
 
     (三)劳动者有权拒绝违章指挥、冒险作业  不视为违反劳动合同
     (四)用人单位发生变动不影响劳动合同的履行
 
         用人单位如果变更名称、法定代表人、主要负责人或者投资人等事项，不影响劳动合同的履行。一一换名称换老板，不属于劳动合同变更，不影响劳动合同的履行
 
         用人单位发生合并或者分立等情况，原劳动合同继续有效，劳动合同由承继其权利和义务的用人单位继续履行。一一破产劳动合同失效
 
 二、劳动合同的解除和终止一一解除(即提前终止)一一未到期; 终止一一到期  必考点
 
     劳动合同的解除：
            劳动者辞职：
                    单位无过错   提前通知解除      无经济补偿
                    单位有过错
                            一般       随时通知解除      有经济补偿
                            重大       无通知解除        有经济补偿
 
            单位辞退
                    劳动者无过错       提前通知解除        有经济补偿
                    经济性裁员(无过错)  提前通知解除     进行重整的，有经济补偿
                    劳动者有过错      随时通知解除          无经济补偿
 
            协商解除
                    劳动者先提出          无经济补偿
                    用人单位先提出        有经济补偿
 
     劳动合同的解除，可分为协商解除、法定解除和约定解除三种情况。
 
     (一)劳动者可以单方解除劳动合同的规定一劳动者辞职自由
 
         [注释] 单方解除包括: 法定解除和约定解除;
         单方解除-只须通知对方，不须对方同意;
 
         劳动者提前30日以书面形式通知用人单位，可以解除劳动合同。劳动者在试用期内提前3日(一一口头或书面)通知用人单位，可以解除劳动合同。一提前通知解除~-单位无过错
         《劳动合同法》第38 条规定，用人单位有下列情形之一的，劳动者可以解除劳动合同(随时通知解除一单位有过错一一有经济补偿):
             (1) 未按照劳动合同约定提供劳动保护或者劳动条件的;
             (2) 未及时足额支付劳动报酬的;
             (3) 未依法为劳动者缴纳社会保险费的;
             (4) 用人单位的规章制度违反法律、法规的规定，损害劳动者权益的;
             (5) 因《劳动合同法》第26 条第1款规定的情形(欺诈、胁迫或者乘人之危)致使劳动合同无效的;
             (6) 法律、行政法规规定劳动者可以解除劳动合同的其他情形。
 
         用人单位以暴力、威胁或者非法限制人身自由的手段强迫劳动者劳动的，或者用人单位违章指挥、强令冒险作业【危及劳动者人身安全】的，劳动者可以立即解除劳动合同，不需事先告知用人单位。一一无通知解 -单位有 重大过错有经济补偿
 
 
     (二)用人单位可以单方解除劳动合同的规定一一用人单位非法定事由不得辞退劳动者
 
     《劳动合同法》第39 条规定,劳动者有下列情形之一的，用人单位可以解除劳动合同(随时通知解除一劳动者有过错) :
     (1) 在试用期间被证明不符合录用条件的;
     (2) 严重违反用人单位的规章制度的;
     (3) 严重失职，营私舞弊，给用人单位造成重大损害的;一-3 个条件应同时具备:
     (4) 劳动者同时与其他用人单位建立劳动关系，对完成本单位的工作任务造成严重影响，或者经用人单位提出，拒不改正的;
     (5) 因《劳动合同法》第26 条第1款第1项规定的情形(欺诈、胁迫或者乘人之危)致使劳动合同无效的;
     (6) 被依法追究刑事责任的。
 

     《劳动合同法》第40 条规定,有下列情形之一的，用人单位提前30 日以书面形式通知劳动者本人或者额外支付劳动者1个月工资(一代通知金)后，可以解除劳动合同(提前通知解除  劳动者无过错(劳动者自身原因导致能力不济)  -有经济补偿):
     (1) 劳动者患病或者非因工负伤，在规定的医疗期满后不能从事原工作，也不能从事由用人单位另行安排的工作的;
     (2) 劳动者不能胜任工作，经过培训或者调整工作岗位，仍不能胜任工作的;
     (3) 劳动合同订立时所依据的客观情况发生重大变化，致使劳动合同无法履行，经用人单位与劳动者协商，未能就变更劳动合同内容达成协议的。
 
     (三)用人单位经济性裁员的规定(1-2013)一必考点经济性裁员仍属用人单位单方解除劳动合同。
         有下列情形之一，需要裁减人员20 人以上或者裁减不足20 人但占企业职工总数10%以上的，用人单位提前30 日向工会或者全体职工说明情况，听取工会或者职工的意见后，裁减人员方案经向劳动行政部门报告，可以裁减人员(提前通知解除一一劳动者无过错(企业自身原因导致能力不济，不得不裁  破产 重整、经 :营严重困难、转产、经济情况重大变化)):
         (1)依照企业破产法规定进行重整的  -有经济补偿;
         (2)生产经营发生严重困难的;
         (3) 企业转产、重大技术革新或者经营方式调整，经变更劳动合同后，仍需裁减人员的;
         (4) 其他因劳动合同订立时所依据的客观经济情况发生重大变化，致使劳动合同无法履行的。

         裁减人员时，应当优先留用下列三种人员:
         (1) 与本单位订立较长期限的固定期限劳动合同的:
         (2) 与本单位订立无固定期限劳动合同的;
         (3) 家庭无其他就业人员，有需要扶养的老人或者未成年人的。(一先裁临时工，再裁老单身)。
         用人单位在6 个月内重新招用人员的，应当通知被裁减的人员，并在同等条件下优先招用被裁减人员。
 
     (四)用人单位不得解除(一一不得提前通知解除、不得经济性裁员)劳动合同的规定  一 不 得 解 除一一 极度弱势; 优先留用一一并不弱势
 
         《劳动合同法》第42 条规定,劳动者有下列情形之一的，用人单位不得依照该法第40 条、第41条的规定解除劳动合同(一-@处于特殊时期的@工伤职业病丧失劳动能力的一  -劳动者极度弱势) :
         (1)从事接触职业病危害作业的劳动者  ，或者疑似职业病病人在诊断或者医学观察期间的;
         (2) 在本单位患职业病或者因工负伤并被确认丧失或者部分丧失劳动能力的;
         (3) 患病或者非因工负伤，在规定的医疗期内的;
         (4) 女职  在孕期、产期、哺乳期的;
         (5) 在本单位连续工作满15年，且距法定退休年龄不足5年的;
         (6) 法律、行政法规规定的其他情形。一-劳动合同期满时，应当继续延续至相应的情形消失时才能终止，工伤除外。
 

     用人单位违反《劳动合同法》规定解除或者终止劳动合同，劳动者不要求继续履行劳动合同的，用人单位应当依法向劳动者支付赔偿金。赔偿金标准为经济补偿标准的2倍。
 
     合法解除\终止  补偿
     违法解除\终止一一赔偿=补偿X2
     【注释】
        随时通知解除  优先于     不得解除     优先于     提前通知解除
                                                   经济性裁员
      (五)劳动合同的终止
 
         《劳动合同法》第44 条规定，有下列情形之一的，劳动合同终止:
             (1)劳动合同期满的;
             (2) 劳动者开始依法享受基本养老保险待遇的;
             (3)劳动者死亡，或者被人民法院宣告死亡或者宣告失踪的;
             (4) 用人单位被依法宣告破产的;
             (5) 用人单位被吊销营业执照、责令关闭、撤销或者用人单位决定提前解散的;
             (6)法律、行政法规规定的其他情形。
 

         在劳动合同期满时，有《劳动合同法》第42 条规定的情形之一的，劳动合同应当继续延续至相应的情形消失时才能终止。但是，在本单位患有职业病或者因工负伤并被确认丧失或者部分丧失劳动能力的劳动者的劳动合同的终止，按照国家有关工伤保险的规定执行。一一第42 条(2) 工伤除外
 
         《工伤保险条例》规定(注: 工伤1级最重，10级最轻):
         (1) 职工因工致残被鉴定为1级至4级伤残的，即丧失劳动能力的，保留劳动关系  退出工作岗位。
         (2) 劳动者因工致残被鉴定为5级、6级伤残的，即大部分丧失劳动能力的，保留与用人单位的劳动关系  由用人单位安排适当工作; 也可以经工伤职工本人提出，该职工可以与用人单位解除或者终止劳动关系。
         (3) 职工因工致残被鉴定为7 级至10 级伤残的，即部分丧失劳动能力的，劳动合同期满终止
 
     (六)终止劳动合同的经济补偿
 
         有下列情形之一的，用人单位应当向劳动者支付经济补偿:
            (1)劳动者随时通知解除和无通知解除一一单位有过错;
            (2) 用人单位向劳动者提出解除劳动合同并与劳动者协商一致解除劳动合同的; 一用人单位提出【与劳动者协商一致解除劳动合同的 无法确定谁提出 不能确定是否支付】
            (3) 用人单位提前通知解除  劳动者无过错，能力不济;
            (4) 用人单位经济性裁员: 依照企业破产法规定进行重整的;
            (5) 有下列情形之一的，劳动合同终止:
                    劳动合同期满的(除用人单位维持或者提高劳动合同约定条件续订劳动合同，劳动者不同意续订的情形外);
                    用人单位被依法宣告破产的;
                    用人单位被吊销营业执照、责令关闭、撤销或者用人单位决定提前解散的。

     经济补偿的标准，按劳动者在本单位工作的年限，每满1年支付1个月工资的标准向劳动者支付。6 个月含6个月以上不满1年的，按1年计算; 不满6 个月的，向劳动者支付半个月工资的经济补偿。一一如，工作的年限13个月，应支付1.5个月工资。
 
     月工资是指劳动者在劳动合同解除或者终止前12个月的平均工资。
 
     劳动者月工资高于用人单位所在直辖市、设区的市级人民政府公布的本地区上年度职工月平均工资3 倍的，向其支付经济补偿的标准按职工月平均工资3倍的数额支付，向其支付经济补偿的年限最高不超过12 年。一一高收入者双限(限平均工资3 倍，限12 年)一一双限不适用普通劳动者
 
 */

#pragma mark 1Z304023 合法用工方式与违法用工模式的规定
/*
 
 二、劳务派遣
 
     劳务派遣单位与劳动者订立劳动合同; 劳务派遣单位与用工单位订立的劳务派遣协议。派遣单位向劳动者支付工资、福利及社会保险费用。劳务派遣显著特征是劳动者的聘用与使用分离。
 
     (一) 劳务派遣单位
 
         经营劳务派遣业务,应当向【劳动行政部门依法申请行政许可】;经许可的,依法办理相应的公司登记。劳务派遣用工是补充形式，只能在【临时性、辅助性或者替代性】的工作岗位上实施(一一项目经理、专职安全员等均不适用劳务派遣)。
 
         《劳务派遣暂行规定》规定，临时性工作岗位是指存续时间【不超过6个月】的岗位(1-2016); 辅助性工作岗位是指为主营业务岗位提供服务的非主营业务岗位; 替代性工作岗位是指用工单位的劳动者因脱产学习休假等原因无法工作的一定期间内，可以由其他劳动者替代工作的岗位。
 
     (二)劳动合同与劳务派遣协议
 
         劳务派遣单位应当与被派遣劳动者订立【2年以上】的固定期限劳动合同，按月支付劳动报酬
 
         劳务派遣单位应当将劳务派遣协议的内容告知被派遣劳动者。劳务派遣单位不得克扣用工单位按照劳务派遣协议支付给被派遣劳动者的劳动报酬。劳务派遣单位和用工单位不得向被派遣劳动者收取费用。
 
     (三)被派遣劳动者(1-2015)
         《劳动合同法》规定，被派遣劳动者享有与用工单位( # 用人单位 ≠ 派遣单位)的劳动者同工同酬的权利
 
     (四)用工单位
         用工单位不得将被派遣劳动者再派遣到其他用人单位(2-2017)。
         《劳务派遣暂行规定》规定，被派遣劳动者在用工单位因工作遭受事故伤害的，劳务派遣单位，应当依法申请工伤认定，用工单位应当协助工伤认定的调查核实工作。劳务派遣单位承担工伤保险责任，但可以与用工单位约定补偿办法。
         被派遣劳动者退回后在无工作期间，劳务派遣单位应当按照不低于所在地人民政府规定的最低工资标准向其按月支付报酬。
 
 三、加强和完善建筑劳务管理
 
     施工总承包、专业承包企业应拥有一定数量的与其建立稳定劳动关系的骨干技术工，或拥有独资或控股的施工劳务企业，组织自有劳务人员完成劳务作业; 也可以将劳务作业分包给具有施工劳务资质的企业; 还可以将部分临时性、辅助性或者替代性的工作使用劳务派遣人员完成作业。
 
     施工总承包企业和分包企业应将经农民工本人签字确认的工资支付书面记录保存两年以上备查。
 
     建筑施工企业应与自有劳务人员依法签订书面劳动合同，办理工伤、医疗或综合保险等社会保险，并按劳动合同约定及时将工资直接发放给劳务人员本人。
 
 四、改革工程建设领域用工方式
 
     施工总承包企业负责在施工现场醒目位置设立维权信息告示牌，明示业主单位、施工总承包企业及所在项目部、分包企业、行业监管部门等基本信息; 明示劳动用工相关法律法规、当地最低工资标准、工资支付日期等信息; 明示属地行业监管部门投诉举报电话和劳动争议调解仲裁、劳动保障监察投诉举报电话等信息，实现所有施工场地全覆盖。
 
 */

#pragma mark 1Z304024 劳动保护的规定
/*
 
     一、劳动者的工作时间和休息休假
 
     (一)工作时间
 
         《劳动法》规定,国家实行劳动者每日工作时间不超过8小时、平均每周工作时间不超过44小时的工时制度。
         用人单位应当保证劳动者每周至少休息1日。
 
     (二)休息休假
 
         劳动者连续工作1年( ≠ 连续在同一单位工作1年) 以上的，享受带薪年休假。
 
         用人单位由于生产经营需要，经与工会和劳动者协商可以延长工作时间，一般每日不得超过1小时: 因特殊原因需要延长工作时间的，每日不得超过3小时，但是每月不得超过36 小时。在发生自然灾害、事故或者其他原因，威胁劳动者生命健康和财产安全需要紧急处理,或者生产设备、交通运输线路、公共设施发生故障，影响生产和公众利益，必须及时抢修等法律、行政法规规定的特殊情况的，延长工作时间不受上述限制。
 
         用人单位应当按照下列标准支付高于劳动者正常工作时间工资的工资报酬: 安排劳动者延长工作时间的，支付不低于工资的150%的工资报酬; 休息日(一一周六日) 安排劳动者工作又不能安排补休的，支付不低于工资的200%的工资报酬; 法定休假日(一国庆、春节等)安排劳动者工作的，支付不低于300%的工资报酬。
 

 二、劳动者的工资
 
     (三) 全面规范企业工资支付行为一重点
 
         《国务院办公厅关于全面治理拖欠农民工工资问题的意见》规定，施工总承包企业(包括直接承包建设单位发包工程的专业承包企业，下同)对所承包工程项目的农民工工资支付负总责 ，分包企业(包括承包施工总承包企业发包工程的专业企业，下同)对所招用农民工的工资支付负直接责任。
 
         建设单位或施工总承包企业未按合同约定及时划拨工程款，致使分包企业拖欠农民工工资的，由建设单位或施工总承包企业以未结清的工程款为限先行垫付农民工工资。建设单位或施工总承包企业将工程违法发包、转包或违法分包致使拖欠农民工工资的，由建设单位或施工总承包企业依法承担清偿责任。
 
 三、劳动安全卫生制度
 
     用人单位必须对从事有职业危害作业的劳动者和未成年工定期进行健康检查。
 
 四、女职工和未成年工的特殊保护  一必考点
 
     (一)女职工的特殊保护
 
     (二)未成年工的特殊保护
 
         未成年工是指年满16周岁未满18 周岁的劳动者
 
         《劳动法》规定，禁止用人单位招用未满16周岁的未成年人。
         对未成年工的使用和特殊保护实行登记制度
 
 
     女职工
             一般规定  禁止安排女职工从事矿山井下、第四级体力劳动。
            具体规定（禁止第三级体力劳动）
                    经期  不得从事高处、低温、冷水作业
                    孕期  怀孕七个月以上，不得加班和夜班。
                    产期  产假不得少于98 天
                    哺乳期  不得加班和夜班。
     未成年工  禁止安排未成年工从事矿山井下、有毒有害、第四级体力劳动。
 
 
 五、劳动者的社会保险与福利
 
     《社会保险法》规定，国家建立基本养老保险、基本医疗保险、工伤保险、失业保险、生育保险等社会保险制度。一一工伤、生育保险个人不缴单位缴，其他个人和单位共同缴
 
     (一)基本养老保险
 
         参加基本养老保险的个人，达到法定退休年龄时累计缴费满15 年的，按月领取基本养老金。
 
     (四)失业保险
 
         1.失业保险金的领取
 
             失业人员失业前用人单位和本人累计缴费满1年不足5年的，领取失业保险金的期限最长为12个月; 累计缴费满5年不足10年的，领取失业保险金的期限最长为18个月; 累计缴费10年以上的，领取失业保险金的期限最长为24个月。重新就业后，再次失业的，缴费时间重新计算，领取失业保险金的期限与前次失业应当领取而尚未领取的失业保险金的期限合并计算，最长不超过24个月。
 
         4.停止享受失业保险待遇的规定
         失业人员在领取失业保险金期间有下列情形之一的，停止领取失业保险金，并同时停止享受其他失业保险待遇:
         (1) 重新就业的;
         (2) 应征服兵役的;
         (3) 移居境外的;
         (4) 享受基本养老保险待遇的;
         (5) 无正当理由，拒不接受当地人民政府指定部门或者机构介绍的适当工作或者提供的培训的。
 
 */

#pragma mark 1Z304025 劳动争议的解决
/*
 
 
 一、劳动争议的范围--------劳动者与用人单位之间的争议。(退休人员打工、大学生实习、保姆、徒弟等不属于劳动者) (保姆的东家、农村承包经营户、师傅等不是用人单位)一一必考点
 
     《劳动争议调解仲裁法》规定，劳动争议的范围主要是:
     (1) 因确认劳动关系发生的争议;
     (2) 因订立、履行、变更、解除和终止劳动合同发生的争议;
     (3) 因除名、辞退和辞职、离职发生的争议;
     (4) 因工作时间、休息休假、社会保险、福利、培训以及劳动保护发生的争议;
     (5) 因劳动报酬、工伤医疗费、经济补偿或者赔偿金等发生的争议;
     (6) 劳动者与用人单位在履行劳动合同过程中发生的纠纷:
     (7) 劳动者与用人单位之间没有订立书面劳动合同，但已形成劳动关系后发生的纠纷;
     (8) 劳动者退休后，与尚未参加社会保险统筹的原用人单位因追索养老金、医疗费、工伤保险待遇和其他社会保险而发生的纠纷;
     (9) 法律、法规规定的其他劳动争议。
 
     《解释(: 二)》规定，下列纠纷不属于劳动争议:
     (1)劳动者请求社会保险经办机构发放社会保险金的纠纷;
     (2) 劳动者与用人单位因住房制度改革产生的公有住房转让纠纷;
     (3) 劳动者对劳动能力鉴定委员会的伤残等级鉴定结论或者对职业病诊断鉴定委员会的职业病诊断鉴定结论的异议纠纷;
     (4) 家庭或者个人与家政服务人员之间的纠纷;
     (5) 个体工匠与帮工、学徒之间的纠纷;
     (6) 农村承包经营户与受雇人之间的纠纷。
 
     劳动争议的解决方式
             ------劳动合同 ≠ 民事合同，不适用《合同法》
                   劳动仲裁 ≠ 民事仲裁，不适用《仲裁法》
                   劳动争议  -先裁后审; 民事争议一一或裁或审。
     (二)仲裁
 
         劳动争议仲裁委员会由劳动行政部门代表、同级工会代表、用人单位方面的代表组成(1-2010)。
         劳动争议仲裁委员会主任由劳动行政部门代表担任。
         劳动关系存续期间因拖欠劳动报酬发生争议，劳动关系终止的，应当自劳动关系终止之日起一年内提出。
 
     (三)诉讼
         《劳动法》规定，劳动争议当事人对仲裁裁决不服的，可以自收到仲裁裁决书之日起15 日内向人民法院提起诉讼。
 
 */

#pragma mark 1Z304026 违法行为应承担的法律责任
/*
 
 
     劳动合同订立中违法行为应承担的法律责任    --重点
 
     用人单位自用工之日起超过1个月不满1年未与劳动者订立书面劳动合同的，应当向劳动者每月支付2倍的工资(一-1个月后~1年内(即最多11个月)为2倍工资)。
     用人单位自用工之日起满1年不与劳动者订立书面劳动合同的，视为用人单位与劳动者已订立无固定期限劳动合同。一  -应当订立无固定期限劳动合同3种情况(双十规则)

            双倍工资  视为无固定
     用工日  1个月  1年
 
     用人单位违反本法规定不与劳动者订立无固定期限劳动合同的，自应当订立无固定期限劳动合同之日起向劳动者每月支付2倍的工资。(一一自应当订立之日起为2倍工资)
 
 二、劳动合同履行、变更、解除和终止中违法行为应承担的法律责任
 
     (一)用人单位应承担的法律责任
 
         《劳动合同法》规定，用人单位违反本法规定解除或者终止劳动合同的，应当依照本法第47 条规定的经济补偿标准的2倍向劳动者支付赔偿金。
 
 
 */
#pragma mark - ************** 相关合同制度

#pragma mark 承揽合同
/*
 承揽合同的法律规定
 
 承揽合同是承揽人按照定定作人的要求完成工作，交付工作成果，定作人给付报酬的合同。
 承揽包括加工、订作、修理、复制、测试、检验等工作。
 
 4S店修车、加工零件均为承揽合同。车主——定作人，4S店——承揽人。
 
 一、承揽合同的特征
     (一)承揽合同以完成一定的工作并交付工作成果为标的
     (二)承揽人须以自己的设备、技术和劳力完成所承揽的工作
     (三)承揽人工作具有独立性
 承揽人在完成工作过程中，不受定作人的指挥管理，独立承担完成合同约定的质量、数量、期限等责任。
 承揽人在工作期间，应当接受定作人必要的监督检查。
 
 二、承揽合同当事人的权利义务:
     承揽合同是双务合同。
 
 (一)承揽人的义务
     1.按照合同约定完成承揽工作的义务
     2.材料检验的义务
         承揽人提供材料的，承揽人应当按照约定选用材料，并接受定作人检验。
         定作人提供材料的，承揽人应当对定作人提供的材料及时检验，发现不符合约定时，应当及时通知定作人更换、补齐或者采取其他补救措施。
     3.通知和保密的义务
     4.接受监督检查和妥善保管工作成果等的义务
         承揽人应当妥善保管定作人提供的材料以及完成的工作成果，因保管不善造成毁损、灭失的，应当承担损害赔偿责任。
     5.交付符合质量要求工作成果的义务
         承揽人交付的工作成果不符合质量要求的，定作人可以要求承揽人承担修理、重作、减少报酬、赔偿损失等违约责任。
         共同承揽人对定作人承担连带责任。
 
 (二)定作人的义务
 
     1.按照约定提供材料和协助承揽人完成工作的义务
 
     2.支付报酬的义务
 
         定作人应当按照约定的期限支付报酬。期限没有约定→协议补充→交易习惯
         定作人应当在承揽人交付工作成果时支付;工作成果部分交付的，定作人应当相应支付。
 
         除当事人另有约定的外，定作人未向承揽人支付报酬或者材料费等价款的，承揽人对完成的工作成果享有留置权。
 
     3.依法赔偿损失的义务
         定作人中途变更承揽工作的要求，造成承揽人损失的，应当赔偿损失。
         承揽人发现定作人提供的图纸或者技术要求不合理的，在通知定作人后，因定作人怠于答复等原因造成承揽人损失的，定作人应当赔偿损失。
 
     4.验收工作成果的义务
        承揽人完成工作向定作人交付工作成果，并提交了必要的技术资料和有关质量证明的，定作人应当验收该工作成果。
 
 三、承揽合同的解除
 
 (一)承揽人的法定解除权
     定作人不履行协助义务致使承揽工作不能完成的，承揽人可以催告定作人在合理期限内履行义务，并可以顺延履行期限;定作人逾期不履行的，承揽人可以依法解除合同。
 
 (二)定作人的法定解除权
     (经定作人同意)承揽人将其承揽的主要工作交由第三人完成的，应当就该第三人完成的工作成果向定作人负责;未经定作人同意的，定作人可以解除合同。
     承揽人将承揽的辅助工作交由第三人完成的，应当就第三人完成的工作成果向定作人负责。
 
 (三)定作人的法定任意解除权 ——与施工合同不同
     定作人可以随时解除承揽合同，造成承揽人损失的，应当赔偿损失。
 
 
  《合同法》规定，双方当事人可以协商解除合同。当事人一方解除合同的，只限于两种情况:一是发生不可抗力致使合同目的无法实现; 二是对方当事人严重违约。除此之外，当事人擅自解除合同的，应当承担违约责任。但在承揽合同中，定作人除了享有上述法定的解除权外，还享有随时解除合同的权利
 */

#pragma mark 买卖合同的法律规定

/*
 
  一、买卖合同的法律特征
 
     (一)买卖合同是一种转移财产所有权(——占有、使用、收益、处分)的合同
     (二)买卖合同是有偿合同
     (三)买卖合同是双务合同
     (四)买卖合同是诺成合同
     买卖合同可以是书面的，也可以是口头的。
     房屋买卖等标的额较大的财产买卖，应当签订书面合同。
 
 二、买卖合同当事人的权利义务
     (一)出卖人的主要义务
         1. 按照合同约定交付标的物的义务;
             (1)现实交付; 一手交货一手交钱
             (2)简易交付; 买方提前占有交易物
             (3)占有改定; 出卖后又租回
             (4)指示交付; 物品被第三人占有 指示第三人交付
             (5)拟制交付。交易票据类
         2. 转移标的物的所有权的义务;
             除法律另有约定或当事人另有约定以外，标的物的所有权自标的物交付时起转移。
             但是出卖具有知识产权的计算机软件等标的物的，除法律另有约定或当事人另有约定以外，该标的物的知识产权不属于买受人。
         3.瑕疵担保义务
             出卖人的瑕疵担保义务，可分为权利瑕疵担保义务和物的瑕疵担保义务。
             (1)权利瑕疵担保义务
                 如果出卖人对于出卖的标的物没有所有权或处分权，或者没有完全的所有权或处分权，或者其处分涉及第三人的物权、知识产权等权益，则称其标的物存在权利瑕疵，出卖人因此应当承担权利瑕疵担保责任。
                 买受人有确切证据证明第三人可能就标的物主张权利的，可以中止支付相应的价款，但出卖人提供适当担保的除外。
             (2)物的瑕疵担保义务
                 出卖人就其所交付的标的物具有约定或法定品质所负有的担保义务。
 
     (二) 买受人的主要义务
         3.对标的物进行检验和及时通知的义务
         当事人没有约定检验期间的，买受人在合理期间内未通知或者自标的物收到之日起两年内未通知出卖人的，视为标的物的数量或者质量符合约定，但对标的物有质量保证期的，适用质量保证期，  不适用该两年的规定。

 三、标的物毁损灭失风险的承担
 
     标的物毁损、灭失的风险，在标的物交付之前由出卖人承担，交付之后由买受人承担。
 
     因买受人的原因致使标的物不能按照约定的期限交付的，买受人应当自违反约定之日起承担标的物毁损、灭失的风险。
 
     出卖人出卖交由承运人运输的在途标的物，除当事人另有约定的以外，毁损、灭失的风险自合同成立时起由买受人承担。
     但在合同成立时出卖人知道或者应当知道标的物已经毁损、灭失却未告知买受人的，出卖人应当负担标的物毁损、灭失的风险。
 
     对于需要运输的标的物，当事人没有约定交付地点或约定不明确，出卖人将标的物交付给第一承运人后，标的物毁损、灭失的风险由买受人承担。
     出卖人依约将标的物置于交付地点，买受人违反约定没有收取的，标的物毁损、灭失的风险自违反约定之日起由买受人承担。
 
     出卖人按照约定未交付有关标的物的单证和资料的，不影响标的物毁损、灭失风险的转移(  -交付货物，未交付单证和资料，交付货物时风险转移)。
 
     因标的物质量不符合质量要求，致使不能实现合同目的的，买受人可以拒绝接受标的物或者解除合同。买受人拒绝接受标的物或者解除合同的，标的物毁损、灭失的风险由出卖人承担
     标的物毁损、灭失的风险由买受人承担的，不影响因出卖人履行债务不符合约定，买受人要求其承担违约责任的权利。  风险由买受人承担不影响出卖人承担违约责任

 四、特殊买卖合同的规定
     凭样品买卖:封存样品。
     试用买卖:适用买卖期间可以购买标的物，也可以拒绝购买。届满，买受人对是否购买标的物未作表示的，视为购买。
 五、孳息的归属和买卖合同的解除
     1、归属:交付。（交付时发生转移）
         法定孳息:租金、利息。
     2、解除:主物解除及于从物，从物不及于主物
         数物中，一物解除，其他物受损，数物也可解除
         多批物品中，一批解除，视关联程度解除其他批次
         分期付款，未支付价款达到五分之一，对方可要求支付全部价款或者解除合同，同时要求支付该物品使用费。
 
 
 */

#pragma mark 借款合同的法律规定

/*
  一、借款合同的法律特征
 
     (一)借款合同的标的物是货币
 
     (二)借款合同一般为要式合同
 
         借款合同采用书面形式，但自然人之间借款另有约定的除外。
 
     (三)借款合同一般是有偿合同
         借款合同原则上为有偿合同，也可以是无偿合同。
 
 二、借款合同当事人的权利义务
 
     (一)贷款人的义务
         贷款人的主要义务是提供借款和不得预扣利息。
         借款的利息不得预先在本金中扣除。利息预先在本金中扣除的，应当按照实际借款数额返还借款并计算利息。
 
     (二) 借款人的义务
         借款人的主要义务是提供担保、提供真实情况、  按照约定收取借款、按照约定用途使用借款、  按期归还本金和利息
         借款人应当按照约定的期限返还借款。借款期限没有约定一协议补充一交易习惯一借款人可以随时返还(1-2013); 贷款人可以催告借款人在合理期限内返还。
         借款人未按照约定的期限返还借款的，应当按照约定或者国家有关规定支付逾期利息(一一自然人之间借款未约定利息的，也应支付逾期利息)。  借款人提前偿还借款的，除当事人另有约定的以外，应当按照实际借款的期间计算利息

 三、借款合同的其他规定
     自然人之间的借款合同，自贷款人提供借款时生效。（自然人之间的借款合同是实践合同，自然人与金融机构之间的借款合同是诺成合同）
     自然人之间的借款合同对支付利息没有约定或者约定不明确的，视为不支付利息。
 
 
     《意见》规定,民间借贷的利率可以适当高于银行的利率，但最高不得超过银行同类贷款利率的4倍(包含利率本数)。  超出此限度的,  超出部分的利息不予保护。
     出借人【不得将利息计入本金】谋取高利。债权人将利息计入本金计算复利的  其利率超出银行同类贷款利率的4 倍(包含利率本数)时，超出部分的利息不予保护~注意: 利率最高不得超过银行同类贷款利率的4 倍，只针对民间借贷
 */

#pragma mark 1Z304034 租赁合同的法律规定

/*
  一、租赁合同的法律特征
     租赁合同是转移租赁物使用收益权(——占有、使用、收益，无处分)的合同，也是诺成合同和双务、有偿合同。
 
 二、租赁合同的内容和类型
 
     (二)租赁合同的类型
 
         租赁合同根据租赁标的物不同，可分为动产租赁和不动产租赁。
         此外，根据是否约定租赁期限，还可分为定期租赁和不定期租赁。
 
         租赁合同可以约定租赁期限，但租赁期限不得超过20年。超过20年的， 超过部分无效。
         租赁期限6个月以上的，应当采用书面形式。当事人未采用书面形式的，视为不定期租赁。不定期租赁，当事人可以随时解除合同。
 
        【6个月以上 应当采用书面形式】
 
 三、租赁合同当事人的权利义务
 
     (一)出租人的义务
 
         出租人的主要义务是交付出租物、维修租赁物、权利瑕疵担保、物的瑕疵担保、保证承租人优先购买权和保证共同居住人继续承租。
         除当事人另有约定的外，出租人应当履行租赁物的维修义务。
 
         出租人出卖租赁房屋的，应当在出卖之前的合理期限内通知承租人，承租人享有以同等条件优先购买的权利。
         租赁物在租赁期间发生所有权变动的，不影响租赁合同的效力。——买卖不破租赁
 
     (二)承租人的义务
 
         承租人的主要义务是支付租金、按照约定使用租赁物、妥善保管租赁物、有关事项通知、返还租赁物和损失赔偿。
         承租人应当按照约定的期限支付租金。
 
         承租人经出租人同意，可以将租赁物转租给第三人。
         承租人转租的，承租人与出租人之间的租赁合同继续有效，第三人对租赁物造成损失的，承租人应当赔偿损失。
         承租人未经出租人同意转租的，出租人可以解除合同。
 
 */

#pragma mark 融资租赁合同的法律规定

/*
 融资租赁合同的法律规定
 《合同法》规定，融资租赁合同是出租人根据承租人对出卖人、租赁物的选择，向出卖人购买租赁物，提供给承租人使用，承租人支付租金的合同。
 
 
 一、融资租赁合同的法律特征
     (一)出租人身份的二重性
         出租人是租赁行为的出租方，又是买卖关系的买受人。
         承租人将其自有物出卖给出租人，再通过融资租赁合同将租赁物从出租人处租回的，人民法院不应仅以承租人和出卖人系同一人为由认定不构成融资租赁法律关系。
 
     (二)出卖人权利与义务相对人的差异性
         承租人享有买受人的权利但不承担买受人的义务。
         出租人不负担租赁物的维修与瑕疵担保义务，但承租人须向出租人履行交付租金义务。
 
     (三)融资租赁合同是要式合同
         《合同法》规定，融资租赁合同应当采用书面形式。
 
 二、融资租赁合同当事人的权利义务
 
     (一)出租人的义务
         出租人应当根据承租人对出卖人、租赁物的选择订立的买卖合同，向出卖人支付标的物的价金。
         出租人应当保证承租人对租赁物的占有和使用。
 
         出租人、出卖人、承租人可以约定，出卖人不履行买卖合同义务的，由承租人行使索赔的权利。
         承租人行使索赔权利的，出租人应当协助。
 
         出租人根据承租人对出卖人、租赁物的选择订立的买卖合同，未经承租人同意，出租人不得变更与承租人有关的合同内容。
         租赁物不符合约定或者不符合使用目的的，出租人不承担责任，但承租人依赖出租人的技能确定租赁物或者出租人干预选择租赁物的除外。
 
     (二)出卖人的义务
 
         出卖人的主要义务是向承租人交付标的物、标的物的瑕疵担保。
 
         出卖人违反合同约定的向承租人交付标的物的义务，承租人因下列情形之一拒绝受领租赁物的，人民法院应予支持:
         (1)租赁物严重不符合约定的;
         (2)出卖人未在约定的交付期间或者合理期间内交付租赁物，经承租人或者出租人催告，在催告期满后仍未交付的。
 
     (三)承租人的义务
 
         承租人应当履行占有租赁物期间的维修义务。承租人占有租赁物期间，因租赁物造成第三人的人身伤害或者财产损害的，出租人不承担责任。
 
         出租人享有租赁物的所有权。
         出租人和承租人可以约定租赁期间届满租赁物的归属。没有约定→协议补充→交易习惯→出租人。
 
         承租人破产的，租赁物不属于破产财产。
 
         《解释》规定，承租人占有租赁物期间，租赁物毁损、灭失的风险由承租人承担，出租人要求承租人继续支付租金的，人民法院应予支持。但当事人另有约定或者法律另有规定的除外。
         出租人转让其在融资租赁合同项下的部分或者全部权利，受让方以此为由请求解除或者变更融资租赁合同的，人民法院不予支持。
 
 
 */
#pragma mark 1Z304036 运输合同的法律规定

/*
 
 货运合同的法律特征
 
     (一)货运合同是双务、有偿合同;
     ( 二)货运合同的标的是运输行为:
     ( E)货运合同是诺成合同;
     (四)货运合同当事人的特殊性。货运合同的收货人和托运人可以是同一人。
 
 
 二、货运合同当事人的权利义务
 
     (一)承运人的权利义务
 
             1.承运人的权利
 
                 托运人应当按照约定的方式包装货物。
                 托运人违反包装的规定的，承运人可以拒绝运输。
                 托运人或者收货人不支付运费、保管费以及其他运输费用的，承运人对相应的运输货物享有留置权，但当事人另有约定的除外。
 
             2.承运人的义务(2-2016-2017)
 
                 承运人对运输过程中货物的毁损、灭失承担损害赔偿责任，但承运人证明货物的毁损、灭失是因不可抗力、货物本身的自然性质或者合理损耗以及托运人、收货人的过错造成的，不承担损害赔偿责任。
 
                 两个以上承运人以同一运输方式联运的，与托运人订立合同的承运人应当对全程运输承担责任。损失发生在某一运输区段的，与托运人订立合同的承运人和该区段的承运人承担连带责任。一一单式联运合同连带(第一承运人和该区段的承运人)
 
                 货物运输到达后，承运人知道收货人的，应当及时通知收货人。
                 货物在运输过程中因不可抗力灭失，未收取运费的，承运人不得要求支付运费; 已收取运费的，托运人可以要求返还。
 
     (二) 托运人的权利义务
 
             1.托运人的权利
 
                 在承运人将货物交付收货人之前，托运人可以要求承运人中止运输、返还货物、变更到达地或者将货物交给其他收货人，但应当赔偿承运人因此受到的损失。
 
     (三) 收货人的权利义务
 
             2.收货人的义务
 
             收货人在约定的期限或者合理期限内对货物的数量、毁损等未提出异议的，视为承运人已经按照运输单证的记载交付的初步证据。
 
 三、多式联运合同
 
             多式联运经营人负贵履行或者组织履行多式联运合同，对全程运输享有承运人的权利，承担承运人的义务、多式联运合同(责任主体一个: 多式联运经营人)
 
             多式联运经营人可以与参加多式联运的各区段承运人就多式联运合同的各区段运输约定相互之间的责任，但该约定不影响多式联运经营人对全程运输承担的义务。
             因托运人托运货物时的过错造成多式联运经营人损失的，即使托运人已经转让多式联运单据，托运人仍然应当承担损害赔偿责任。
 
 */
#pragma mark 1Z304037 仓储合同的法律规定

/*
 
 一、仓储合同的法律特征一一认单不认人
 
         (一)仓储合同是诺成合同
                 一一保管合同是实践合同

         (二)仓储合同的保管对象是动产

         (三)仓储合同是双务合同、有偿合同
 
 二、仓储合同当事人的权利义务
 
         (一) 保管人的义务
 
                 1.验收的义务
 
                    保管人验收时发现入库仓储物与约定不符合的，应当及时通知存货人。
                    保管人验收后，发生仓储物的品种、数量、质量不符合约定的，保管人应当承担损害赔偿责任。
 
                 2.出具仓单的义务
 
                    仓单是提取仓储物的凭证。
                    存货人或者仓单持有人在仓单上背书并经保管人签字或者盖章的，可以转让提取仓储物的权利。
 
                 6.损害赔偿的义务
 
             因仓储物的性质、包装不符合约定或者超过有效储存期造成仓储物变质、损坏的，保管人不承担损害赔偿责任
 
         (二) 存货人的义务
 
                 3.按时提取仓储物
 
                     储存期间届满，存货人或者仓单持有人应当凭仓单提取仓储物(一认单不认人。存货人或者仓单持有人逾期提取的，应当加收仓储费; 提前提取的，不减收仓储费。
 */
#pragma mark 1Z304038 委托合同的法律规定

/*
 
 
 一、  委托合同的法律特征
 
         委托合同是一种典型的提供劳务的合同。委托的事务可以是法律行为，也可以是事实行为。委托合同可以是有偿合同，也可以是无偿合同。
 
 二、委托合同当事人的权利义务
 
     (二) 受托人的义务
         受托人应当亲自处理委托事务。
 
 三、委托合同的终止
 
         委托人或者受托人可以随时解除委托合同。因解除合同给对方造成损失的，除不可归责于该当事人的事由以外，应当赔偿损失。
 
 */
#pragma mark - ************** 1Z305000 施工环保、节能和文物保护法律制度


/*
 
 */
#pragma mark 1Z305010 施工现场环境保护制度

/*
 
 */
#pragma mark 1Z305011 施工现场噪声污染防治的规定

/*

 一、施工现场环境噪声污染的防治
 
     (一) 建筑施工场界环境噪声排放标准的规定
 
         《环境噪声污染防治法》规定,在城市市区范围内向周围生活环境排放建筑施工噪声的，应当符合国家规定的建筑施工场界环境噪声排放标准
 
         《建筑施工场界环境噪声排放标准》规定，建筑施工场界环境噪声排放限值，昼间70dB(A)，  夜间55dB（A）。夜间噪声最大声级超过展值的幅度不得高于15dB(A)
             (-  “偶然的尖锐的噪声”最高70dB(A) -昼间平均70dB(A)，夜间最高70dB(A))。“昼间”是指6: OO 至22: OO之间的时段;“夜间”是指22: OO至次日6: OO之间的时段。
         县级以上人民政府为环境噪声污染防治的需要(如考虑时差、作息习惯差异等) 而对昼间、夜间的划分另有规定的，应按其规定执行。
 
     (二)使用机械设备可能产生环境噪声污染须申报的规定
 
         《环境噪声污染防治法》规定，在城市市区范围内，建筑施工过程中使用机械设备，可能产生环境噪声污染的，施工单位必须在工程开工15日以前向工程所在地县级以上地方人民政府环境保护行政主管部门申报该工程的项目名称、施工场所和期限、可能产生的环境噪声值以及所采取的环境噪声污染防治措施的情况。
 
     (三)禁止夜间进行产生环境噪声污染施工作业的规定
 
         《环境噪声污染防治法》规定，在城市市区噪声敏感建筑物集中区域内，禁止夜间进行产生环境噪污染的建筑施工作业(一  同时满足才禁止),但【抢修、抢险】作业和【因生产工艺上要求或者特殊需要必须连续作业】的除外（-抢进度、抢工期不属于必须连续作业)。
 
         特殊需要必须连续作业的，必须有县级以上人民政府或者其有关主管部门的证明(--其他夜间作业不需证。
         以上规定的夜间作业，必须公告附近居民(一 必须公告; 公告 ≠ 经济补偿 ≠ 同意)。
 
         噪声敏感建筑物集中区域 指医疗区、文教科研区和以机关或者居民住宅为主的区域。噪声敏感建筑物，是指医院、学校、机关、科研单位、住宅等需要保持安静的建筑物。
 
  二、建设项目环境噪声污染的防治
 
     建设项目可能产生环境噪声污染的，建设单位必须提出环境影响报告书，规定环境噪声污染的防治措施，并按照国家规定的程序报环境保护行政主管部门批准。环境影响报告书中，应当有该建设项目所在地单位和居民的意见。
     建设项目的环境噪声污染防治设施必须与主体工程同时设计、同时施工、同时投产使用。建设项目在投入生产或者使用之前，其环境噪声江染防治设施必须经原审批环境影响报告书的环境保护行政主管部门验收; 达不到国家规定要求的，该建设项目不得投入生产或者使用。
 
 
 */
#pragma mark  1Z305012 施工现场废气、废水污染防治的规定

/*
 一、大气污染的防治
 
     (一)施工现场大气污染的防治
 
         《大气污染防治法》规定,企业事业单位和其他生产经营者向大气排放污染物的，应当设置大气污染物排放口
         禁止通过临时停产、  非紧急情况下开启应急排放通道、不正常运行大气污染防治设施等逃避监管的方式排放大气污染物。
 
         建设单位应当将防治扬尘污染的费用列入工程造价，并在施工承包合同中明确施工单位扬尘污染防治责任。
         施工单位应当制定具体的施工扬尘污染防治实施方案。
         施工单位应当在施工工地设置硬质围挡，并采取覆盖、分段作业、择时施工、洒水抑尘、冲洗地面和车辆等有效防尘降尘措施。
         建筑土方、工程渣土、建筑垃圾应当清运；在场地内堆存的，应当采用密闭式防尘网遮盖。
         工程渣土、建筑垃圾应当进行资源化处理。
 
         施工单位应当在施工工地公示扬尘污染防治措施、负责人、扬尘监督管理主管部门等信息。暂时不能开工的建设用地，  建设单位应当对裸露地面进行覆盖; 超过三个月的，应当进行绿化、铺装或者遮盖
 
         施工现场大气污染的防治，重点是防治扬尘污染。
         《绿色施工导则》规定:
             2.土方作业阶段，采取洒水、覆盖等措施，达到作业区目测扬尘高度小于1.5m，不扩散到场区外。
             3.结构施工、安装装饰装修阶段，作业区目测扬尘高度小于0.5m.
             4.施工现场非作业区达到目测无扬的要求。
 
     (三)对向大气排放污染物单位的监管
 
         《大气污染防治法》规定，从事房屋建筑、市政基础设施建设、河道整治以及建筑物拆除等施工单位，应当向负责监督管理扬尘污染防治的主管部门备案
         企业事业单位和其他生产经营者在生产经营活动中产生恶臭气体的，应当科学选址，设置合理的防护距离，并安装净化装置或者采取其他措施，防止排放恶臭气体。
 
 二、水污染的防治
 
     (一)施工现场水污染的防治
 
         《城镇排水与污水处理条例》规定，建设工程开工前，建设单位应当查明工程建设范围内地下城镇排水与污水处理设施的相关情况。建设工程施工范围内有排水管网等城镇排水与污水处理设施的，建设单位应当与施工单位、设施维护运营单位共同制定设施保护方案，并采取相应的安全保护措施。因工程建设需要拆除、改动城镇排水与污水处理设施的，建设单位应当制定拆除、改动方案，报城镇排水主管部门审核，并承担重建、改建和采取临时措施的费用。
 
         《城镇污水排入排水管网许可管理办法》规定,未取得排水许可证，排水户不得向城镇排水设施排放污水。
         各类施工作业需要排水的，由建设单位申请领取排水许可证。
         因施工作业需要向城镇排水设施排水的，排水许可证的有效期，由城镇排水主管部门根据排水状况确定，但不得超过施工期限。
         排水户应当按照排水许可证确定的排水类别、总量、时限、排放口位置和数量、排放的污染物项目和浓度等要求排放污水
 
         排水户不得有下列危及城镇排水设施安全的行为:
         (1) 向城镇排水设施排放、倾倒剧毒、易燃易爆物质、腐蚀性废液和废渣、有害气体和烹饪油烟等;
         (2) 堵塞城镇排水设施或者向城镇排水设施内排放、倾倒垃圾、渣土、施工泥浆、油脂、污泥  等易堵塞物;
         (3) 擅自拆卸、移动和穿凿城镇排水设施;
         (4) 擅自向城镇排水设施加压排放污水
 
         排水户因发生事故或者其他突发事件，排放的污水可能危及城镇排水与污水处理设施安全运行的，应当及时向城镇排水主管部门等有关部门报告。
 
         城镇排水主管部门实施排水许可不得收费。
 
 */
#pragma mark  1Z305013 施工现场固体废物污染防治的规定

/*
 
 
 一、施工现场固体废物污染环境的防治
 
     (一)一般固体废物污染环境的防治
 
             《城市建筑垃圾管理规定》规定,施工单位不得将建筑垃圾交给个人或者未经核准从事建筑垃圾运输的单位运输。
             处置建筑垃圾的单位在运输建筑垃圾时，应当随车携带建筑垃圾处置核准文件，按照城市人民政府有关部门规定的运输路线、时间运行。
 
     (二)危险废物污染环境防治的特别规定
 
             对危险废物的容器和包装物以及收集、贮存、运输、处置危险废物的设施、场所，必须设置危险废物识别标志。
             以填埋方式处置危险废物不符合国务院环境保护行政主管部门规定的，应当缴纳危险废物排污费。
             危险废物排污费用于污染环境的防治，不得挪作他用。
 
             禁止将危险废物( ≠ 固体废物(建筑垃圾和生活垃圾) )提供或者委托给无经营许可证的单位从事收集、贮存、利用、处置的经营活动。
 
     (三)施工现场固体废物的减量化和回收再利用
 
             《绿色施工导则》规定，制定建筑垃圾减量化计划，如住宅建筑，每万平方米的建筑垃圾不宜超过400t
             加强建筑垃圾的回收再利用，力争建筑垃圾的再利用和回收率达到30%，建筑物拆除产生的废弃物的再利用和回收率大于40%。
             对于碎石类、土石方类建筑垃圾，可采用地基填埋、铺路等方式提高再利用率，力争再利用率大于50%
 
             施工现场生活区设置封闭式垃圾容器，施工场地生活垃圾实行袋装化，及时清运。对建筑垃圾进行分类，并收集到现场封闭式垃圾站，集中运出。
 
 */
#pragma mark  1Z305014 违法行为应承担的法律责任

/*
 
 
 二、施工现场大气污染防治违法行为应承担的法律责任
 
     (一)施工单位应承担的法律责任
 
         拒不执行停止工地土石方作业或者建筑物拆除施工等重污染天气应急措施的，由县级以上地方人民政府确定的监督管理部门处1万元以上10万元以下的罚款。
 
         施工单位有下列行为之一的，由县级以上人民政府住房城乡建设等主管部门按照职责责令改正，处1万元以上10 万元以下的罚款; 拒不改正的，责令停工整治:
         (1) 施工工地未设置硬质密闭围挡，或者未采取覆盖、分段作业、择时施工、洒水抑尘、冲洗地面和车辆等有效防尘降尘措施的;
         (2) 建筑土方、工程渣土、建筑垃圾未及时清运，或者未采用密闭式防尘网遮盖的。
 
         企业事业单位和其他生产经营者有下列行为之一，受到罚款处罚，被责令改正，拒不改正的，依法作出处罚决定的行政机关可以自责令改正之日的次日起，按照原处罚数额按日连续处罚:
         (1) 未依法取得排污许可证排放大气污染物的;
         (2) 超过大气污染物排放标准或者超过重点大气污染物排放总量控制指标排放大气污染物的;
         (3) 通过逃避监管的方式排放大气污染物的;
         (4) 建筑施工或者贮存易产生扬尘的物料未采取有效措施防治扬尘污染的。
 
 三、施工现场水污染防治违法行为应承担的法律责任
 
     《水污染防治法》规定，排放水污染物超过国家或者地方规定的水污染物排放标准，或者超过重点水污染物排放总量控制指标的，由县级以上人民政府环境保护主管部门按照权限责令限期治理，处应缴纳排污费数额2倍以上5倍以下的罚款。限期治理期间，由环境保护主管部门责令限制生产、限制排放或者停产整治。限期治理的期限最长不超过1年; 逾期未完成治理任务的，报经有批准权的人民政府批准，责令关闭。
 
 四、施工现场固体废物污染环境防治违法行为应承担的法律责任
 
     《城市建筑垃圾管理规定》中规定，施工单位将建筑垃圾交给个人或者未经核准从事建筑垃圾运输的单位处置的，由城市人民政府市容环境卫生主管部门责令限期改正，给予警告，处1万元以上10万元以下罚款。
 */
#pragma mark  1Z305020 施工节约能源制度

/*
 
 */
#pragma mark  1Z305021 施工合理使用与节约能源的规定

/*
    四节一环保(节能、节地、节水、节材和环境保护)
 
 一、合理使用与节约能源的一般规定
 
     (一) 节能的产业政策
 
             国家鼓励企业制定严于国家标准、行业标准的企业节能标准。
 
     (二) 用能单位的法定义务
 
             任何单位不得对能源消费实行包费制。
 
     (三)循环经济的法律要求
 
             《循环经济促进法》规定,发展循环经济应当在技术可行、经济合理和有利于节约资源、保护环境的前提下，按照减量化优先的原则实施。
 
 二、建筑节能的规定
 
             《节约能源法》规定,国家实行固定资产投资项目节能评估和审查制度(2-2017)。不符合强制性节能标准的项目，依法负责项目审批或者核准的机关不得批准或者核准建设; 建设单位不得开工建设; 已经建成的，不得投入生产、使用。
 
             建筑工程的建设、设计、施工和监理单位应当遵守建筑节能标准。
 
     (二)新建建筑节能的规定
 
         1.施工图审查机构的节能义务
 
             施工图设计文件经审查不符合民用建筑节能强制性标准的，县级以上地方人民政府建设主管部门不得颁发施工许可证。

         2.建设单位的节能义务
 
             [注] 建设单位不得以任何理由要求施工单位修改经审查合格的节能设计文件; 施工单位进行施工时，不得违反审查合格的设计文件和建筑节能施工标准。
             建设单位组织竣工验收，对不符合民用建筑节能强制性标准的，不得出具竣工验收合格报告 。
 
         3.设计单位、施工单位、工程监理单位的节能义务
 
             施工单位应当对进入施工现场的1.墙体材料、2保温材料、3 门窗、采暖制冷系统和5.照明设备进行查验; 不符合施工图设计文件要求的，不得使用。
             工程监理单位发现施工单位不按照民用建筑节能强制性标准施工的，应当要求施工单位改正; 施工单位拒不改正的，工程监理单位应当及时报告建设单位，并向有关主管部门报告。
             墙体、屋面的保温工程施工时，监理工程师应当采取旁站、巡视和平行检验等形式实施监理。未经监理工程师签字，1.墙体材料  2保温材料、3.门窗、4.采暖制冷系统和5.照明设备不得在建筑上使用或者安装，施工单位不得进行下一道工序的施工。
 
     (三) 既有建筑节能的规定
 
             实施既有建筑节能改造，应当符合民用建筑节能强制性标准，优先采用遮阳、改善通风等低成本改造措施。既有建筑围护结构的改造和供热系统的改造应当同步进行。
 
 三、施工节能的规定
 
     有条件的地区，应当充分利用太阳能、地热能、风能等可再生能源。
 
 
     (一)节材与材料资源利用
 
             《循环经济促进法》规定，国家鼓励利用无毒无害的固体废物生产建筑材料，鼓励使用散装水泥(散装 ≠ 大袋装)，推广使用预拌混凝土和预拌砂浆(预拌 ≠ 现场搅拌)。
             禁止损毁耕地烧砖。
             在国务院或者省级人民政府规定的期限和区域内，禁止生产、销售和使用黏土砖
 
             《绿色施工导则》规定，图纸会审时，应审核节材与材料资源利用的相关内容 ，达到材料损耗率比定额损耗率降低30%; 应就地取材，施工现场500km 以内生产的建筑材料用量占建筑材料总重量的70%以上。
 
             结构材料节材与材料资源利用的技术要点是:
             (1) 推广使用预拌混凝上和商品砂浆。结构工程使用散装水泥。
             (2) 推广使用高强钢筋和高性能混凝，减少资源消耗。
             (3) 推广钢筋专业化加工和配送
 
 
     (二)节水与水资源利用
 
             《循环经济促进法》规定，国家鼓励和支持使用再生水。企业应当发展串联用水系统和循环用水系统。
 
             《绿色施工导则》规定:
             l.提高用水效率:
                 (1) 施工中采用先进的节水施工工艺。
                 (2) 施工现场喷洒路面、绿化浇灌不宜使用市政自来水。现场搅拌用水、养护用水应采取有效的节水措施，严禁无措施浇水养护混凝。
                 (4) 现场机具、设备、车辆冲洗用水必须设立循环用水装置。
                 (6) 施工现场分别对生活用水与工程用水确定用水定额指标，并分别计量管理。
                 (7) 大型工程的不同单项工程、不同标段、不同分包生活区，凡具备条件的应分别计量用水量。在签订不同标段分包或劳务合同时，将节水定额指标纳入合同条款，进行计量考核。
                 (8) 对混凝土搅拌站点等用水集中的区域和工艺进行专项计量考核。
 
             2.非传统水源利用:
                 (1) 优先采用中水搅拌、中水养护，有条件的地区和工程应收集雨水养护。
                 (2) 处于基坑降水阶段的工地，宜优先采用地下水作为混凝土搅拌用水、养护用水、冲洗用水和部分生活用水。
                 (3) 现场机具、设备、车辆冲洗、喷洒路面、绿化浇灌等用水，优先采用非传统水源，尽量不使用市政自来水。
                 (4) 大型施工现场，尤其是雨量充沛地区的大型施工现场建立雨水收集利用系统，充分收集自然降水用于施工和生活中适宜的部位。
                 (5) 力争施工中非传统水源和循环水的再利用量大于30%。
 
 
     (三) 节能与能源利用
 
         《绿色施工导则》规定:
             1.节能措施:
                 (1) 制订合理施工能耗指标，提高施工能源利用率。
                 (2) 优先使用国家、行业推荐的节能、高效、环保的施工设备和机具。
                 (3) 施工现场分别设定生产、生活、办公和施工设备的用电控制指标。
                 (4) 安排施工工艺时，应优先考虑耗用电能的或其他能耗较少的施工工艺。
                 (5) 根据当地气候和自然资源条件，充分利用太阳能、地热等可再生能源
 
             4.施工用电及照明:
                 (1) 临时用电优先选用节能电线和节能灯具，临电设备宜采用自动控制装置  采用声控、光控等节能照明灯具。
                 (2) 照明设计以满足最低照度为原则，照度不应超过最低照度的20%
 
     (四)节地与施工用地保护
 
         《绿色施工导则》规定:
             1.临时用地指标:
                 (1)临时设施的占地面积应按用地指标所需的最低面积设计。
                 (2) 要求平面布置合理、紧奏，临时设施占地面积有效利用率大于90%。
 
             3.施工总平面布置:
                 (1) 施工总平面布置，充分利用原有建筑物、构筑物、道路、管线为施工服务。
                 (2)施工现场搅拌站、仓库、加工厂、作业棚、材料堆场等布置应尽量靠近已有交通线路或即将修建的正式或临时交通线路，缩短运输距离。
                 (3) 临时办公和生活用房应采用标准化装配式结构。生活区与生产区应分开布置并设置标准的分隔设施。
                 (4) 施工现场围墙可采用连续封闭的轻钢结构预制装配式活动围挡，减少建筑垃圾，保护土地。
                 (5) 施工现场道路按照永久道路和临时道路相结合的原则布置。施工现场内形成环形通路，减少道路占用土地。
                 (6) 临时设施布置应注意远近结合(本期工程与下期工程)，努力减少和避免大量临时建筑拆迁和场地搬迁。
 
 */
#pragma mark 1Z305022 施工节能技术进步和激励措施的规定

/*
 二、节能激励措施
 
     (一)财政安排节能专项资金
 
             中央财政和省级地方财政安排节能专项资金，支持节能技术研究开发、节能技术和产品的示范与推广、重点节能工程的实施、节能宣传培训、信息服务和表彰奖励等。
             国家通过财政补贴支持节能照明器具等节能产品的推广和使用。
 
     (二)税收优惠
             国家运用税收政策，鼓励先进节能技术、设备的进口，控制在生产过程中耗能高、污染重的产品的出口。
 
     (三) 信贷支持
             国家引导金融机构增加对节能项目的信贷支持，为符合条件的节能技术研究开发、节能产品生产以及节能技术改造等项目提供优惠贷款。
 
     (四)价格政策
             国家实行有利于节能的价格政策，引导施工单位和个人节能。国家实行有利于资源节约和合理利用的价格政策，引导单位和个人节约和合理使用水、电、气等资源性产品。
 
     (五)表彰奖励
             各级人民政府对在节能管理、节能科学技术研究和推广应用中有显著成绩以及检举严重浪费能源行为的单位和个人，给予表彰和奖励。
             企业事业单位应当对在循环经济发展中作出突出贡献的集体和个人给予表彰和奖励。
 
 */
#pragma mark  1Z305023 违法行为应承担的法律责任

/*
 
 
 三、用能单位其他违法行为应承担的法律责任
 
             《节约能源法》规定,用能单位未按照规定配备、使用能源计量器具的，由产品质量监督部门责令限期改正; 逾期不改正的，处1万元以上5 万元以下罚款。
             无偿向本单位职工提供能源或者对能源消费实行包费制的，由管理节能工作的部门责令限期改正; 逾期不改正的，处5万元以上20万元以下罚款。

 
 */
#pragma mark 1Z305030 施工文物保护制度

/*
 

 
 */
#pragma mark 1Z305031 受国家保护的文物范围

/*
 
 
 
 三、文物保护单位和文物的分级
 
     《文物保护法》规定，不可移动文物，根据历史、艺术、科学价值，可以分别确定为全国重点文物保护单位，省级文物保护单位，市、县级文物保护单位
     可移动文物，分为珍贵文物和一般文物;
     珍贵文物分为一级文物、二级文物、三级文物。
 
 四、属于国家所有的文物范围
 
     中华人民共和国境内地下、内水和领海中遗存的一切文物，属于国家所有。
 
     (一)属于国家所有的不可移动文物范围
 
             古文化遗址、古墓葬、石窟寺属于国家所有。
 
             国家指定保护的纪念建筑物、古建筑、石刻、壁画、近代现代代表性建筑等不可移动文物，除国家另有规定的以外，属于国家所有。
 
             不可移动文物的所有权不因其所依附的土地所有权或者使用权的改变而改变。
 
     (二)属于国家所有的可移动文物范围
 
             下列可移动文物，属于国家所有:
             (1) 中国境内出土的文物，国家另有规定的除外;
             (2) 国有文物收藏单位以及其他国家机关、部队和国有企业、事业组织等收藏、保管的文物;
             (3) 国家征集、购买的文物;
             (4) 公民、法人和其他组织捐赠给国家的文物;
             (5) 法律规定属于国家所有的其他文物。
 
             属于国家所有的可移动文物的所有权不因其保管、收藏单位的终止或者变更而改变。
 
     (三)属于国家所有的水下文物范围
 
             文物起源：  起源于中国的、起源国不明的、起源于外国的。
             海域划分: 中国内水、领海、  中国领海以外由中国管辖的海域、外国领海以外的海域、公海区域。
 
             中国内水、领海内全部文物属于国家所有，国家对其行使管辖权
             中国领海以外由中国管辖的海域除起源于外国的文物外，属于国家所有，国家对其行使管辖权
             公海、外国领海以外的其他海域，起源于中国的文物，国家享有辨认器物物主的权利
 
 */
#pragma mark 1Z305032 在文物保护单位保护范围和建设控制地带施工的规定

/*
 
 

 一、文物保护单位的保护范围
 
     全国重点文物保护单位和省级文物保护单位自核定公布之日起1年内，由省、自治区、直辖市人民政府划定必要的保护范围，作出标志说明。
 
     设区的市、自治州级和县级文物保护单位自核定公布之日起1年内，由核定公布该文物保护单位的人民政府划定保护范围。
 
     [注] 全国重点文物保护单位由国务院核定公布。省级文物保护单位由省人民政府核定公布。县、市、区级文物保护单位则由县、市、区人民政府核定公布。
 
 二、文物保护单位的建设控制地带
 
     全国重点文物保护单位的建设控制地带，经省、自治区、直辖市人民政府批准，由省、自治区、直辖市人民政府的【文物行政主管部门】会同【城乡规划行政主管部门】划定并公布。
     省级、设区的市、自治州级和县级文物保护单位的建设控制地带，经省、自治区、直辖市人民政府批准，由核定公布该文物保护单位的人民政府的文物行政主管部门会同城乡规划行政主管部门划定并公布。
 
     一一注意: 建设控制地带的批准都是省人民政府批准; 划定公布部门不同
 
 四、在文物保护单位保护范围和建设控制地带施工的规定
 

     (一)承担文物保护单位的修缮、迁移、重建工程的单位应当具有相应的资质证书
 
             《文物保护法实施条例》规定，承担文物保护单位的修缮、迁移、重建工程的单位，应当同时取得文物行政主管部门发给的相应等级的文物保护工程资质证书和建设行政主管部门发给的相应等级的资质证书。其中,不涉及建筑活动的文物保护单位的修缯、迁移、重建,应当由取得文物行政主管部门发给的相应等级的文物保护工程资质证书的单位承担。
 
             申领文物保护工程资质证书，应当具备下列条件:
             (1)有取得文物博物专业技术职务的人员;
             (2) 有从事文物保护工程所需的技术设备;
             (3) 法律、行政法规规定的其他条件。
             
             申领文物保护工程资质证书，应当向省、自治区、直辖市人民政府文物行政主管部门或者国务院文物行政主管部门提出申请。
             省、自治区、直辖市人民政府文物行政主管部门或者国务院文物行政主管部门应当自收到申请之日起30 个工作日内作出批准或者不批准的决定。
             决定批准的，发给相应等级的文物保护工程资质证书;决定不批准的，应当书面通知当事人并说明理由。
 
 
     (二)在历史文化名城名镇名村保护范围内从事建设活动的相关规定
 
             《历史文化名城名镇名村保护条例》规定，在历史文化名城、名镇、名村保护范围内禁止进行下列活动:
             (1) 开山、采石、开矿等破坏传统格局和历史风貌的活动;
             (2) 占用保护规划确定保留的园林绿地、河湖水系、道路等;
             (3) 修建生产、储存爆炸性、易燃性、放射性、毒害性、腐蚀性物品的工厂、仓库等;
             (4)在历史建筑上刻划、涂污
 
             在历史文化名城、名镇、名村保护范围内进行下列活动，应当保护其传统格局、历史风貌和历史建筑; 制订保护方案，经城市、县人民政府城乡规划主管部门会同同级文物主管部门批准:
             (1)改变园林绿地、河湖水系等自然状态的活动;
             (2) 在核心保护范围内进行影视摄制、举办大型群众性活动;
             (3) 其他影响传统格局、历史风貌或者历史建筑的活动。
 
             在历史文化街区、名镇、名村核心保护范围内，拆除历史建筑以外的建筑物、构筑物或者其他设施的，应城市、县人民政府城乡规划主管部门会同同级文物主管部门批准。一一非历史建筑批准才能拆除
             任何单位或者个人不得损坏或者擅自迁移、拆除历史建筑(1-2012)。  一历史建筑绝对不能拆
 
     (三) 在文物保护单位保护范围和建设控制地带内从事建设活动的相关规定
 
             《文物保护法》规定，文物保护单位的保护范围内不得进行其他建设工程或者爆破、钻探、挖掘等作业。但是，因特殊情况需要在文物保护单位的保护范围内进行其他建设工程或者爆破、钻探、挖掘等作业的，经核定公布该文物保护单位的人民政府批准(1-2015)，在批准前应当征得上一级人民政府文物行政部门同意; 在全国重点文物保护单位的保护范围内进行其他建设工程或者爆破、钻探、挖掘等作业的，必须经省、自治区、直辖市人民政府批准，在批准前应当征得国务院文物行政部门同意。
 
             在文物保护单位的建设控制地带内进行建设工程，不得破坏文物保护单位的历史风貌。工程设计方案(施工方案X)应当根据文物保护单位的级别,经相应的文物行政部门同意后，报城乡建设规划部门批准
 */
#pragma mark 1Z305033 施工发现文物报告和保护的规定

/*
 
 《文物保护法》规定，地下埋藏的文物，任何单位或者个人都不得私自发掘
 
 一、配合建设工程进行考古发掘工作的规定一一大型基本建设工程，先考古调查勘探，再施工
 
     进行大型基本建设工程，建设单位应当事先报请省、自治区、直辖市人民政府文物行政部门组织考古调查、勘探。一省文物局组织考古调查、勘探
 
     确因建设工期紧迫或者有自然破坏危险，对古文化遗址、古墓葬急需进行抢救发掘的,  由省、自治区、直辖市人民政府文物行政部门组织发掘，并同时补办审批手续。  -只有省文物局有盗墓权
 
 二、施工发现文物的报告和保护一一一般建设工程，先施工，发现文物再保护和报告
 
     《文物保护法》规定，在进行建设工程或者在农业生产中，任何单位或者个人发现文物，应当保护现场，立即报告当地文物行政部门，文物行政部门接到报告后，如无特殊情况，应当在24小时(1-2013)内赶赴现场，并在7日内提出处理意见。
 
     依照以上规定发现的文物属于国家所有。
 
 三、水下文物的报告和保护
 
     《水下文物保护管理条例》规定，任何单位或者个人以任何方式发现遗存于中国内水、领海内的一切国起源于中国的、起源国不明的和起源于外国的文物，以及遗存于中国领海以外依照中国法律由中国管辖的其他海域内的起源于中国的、起源国不明的文物,应当及时报告国家文物局或者地方文物行政管理部门;已打捞出水的，应当及时上缴国家文物局或者地方文物行政管理部门处理。
 
     任何单位或者个人以任何方式发现遗存于外国领海以外的其他管辖海域以及公海区域内的起源于中国的文物，应当及时报告国家文物局或者地方文物行政管理部门; 已打捞出水的，应当及时提供国家文物局或者地方文物行政管理部门辨认、鉴定。
 
 */
#pragma mark 1Z305034 违法行为应承担的法律责任

/*
 
 五、水下文物保护违法行为应承担的法律责任
 
     《水下文物保护管理条例》规定，破坏水下文物，私自勘探、发掘、打捞水下文物，或者隐匿、私分、贩运、非法出售、非法出口水下文物，依法给予行政处罚或者追究刑事责任。
 
 
 */


#pragma mark - ************** 1Z306000 建设工程安全生产法律制度
/*
 */

#pragma mark ******* 1Z306010 施工安全生产许可证制度   （8分）
/*
 
 国家对矿山企业、建筑施工企业和危险化学品、烟花爆竹、民用爆炸物品生产企业(以下统称企业)实行安全生产许可制度。(不是日用化学品，不包括经营、储存单位)
 
 企业未取得安全生产许可证的，不得从事生产活动。省、自治区、直辖市人民 政府建设主管部门负责建筑施工企业安全生产许可证的颁发和管理，并接受国务院建设主管部门的指导和监督。
 
 */

 #pragma mark 1Z306011 【建设施工企业】申领安全生产许可证的条件（必考）
/*
 
 注释:施工许可证→建设单位;安全生产许可证→施工单位。
 
 (1)建立、健全 安全生产责任制 ，制定完备的安全生产规章制度和操作规程; （安全生产责任制）
 (2)保证本单位安全生产条件 所需资金的投入 ; （资金投入）
 (3)设置 安全生产管理机构 ，按照国家有关规定配备 专职 安全生产管理人员; （安全生产管理机构 专职人员）
 (4)主要负责人、项目负责人、专职安全生产管理人员经建设主管部门或者其他有关部门考核合格; （考核合格）
 (5)特种作业人员经有关业务主管部门考核合格，取得特种作业操作资格证书; （特种作业人员）
 (6)管理人员和作业人员每年至少进行一次安全生产教育培训并考核合格; （每年一次培训）
 (7)依法参加工伤保险，依法为施工现场从事危险作业的人员办理意外伤害保险， 为从业人员交纳保险费; （工伤保险、意外上海保险）
 (8)施工现场的办公、生活区及作业场所和安全防护用具、机械设备、施工机具及配件符合有关安全生产法律、法规、标准和规程的要求;
 (9)有职业危害防治措施，并为作业人员配备符合国家标准或者行业标准的安全防护用具和安全防护服装; （职业危害防治措施）
 (10)有对危险性较大的分部分项工程及施工现场易发生重大事故的部位、环节的预防、监控措施和应急预案;
 (11)有生产安全事故应急救援预案、应急救援组织或者应急救援人员，配备必要的应急救援器材、设备; （生产安全事故应急救援预案）
 (12)法律、法规规定的其他条件。
 
 建筑施工企业未取得安全生产许可证的，不得从事建筑施工活动
 
 */

#pragma mark  1Z306012 安全生产许可证的有效期和政府监管的规定
/*

 颁发机构:
     省级政府建设主管部门
 
 安全生产许可证的有效期为3年。
 安全生产许可证有效期满需要延期的，企业应当于期满前3个月向原安全生产许可证颁发管理机关办理延期手续
 企业在安全生产许可证有效期内，严格遵守有关安全生产的法律法规，未发生死亡事故的，安全生产许可证有效期届满时，经原安全生产许可证颁发管理机关同意，不再审查，安全生产许可证有效期延期3年。
 
 三、政府监管
 住房城乡建设主管部门在审核发放施工许可证时，应当对已经确定的建筑施工企业是否有安全生产许可证进行审查，对没有取得安全生产许可证的，不得颁发施工许可证。
 
 企业取得安全生产许可证后，不得降低安全生产条件。
 安全生产许可证颁发管理机关发现企业不再具备安全生产条件的，应当暂扣或者吊销安全生产许可证。
 
 安全生产许可证颁发管理机关或者其上级行政机关发现有下列情形之一的，可以撤销安全生产许可证:
     (1)安全生产许可证颁发管理机关工作人员滥用职权、玩忽职守颁发安全生产许可证的;
     (2)超越法定职权颁发安全生产许可证的;
     (3)违反法定程序颁发安全生产许可证的;
     (4)对不具备安全生产条件的建筑施工企业颁发安全生产许可证的;
     (5)依法可以撤销已经颁发的安全生产许可证的其他情形。
 
 注意撤销和注销的区别
 
 */

#pragma mark *******  施工安全生产责任和安全生产教育培训制度
/*
 
 */

#pragma mark 施工单位的安全生产责任(4制度、5责任)
/*
 施工单位的安全生产责任(4制度、5责任)
 4制度:
    安全生产责任制度，
    负责人现场带班制度，
    重大事故隐患治理挂牌督办制度，
    群防群治制度
 5责任(总包单位):
    明确总分包双方的安全生产责任，
    统一编制应急 救援预案，
    上报施工生产安全事故，
    自行完成主体结构的施工，
    连带责任
 
                                               三类人员的职责区分
 
 企业负责人(A证)                                  项目负责人(B证)                                       专职安全员(C证)
 建立生产责任制和生产教育培训制度           生产责任制、安全生产规章制度和操作规程                     施工现场安全生产日常检查并做好检查记录
 安全生产制度和操作规程                    根据工程的特点组织制定安全施工措施、                  现场监督危险性较大的工程安全专项施工方案的实施情况
 本单位安全生产条件                                  安全施工的                               对作业人员违规违章行为有权予以纠正或查处
 对承建工程进行定期和专项安全检查                       安全事故                                对施工现场存在的安全隐患有权责令立即整改
 及时、如实报告生产安全事故                      对建设工程的安全施工                          发现重大安全隐患，有权向企业安全生产管理机构报告
 对本单位的安全生产工作全面负责                                                                    依法报告生产安全事故情况
 
 注:建筑施工企业负责人，是指企业的法定代表人、总经理、主管质量安全和生产工作的副总经理、总工程师和副总工程师。
 
 
 【都是应当 不是必须】
                                时间要求                                                        工作要求
 企业负责人          定期带班检查，≥工作日的25%，应当施工现场带班检查，                         分别在公司和项目部存档备查
             超过一定规模的危险性较大的分部分项工程，工程项目出现险情或发现重大隐患时;
             对于有分公司的企业集团， 集团负责人可书面委托工程所在地分公司负责人带班检查。
 
 项目负责人                  ≥施工时间的80%                                              记录存档备查，全面掌握生产状况，
                                                                                     加强对重点关键环节的控制，及时
                                                                                     消除隐患，(向建设单位)，离开
                                                                                     期间委托项目相关负责人负责其外
                                                                                     出时的日常工作
 
 */

#pragma mark 施工总承包和分包单位的安全生产责任
/*
 
 《建筑法》规定，施工现场安全由建筑施工企业负责。实行施工总承包的，由总承包单位负责。分包单位向总承包单位负责，服从总承包单位对施工现场的安全生产管理。
 《安全生产法》规定，两个以上生产经营单位在同一作业区域内进行生产经营活动，可能危及对方生产安全的，应当签订安全生产管理协议，明确各自的安全生产管理职责和应当采取的安全措施，并指定专职安全员进行安全检查与协调。
 
 一、总承包单位应当承担的法定安全生产责任
    (一)分包合同应当明确总分包双方的安全生产责任
         施工总/分包单位的安全生产责任，分为法定责任和约定责任。
         约定责任不能与法定责任相抵触。
     (二)统一组织编制建设工程生产安全应急救援预案
         总包统一编，总分各自建。
     (三)负责上报施工生产安全事故
         无论是总包还是分包发生的安全事故均由总包上报
     (四)自行完成建设工程主体结构的施工
     (五)承担连带责任
         总承包单位和分包单位对分包工程的安全生产承担连带责任。
 二、分包单位应当承担的法定安全生产责任
 《安全条例》规定，分包单位应当服从总承包单位的安全生产管理，分包单位不服从管理导致生产安全事故的，由分包单位承担主要责任。
 
 */

#pragma mark 施工作业人员安全生产的权利和义务
/*
 
  一、施工作业人员依法享有的安全生产保障权利
        (一)施工安全生产的知情权和建议权
        (二)施工安全防护用品的获得权
            ——获得是权利，正确使用是义务
            施工安全防护用品一般包括安全帽、安全带、安全网、安全绳等。
        (三)批评、检举、控告权及拒绝违章指挥权  （有批评权）
        (四)紧急避险权
        (五)获得工伤保险和意外伤害保险赔偿的权利
        ( 六 ) 请求民事赔偿权
        ( 七 ) 依靠工会维权和被派遣劳动者的权利
 
 二、施工作业人员应当履行的安全生产义务
     遵章义务、培训义务、事故隐患报告义务
     (一)守法遵章和正确使用安全防护用具等的义务
         ——获得是权利，正确使用是义务
     (二)接受安全生产教育培训的义务
         ——建造师继续教育中，接受培训既是权利又是义务;
             安全生产中，接受培训只是义务    （只是义务）
     (三)施工安全事故隐患报告的义务 （报告是义务）
     (四)被派遣劳动者的义务
 《安全生产法》规定，生产经营单位使用被派遣劳动者的，被派遣劳动者应当履行本法规定的从业人员的义务。
 
 */

#pragma mark  施工单位安全生产教育培训的规定
/*
 
  一、施工单位三类管理人员与特种作业人员的培训考核
 (一)三类管理人员的培训考核
     《安全条例》规定，施工单位的主要负责人、项目负责人、专职安全生产管理人员应当经建设行政主管部门或者其他部门考核合格后方可任职。
 (二)特种作业人员的培训考核
     《安全条例》规定，垂直运输机械作业人员、安装拆卸工、爆破作业人员、起重信号工、登高架设作业人员等特种作业人员，必须按照国家有关规定经过专门的安全作业培训，并取得特种作业操作资格证书后，方可上岗作业。
 
     《建筑施工特种作业人员管理规定》规定，建筑施工特种作业包括:
         (1)建筑电工;（电焊工也是）
         (2)建筑架子工;
         (3)建筑起重信号司索工;
         (4)建筑起重机械司机;
         (5)建筑起重机械安装拆卸工;
         (6)高处作业吊篮安装拆卸工;
         (7)经省级以上人民政府建设主管部门认定的其他特种作业。
 
 二、施工单位全员的安全生产教育培训
     《安全条例》规定，施工单位应当对管理人员和作业人员每年至少进行一次安全生产教育培训。
 三、进入新岗位或者新施工现场前的安全生产教育培训
     建筑企业要对新职工进行至少32学时的安全培训，每年进行至少20学时的再培训。 （32 20）
 四、采用新技术、新工艺、新设备、新材料前的安全生产教育培训
 五、安全教育培训方式
 
     安全教育培训形式:安全形势报告会、事故案例分析会、安全法制教育、安全技术交流、安全竞赛、师傅带徒弟等。
 
     高危企业新职工安全培训合格后，要在工人师傅带领下，实习至少2个月后方可独立上岗。工人师傅应具备中级工以上技能等级，3年以上相应工作经历，成绩突出，善于“传、帮、带”，没有发生过“三违” 行为等条件。
 
 
 */



#pragma mark *******  施工现场安全防护制度
/*
 */
#pragma mark 编制安全技术措施、专项施工方案和安全技术交底的规定
/*

 一、编制安全技术措施和施工现场临时用电方案
    《施工现场临时用电安全技术规范》规定，施工现场临时用电设备在【5台】及以上或设备总容量在【50kW】及以上者，应编制【用电组织设计】。
    施工现场临时用电设备在5台以下或设备总容量在50kW以下者，应制定【安全用电和电气防火措施】。
 二、编制【安全专项施工方案】
    《安全条例》规定，对下列达到一定规模的危险性较大的分部分项工程编制【专项施工方案】，并附具安全验算结果，经【施工单位技术负责人、总监理工程师】签字后实施，由【专职安全员】进行现场监督:
     (1)基坑支护与降水工程;
     (2)土方开挖工程;
     (3)模板工程;
     (4)起重吊装工程;
     (5)脚手架工程;
     (6)拆除、爆破工程;
     (7)国务院建设行政主管部门或者其他有关部门规定的其他危险性较大的工程。
     对以上所列工程中涉及以下事项的 施工单位(——总承包) 还应当组织【专家论证】。 （施工单位组织论证）
     (1)深基坑、
     (2)地下暗挖工程、
     (3)高大模板工程的专项施工方案，
 
 
 
 */
#pragma mark 施工现场安全防护和安全费用的规定
/*
  一、施工现场安全防护
 (一)危险部位设置安全警示标志
     施工单位应当在【施工现场入口处】、施工起重机械、临时用电设施、脚手架、出入通道口、楼梯口、电梯井口、孔洞口、桥梁口、隧道口、【基坑边沿】、爆破物及有害危险气体和液体存放处等危险部位，设置明显的安全警示标志。
 
    不包括施工现场出口处、基坑底部
 
 (二)不同施工阶段和暂停施工应采取的安全施工措施
     《安全条例》规定，施工现场暂时停止施工的，施工单位应当做好现场防护，所需费用由责任方承担，或者按照合同约定执行。
 (三)施工现场临时设施的安全卫生要求
    《安全条例》规定，施工单位应当将施工现场的办公、生活区与作业区分开设置，并保持安全距离;办公、生活区的选址应当符合安全性要求。（办公、生活区可以混合）
    职工的膳食、饮水、休息场所等应当符合卫生标准。
    施工单位不得在尚未竣工的建筑物内设置员工集体宿舍。 （通过竣工验收也不行 只要尚未竣工就不行）
    施工现场临时搭建的建筑物应当符合安全使用要求。
    施工现场使用的装配式活动房屋应当具有产品合格证。
 
 (四)对施工现场周边的安全防护措施
    《安全条例》规定，施工单位对因建设工程施工可能造成损害的毗邻建筑物、构筑物和地下管线等，应当采取专项防护措施。
    在城市市区内的建设工程，施工单位应当对施工现场实行封闭围挡。
 
 (五)危险作业的施工现场安全管理
     《安全生产法》规定，生产经营单位进行爆破、吊装等危险作业，应当安排专门人员进行现场安全管理。
     《危险化学品安全管理条例》规定，进行可能危及危险化学品管道安全的施工作业，施工单位应当在开工的 【7日前】【书面通知】 管道所属单位，并与管道所属单位共同制定应急预案。（【7日 书面通知 施工单位 管道所属单位】）
 (六)安全防护设备、机械设备等的安全管理
     《安全条例》规定，施工单位采购、租赁的安全防护用具、机械设备、施工机具及配件，应当具有【生产(制造)许可证】、【产品合格证】（不是产品销售许可证），并在进入施工现场前进行查验。
 (七)施工起重机械设备等的安全使用管理
     《安全条例》规定，使用承租的机械设备和施工机具及配件的，由【施工总承包单位、分包单位、出租单位和安装单位】共同进行验收。(不需要设计、监理和建设单位验收)验收合格的方可使用。
 
 
 二、施工单位安全生产费用的提取和使用管理
 (一)施工单位安全费用的提取管理
     建设单位与施工单位在施工合同中对安全防护、文明施工措施费用预付、支付计划未作约定或约定不明的，
     合同工期在一年以内的，建设单位预付安全防护、文明施工措施项目费用不得低于该费用总额的【50%】;
     合同工期在一年以上的(含一年)，预付安全防护、文明施工措施费用不得低于该费用总额的【30%】，其余费用应当按照施工进度支付。
     【注意一年的计算】
 
     《建筑安装工程费用项目组成》，规定安全文明施工费包括:
         (1)环境保护费。
         (2)文明施工费。
         (3)安全施工费。
         (4)临时设施费。
 
 (二)施工单位安全费用的使用管理
     《企业安全生产费用提取和使用管理办法》中规定，建设工程施工企业安全费用应当按照以下范围使用:
         (1)完善、改造和维护安全防护设施设备支出(【不含“ 三同时”要求初期投入的安全设施】)，包括施工现场临时用电系统、洞口、临边、机械设备、高处作业防护、交叉作业防护、防火、防爆、防尘、防毒、防雷、防台风、防地质灾害、地下工程有害气体监测、通风、临时安全防护等设施设备支出;
         (2)配备、维护、保养应急救援器材、设备支出和应急演练支出;
         (3)开展重大危险源和事故隐患评估、监控和整改支出;
         (4)安全生产检查、评价(【不包括新建、改建、扩建项目安全评价】)、咨询和标准化建设支出;
         (5)配备和更新现场作业人员安全防护用品支出;
         (6)安全生产宣传、教育、培训支出;
         (7)安全生产适用的新技术、新标准、新工艺、新装备的推广应用支出;
         (8)安全设施及特种设备检测检验支出;
         (9)其他与安全生产直接相关的支出。
 
 在规定的使用范围内，企业应当将安全费用【优先用于】满足安全生产监督管理部门、煤矿安全监察机构以及行业主管部门对企业安全生产提出的【整改措施】或者达到安全生产标准所需的支出。
 工程总承包单位对建筑工程安全防护、文明施工措施费用的使用负总责。
 总承包单位应当按照本规定及合同约定及时向分包单位支付安全防护、文明施工措施费用。
 总承包单位不按本规定和合同约定支付费用，造成分包单位不能及时落实安全防护措施导致发生事故的，由总承包单位负主要责任。
 
 */
#pragma mark 施工现场消防安全职责和应采取的消防安全措施
/*
 
 一、施工单位消防安全责任人和消防安全职责
     机关、团体、企业事业单位法定代表人是本单位消防安全第一责任人。
     切实提高检查消除火灾隐患、组织扑救初起火灾、组织人员疏散逃生和消防宣传教育培训的能力。
     《消防法》规定，机关、团体、企业事业单位，对建筑消防设施每年至少进行一次全面检测。
     单位的主要负责人是本单位的消防安全责任人。
     重点工程的施工现场多位消防安全重点单位。
     注意还应当履行的四个特殊职责。
 二、施工现场的消防安全要求(了解具体要求)
 
 三、施工单位消防安全自我评估和防火检查
     消防安全重点单位每季度、其他单位每半年自行或委托有资质的机构对本单位进行一次消防安全检查评估。
     国家、省级等重点工程的施工现场应当进行每日防火巡查。
 五、施工单位的消防安全教育培训和消防演练
     施工单位应当建立施工现场消防组织，制定灭火和应急疏散预案，并至少每半年组织一次演练。 （消防演练半年一次）
 
 */
#pragma mark 工伤保险(强制)和意外伤害保险(鼓励)的规定
/*
 
 一、工伤保险的规定
     《工伤保险条例》规定，中国境内的企业、事业单位、社会团体、民办非企业单位、基金会、律师事务所、会计师事务所等组织和有雇工的个体工商户应当参加工伤保险。
 (一)工伤保险基金
     工伤保险基金由【用人单位缴纳的工伤保险费】、【工伤保险基金的利息】和依法纳入工伤保险基金的【其他资金】构成。
     用人单位应当按时缴纳工伤保险费。职工个人不缴纳工伤保险费。
     工伤保险基金存入社会保障基金财政专户，用于工伤保险待遇，劳动能力鉴定，工伤预防的宣传、培训等费用，以及法律、法规规定的用于工伤保险的其他费用的支付。
     任何单位或者个人不得将工伤保险基金用于投资运营、兴建或者改建办公场所、发放奖金，或者挪作其他用途。
 (二)工伤认定
     职工有下列情形之一的，应当认定为工伤:
         (1)在工作时间和工作场所内，因工作原因受到事故伤害的;
         (2)工作时间前后在工作场所内，从事与工作有关的预备性或者收尾性工作受到事故伤害的;
         (3)在工作时间和工作场所内，因履行工作职责受到暴力等意外伤害的;
         (4)患职业病的;
         (5)因工外出期间，由于工作原因受到伤害或者发生事故下落不明的;
         (6) 在上下班途中，受到非本人主要责任的交通事故或者城市轨道交通、客运 轮渡、火车事故伤害的;
         (7)法律、行政法规规定应当认定为工伤的其他情形。
     职工有下列情形之一的，视同工伤:
         (1)在工作时间和工作岗位，突发疾病死亡或者在48小时之内经抢救无效死亡的;
         (2)在抢险救灾等维护国家利益、公共利益活动中受到伤害的;
         (3)职工原在军队服役，因战、因公负伤致残，已取得革命伤残军人证，到用人单位后旧伤复发的。
     职工符合以上的规定，但是有下列情形之一的，不得认定为工伤或者视同工伤:
         (1)故意犯罪的;
         (2)醉酒或者吸毒的;
         (3)自残或者自杀的。
     (在施工现场斗殴受伤;施工期间醉酒坠落致残;在办公场所内因劳资纠纷自杀;因失恋，上班时间爬到公司楼顶跳楼自杀;精神抑郁，酗酒过度需要进行治疗;在工作场所与上司产生摩擦，拿剪刀将自己的胸脯刺伤。——均不是工伤。)
 
     职工发生事故伤害或者职业病，所在单位应当自事故伤害发生之日或者鉴定为职业病之日起30日内，提出工伤认定申请。用人单位未按以上规定提出工伤认定申请的，工伤职工或者其近亲属、工会组织在事故伤害发生之日或者鉴定为职业病之日起1年内，可以直接提出工伤认定申请 (——单位30日，个人1年)。
     用人单位未在以上规定的时限内提交工伤认定申请，在此期间发生的工伤待遇等有关费用由该用人单位负担。
 
     职工或者其近亲属认为是工伤，用人单位不认为是工伤的，由用人单位承担举证责任。
 
     社会保险行政部门应当自受理工伤认定申请之日起60日内作出工伤认定的决定。
     社会保险行政部门对受理的事实清楚、权利义务明确的工伤认定申请，应当在15日内作出工伤认定的决定
 
 二、建筑意外伤害保险的规定
     《建筑法》规定，鼓励企业为从事危险作业的职工办理意外伤害保险，支付保险费。（被保险人为从事危险作业人员）
     施工单位应当为施工现场从事危险作业的人员( 高处、深基坑、爆破作业)办理意外伤害保险。
     意外伤害保险费由施工单位支付。
     实行施工总承包的，由总承包单位支付意外伤害保险费。
 
     意外伤害保险期限自建设工程开工之日起至竣工验收合格止。
     保险费应当列入建筑安装工程费用。
     施工企业应在工程项目开工前，办理完投保手续。
 
 */
#pragma mark *******  施工安全事故的应急救援与调查处理

#pragma mark 生产安全事故的等级划分标准
/*
 生产安全事故划分要素:人身、经济、社会因素
 
 事故类别               死亡人数x      重伤人数y          直接经济损失z           罚款
 特别重大事故             x≥30        y≥100               z≥ 1亿元          500万≤y<1000 万
 重大事故               10≤x< 30     50≤y< 100          5000≤z<1亿 元      100万≤y<500 万
 较大事故               3≤x< 10      10≤y< 50           1000万≤z< 5000万   50万≤y<100万
 一般事故               x<3           y<10              z<1000万元           20万≤y<50万
 
 生产安全事故划分划分标准由国务院规定
 
 */

#pragma mark 生产安全事故报告
/*
 
 1.事故现场有关人员立即上报
 2.单位负责人(总承包的由总承包单位上报) 1h之内上报
        组织抢救
        保护现场
        及时上报
 
 3.县级建设、安监部门   2H之内逐级上报
 
 4.上级主管部门
 
 
 逐级上报至：
 特别重大事故         国务院
 重大事故
 
 较大事故           省级政府
 一般事故           市级政府
 
出现新情况应补报;30日内，伤亡数变化，应补报;交通、火灾7日内，伤亡变化的， 应补报
 
 报告事故内容:
    (1)事故发生单位概况;
    (2)事故发生的时间、 地点及事故现场情况;
    (3)事故的简单经过;
    (4)伤亡人数和直接经济损失;
    (5)已经采取的措施;
    (6)其他应当报告的情况
 
 
 二、发生施工生产安全事故后应采取的相应措施
 (一)组织应急抢救工作
     事故发生单位负责人接到事故报告后， 应当立即启动事故相应应急预案，或者采取有效措施，组织抢救，防止事故扩大，减少人员伤亡和财产损失。
 (二)妥善保护事故现场
     事故发生后有关单位和人员应当妥善保护事故现场以及相关证据，任何单位和个人不得破坏事故现场、毁灭相关证据。因抢救人员、防止事故扩大以及疏通交通等原因，需要移动事故现场物件的，应当做出标志，绘制现场简图并做出书面记录，妥善保存现场重要痕迹、物证。
 
     确因特殊情况需要移动事故现场物件的，须同时满足以下条件:
         (1)抢救人员、防止事故扩大以及疏通交通的需要;
         (2)经事故单位负责人或者组织事故调査的安全生产监督管理部门和负有安全生产监督管理职责的有关部门同意;
         (3)做出标志，绘制现场简图， 拍摄现场照片，对被移动物件贴上标签，并做出书面记录:
         (4)尽量使现场少受破坏。
 
 三、生产安全事故调查处理
 地域管辖:
     事故发生地政府
 
 级别管辖:
     特别重大事故     国务院
     重大事故        省级人民政府
     较大事故        市级人民政府
     一般事故        县级人民政府
     非死亡事故      委托事故发生单位
 
 
  上级政府认为必要，可调查下级政府负责调查事故。
 自事故发生之日起30日内(交通、火灾事故7日内)，因事故伤亡人数变化导致事故等级发生变化，可以另行组织事故调查组。
 事故调查组应自事故发生之日起60日提交调查报告，特殊情况最长可延长60日
 
 
 事故调查组由
     1有关人民政府、
     2安监部门、
     3负有安监职责的有关 部门、
     4监察机关、
     5公安机关以及
     6工会派人组成，并应当邀请
     7人民检察院派人参加。——不包括人民法院。
 事故调査组履行下列职责:
     (1)査明事故发生的经过、原因、人员伤亡情况及直接经济损失;
     (2)认定事故的性质和亊故责任;
     (3) 提出对亊故责任者的处理建议;
     (4)总结事故教训，提出防范和整改措施;
     (5)提交事故调査报告。
 事故调査报告应当包括下列内容:
     (1)事故发生单位概况;
     (2)事故发生经过和事故救援情况;
     (3)事故造成的人员伤亡和直接经 济损失;
     (4)事故发生的原因和事故性质;
     (5)事故责任的认定以及对事故责任者的处理建议;
     (6)事故防范和整改措施。
 */

#pragma mark *******  建设单位和相关单位的建设工程安全责任制度

/*
 
 责任主体                                安全生产责任
 
 建设单位          (1)编制工程概算时，应当确定建设工程安全生产所需费用;
                 (2)申请领取施工许可证时提供有关的安全施工措施的资料;
                 (3)涉及建筑主体和承重结构变动的装修工程，建设单位应当在施工前委托原设计单位或者具有相应资质条件的设计单位提出设计方案;没有设计方案的，不得施工。
 
 设计单位         (1)对涉及施工安全的重点部位和环节在设计文件中注明，并对防范生产安全事故提出指导意见。
                 (2)采用新结构、新材料、新工艺的建设工程和特殊结构的建设工程，设计单位应当在设计中提出保障工作作业人员安全和预防安全事故的措施建议。
 
 监理单位         (1)发现存在安全 【事故隐患】的，应当要求施工单位 【整改】;
                (2)【情况严重】 的应当要求施工单位 【暂时停止施工，并及时报告建设单位】;
                (3)施工单位拒不整改或不停止施工的，工程监理单位【应当及时向有关主管部门报告】。
 
 安装拆卸单位     (1)必须由具有相应资质的单位承担;
                (2)应当编制拆装方案、制定安全施工措施，并由专业技术人员现场监督;
                (3)安装完毕后，安装单位应当自检，出具自检合格证明，并向施工单位进行安全使用说明，办理验收手续并签字。
 */
#pragma mark - ************** 建设工程质量法律制度

#pragma mark ***** 工程建设标准

#pragma mark 工程建设标准的分类
/*
 工程建设标准的分类
 
     我国的标准分为国家标准、行业标准、 地方标准和企业标准。
 
     国家标准、行业标准分为强制性标准和推荐性标准。
         保障人体健康，人身、财产安全的标准和法律、行政法规规定强制执行的标准是强制性标准，其他的标准是推荐性标准。
 【强制性和推荐性的区分】
 
     工程建设国家标准的制订程序分为准备、征求意见、送审和报批四个阶段
 
 国家强制性标准:（通用的属于国家强制性标准）
     (1)工程建设勘察、规划、设计、施工(包括安装)及验收等通用的综合标准和重要的通用的质量标准
     (2)工程建设【通用】的有关安全、卫生和环境保护的标准
     (3)工程建设重要的通用的术语、符号、代号、计量与单位、建筑模数和制图方法标准
     (4)工程建设重要的通用的试验、检验和评定方法等标准
     (5)工程建设重要的通用的信息技术标准。
 一般国家标准【实施】后5年复审1次  （不是颁布后）
 
 行业标准强制性标准（行业的属于行业标准）
     (1)工程建设勘察、规划、设计、施工(包括安装)及验收等行业专用的综合性标准和重要的行业专用的质量标准
     (2)工程建设【行业】专用的有关安全、卫生和环境保护的标准
     (3)工程建设重要的行业专用的术语、符号、代号、计量与单位和制图方法标准
     (4)工程建设重要的行业专用的试验、检验和评定方法等标准
     (5)工程建设重要的行业专用的信息技术标准
 行业标准不得与国家标准相抵触。
 在公布国家标准之后，该项行业标准即行废止。
 一般实施后5年复审1次
 
 工程建设地方标准
     没有国家标准、行业标准或不具体，可制定地方标准
     对直接涉及人民财产安全、人体健康、环境保护和公共利益的条文，经国务院建设行政主管部门确定后，可作为强制性条文
     地方标准不得与国家标准和行业标准相抵触。相抵触的工程建设地方标准的规定，应当自行废止
 
 
 工程建设企业标准
     企业生产的产品没有国家标准和行业标准的，应当制定企业标准，作为组织生产的依据
     已有国家标准或者行业标准的，国家鼓励企业制定严于国家标准或者行业标准的企业标准，在企业内部适用
 */

#pragma mark 工程建设强制性标准实施的规定
/*
 工程建设标准强制性条文的实施:工程建设各方主体。
     (1)工程建设强制性标准是指直接涉及工程质量、安全、卫生及环境保护等方面的工程建设标准强制性条文。
         由国务院住房城乡建设主管部门会同国务院有关部门确定。
     (2)建设工程勘察、设计文件中规定采用的新技术、新材料，可能影响建设工程质量和安全，又没有国家技术标准的，应当由国家认可的检测机构进行试验、论证，出具检测报告，并经国务院有关主管部门或者省、自治区、直辖市人民政府有关主管部门组织的建设工程技术专家委员会审定后，方可使用。
     (3)工程建设中采用国际标准或者国外标准，而我国现行强制性标准未作规定的，建设单位应当向国务院住房城乡建设主管部门或者国务院有关主管部门备案。
 */
#pragma mark ***** 施工单位的质量责任和义务
/*
 《建筑工程五方责任主体项目负责人质量终身责任追究暂行办法》 (2014)规定:
     建筑工程开工建设前，建设、勘察、设计、施工、监理单位法定代表人应当签署授权书，明确本单位项目负责人。 （是项目负责人 不是单位负责人）
     建筑工程五方责任主体项目负责人质量终身责任，是指参与新建、 扩建、改建的建筑工程项目负责人按照国家法律法规和有关规定， 在工程设计使用年限内对工程质量承担相应责任。
     工程质量终身责任实行书面承诺和竣工后永久性标牌等制度。
 
 */
#pragma mark 对施工质量负责和总分包单位的质量责任
/*
    一、施工单位对施工质量负责
         施工单位应当建立质量责任制，确定工程项目的项目经理、技术负责人和施工管理负责人
         建设工程质量责任与施工质量责任的主体不同
         施工单位是建设工程质量的重要责任主体，但不是唯一的责任主体
 二、总分包单位的质量责任
         建筑工程实行总承包的，工程质量由工程总承包单位负责。
         《建设工程质量管理条例》规定，总承包单位依法将建设工程分包给其他单位的，分包单位应当按照分包合同的约定对其分包工程的质量向总承包单位负责，总承包单位与分包单位对分包工程的质量承担连带责任。
         分包单位应当接受总承包单位的质量管理，就其分包工程，按分包合同的约定，向总承包单位负责。
         对外连带，对内追偿。
 
 */
#pragma mark 按照工程设计图纸和施工技术标准施工的规定
/*
 
     施工单位必须按照工程设计图纸和施工技术标准施工 ，发现有差错，及时提出意见;
     工程设计修改由原设计单位负责，施工单位不得擅自修改。
     施工单位必须按照工程设计要求、施工技术标准和合同约定，对建筑材料、建筑构配件、设备和商品混凝土进行检验，检验应当有书面记录和专人签字;未经检验或检验不合格的，不得使用。
     如果施工单位没有按照工程设计图纸和施工技术标准施工，则属于违约行为，应该对建设单位承担违约责任。
 
 */
#pragma mark 对建筑材料、设备等进行检验检测的规定
/*
 
     建筑施工企业必须按照【工程设计要求、施工技术标准和合同的约定】， 对建筑材料、建筑构配件、设备和商品混凝土进行检验，不合格的不得使用。
     涉及结构安全的试块、试件及有关材料，应在建设单位或监理单位监督下取样，并送相应检测机构检验
 
     见证取样和送检，是指在建设单位或工程监理单位人员的见证下， 由施工单位的现场试验人员对工程中【涉及结构安全】的试块、试件和材料在现场取样，并送至具有法定资格的质量检测单位进行检测的活动。
     见证取样和送检的比例不得低于应取样数量的【30%】

     必须【实施见证取样和送检】:
         用于承重结构的混凝土试块;
         用于承重墙体的砌筑砂浆试块;
         用于承重结构的钢筋及连接接头试件;
         用于承重墙的砖和混凝土小型砌块;
         用于拌制混凝土和砌筑砂浆的水泥;
         用于承重结构的混凝土中使用的掺加剂;
         地下、屋面、厕浴间使用的防水材料;
         国家规定其它试块、试件和材料。

     见证人员应由建设单位或监理单位中具备施工试验知识的专业技术人员担任，并由建设单位或监理单位书面通知施工单位、 检测单位和负责该工程的质量监督机构。
 
     (5)【取样人员】应在试样或其包装上作出标识、封志。标识和 封志应标明【工程名称、取样部位、取样日期、样品名称和样品数量】，并由【见证人员和取样人员】签字。
 
 (二)工程质量检测机构的资质和检测规定
     (1)工程质量检测机构是具有独立法人资格的中介机构。
     (2)检测机构资质分为专项检测机构资质和见证取样检测机构资质。
         检测机构未取得相应的资质证书，不得承担本办法规定的质量检测业务。
     (3)检测报告经检测人员签字、检测机构法定代表人或者其授权的签字人签署，并加盖检测机构公章或者检测专用章后方可生效。
         检测报告经建设单位或者工程监理单位确认后，由施工单位归档。
         质量检测业务由工程项目建设单位委托具有相应资质的检测机构进行检测。
 
         如果检测结果利害关系人对检测结果发生争议的，由双方共同认可的检测机构复检，复检结果由提出复检方报当地建设主管部门备案。

     (4)检测机构应当将检测过程中发现的建设单位、监理单位、施工单位违反有关法律、法规和工程建设强制性标准的情况，以及涉及结构安全检测结果的不合格情况，及时报告工程所在地建设主管部门。检测机构应当建立档案管理制度，并应当单独建立检测结果不合格项目台账。
     (5)检测人员不得同时受聘于两个或者两个以上的检测机构。检测机构和 检测人员不得推荐或者监制建筑材料、构配件和设备。检测机构不得与行政 机关，法律、法规授权的具有管理公共事务职能的组织以及所检测工程项目相关的设计单位、施工单位、监理单位有隶属关系或者其他利害关系。
     (6)检测机构不得转包检测业务。
 */
#pragma mark ***** 建设单位及相关单位的质量责任和义务
/*
 
 责任主体                                                           质量责任
 建设单位
            (1)建设单位应当将施工图设计文件报县级以上人民政府建设行政主管部门或者其他有关部门审查;
            (2)建设单位在领取施工许可证或者开工报告前，应当按照国家有关规定办理工程质量监督手续;
            (3)涉及建筑主体和承重结构变动的装修工程，建设单位应当在施工前委托原设计单位或者具有相应资质条件的设计单位提出设计方案;没有设计方案的，不得施工。
 设计单位
            (1)设计单位在设计文件中选用的建筑材料、建筑构配件和设备， 应当注明规格、型号、性能等技术指标，其质量要求必须符合国家规定的标准;
            (2)除有特殊要求的建筑材料、专用设备、工艺生产线等外，设计单位不得指定生产厂、供应商。
 监理单位
            (1)工程监理单位与被监理工程的施工承包单位以及建筑材料、建 筑构配件和设备供应单位不得有隶属关系或者其他利害关系的，不得承担该项建设工程的监理业务;
            (2)未经监理工程师签字，建筑 材料、建筑构配件和设备不得在工程上使用或者安装，施工单位不得进行下一道工序的施工;
            (3)未经总监理工程师签字，建设单位不拨付工程款，不进行竣工验收。
 */
#pragma mark ***** 建设工程竣工验收制度
/*
 竣工验收主体
     建设单位收到建设工程竣工报告后，应组织设计、施工、监理等单位进行竣工验收
 
 建设工程竣工验收应具备条件 （不包括竣工相关的文件）
        完成建设工程设计和合同约定的各项内容
        有完整的技术档案和施工管理资料
        有工程使用的主要建筑材料、建筑构配件和设备的进场试验报告【不包括建筑装饰辅助材料】
        有勘察、设计、施工、工程监理等单位分别签署的质量合格文件
        有施工单位签署的工程保修书
 
 
 二、竣工工程质量争议的处理
         《质量条例》规定，施工单位对施工中出现质量问题的建设工程或者竣工验收不合格的建设工程，应当负责返修。
         据此，建设工程竣工时发现的质量问题或者质量缺陷，无论是建设单位的责任还是施工单位的责任，施工单位都有义务进行修复或返修。
         但是，对于非施工单位原因出现的质量问题或质量缺陷，其返修的费用和造成的损失是应由责任方承担的。
 (1)承包方责任的处理
         《解释》规定，因承包人的过错造成建设工程质量不符合约定，承包人拒绝修理、返工或者改建，发包人请求减少支付工程价款的，应予支持。
 (2)发包方责任的处理
         《解释》规定，发包人具有下列情形之一，造成建设工程质量缺陷，应当承担过错责任:
         1)提供的设计有缺陷;
         2)提供或者指定购买的建筑材料、建筑构配件、设备不符合强制性标准;
         3)直接指定分包人分包专业工程。
 (3)未经竣工验收擅自使用的处理
        《建筑法》规定，建设工程竣工经验收合格后，方可交付使用。
        《解释》规定，建设工程未经竣工验收，发包人擅自使用后，又以使用部分质量不符合约定为由主张权利的，不予支持;
        但是承包人应当在建设工程的合理使用寿命内对地基基础工程和主体结构质量承担民事责任
 
 */
#pragma mark ***** 建设工程质量保修制度
/*
     建设工程质量保修制度，是指建设工程竣工经验收后，在规定的保修期限内，因勘察、设计、施工、材料等原因造成的质量缺陷，应当由【施工承包单位】负责维修、返工或更换，由【责任单位】负责赔偿损失的法律制度。
     建设工程承包单位在向建设单位提交工程竣工验收报告时，应当向建设单位出具质量保修书。
     质量保修书中应明确保修范围、保修期限、保修责任等。
     因建设单位或者用户使用不当或擅自改动结构、设备位置以及不当装修等造成质量问题的，施工单位不承担保修责任;由此而造成的质量受损或者其他用户损失，应当由责任人承担相应的责任。
 
 【在规定的保修期限内，因勘察、设计、施工、材料等原因造成的质量缺陷】
 【使用不当或擅自改动结构、设备位置以及不当装修等造成质量问题的】
 
 
 最低保修期限：（竣工验收合格之日起）（这里是最低保修期  大于这个年限都是符合要求的）
         基础设施、房屋建筑地基基础和主体结构工程   —— 合理使用年限
         屋面防水、有防水要求的卫生间、房间和外墙面的防渗漏  ——  5年
         供热和供冷系统    ——  2个采暖期、供冷期
         电气管线、给排水管道、设备安装和装修 ——  2年
 
 因建设单位或用户使用不当或擅自改动结构、设备位置、第三方、不可抗力等，施工单位不保修
 超出合理使用年限后如需继续使用，产权所有人应委托具有资质的勘察、设计单位鉴定，并根据鉴定结果加固、维修等，重新界定使用期。违法使用，后果产权人自负
 
 
 《质量条例》规定，建设工程在保修范围和保修期限内发生质量问题的，施工单位应当履行保修义务，并对造成的损失承担赔偿责任。
 因保修人未及时履行保修义务，导致建筑物损毁或者造成人身、财产损害的，保修人应当承担赔偿责任。
 保修人与建筑物所有人或者发包人对建筑物毁损均有过错的，各自承担相应的责任。
 
 质量损失赔偿责任的承担
         施工单位过错，施工单位返修并赔偿
         设计问题，先由施工单位维修，再通过建设单位向设计单位追偿
         材料问题，先由施工单位维修，谁采购谁承担责任
         建设单位问题，先由施工单位维修，责任建设单位承担;监理单位问题，建设单位向监理单位索赔
         使用不当问题，先由施工单位维修，使用单位负责
         自然灾害损坏，先由施工单位维修，各方根据国家政策分担
 
总结:谁过错谁承担，先由施工单位维修为原则
 */
#pragma mark - ************** 民事诉讼制度
#pragma mark 【本章基本框架】
/*
 
 
 民事纠纷 (民~民)
     私了
        和解
        调解
     公了
        仲裁或诉讼
        (适用诉讼时效)
 行政纠纷 （民~官）
     公了
         60天内 行政复议 （15天内 行政诉讼）
         6个月内 行政诉讼
 */
#pragma mark 民事纠纷解决途径
/*
 民事纠纷解决途径
     和解:可以在民事纠纷任何阶段
     调解:人民、行政、仲裁、司法、行业调解
     仲裁:仅限于合同纠纷和其他财产纠纷
     诉讼:公权性、程序性、强制性
 
                    民事诉讼                           民事仲裁
 
 发动             无须约定(强制性)                   须有书面仲裁协议(自愿性)
 
 管辖            法定(合同纠纷除外)                  约定1个仲裁委员会
             法院之间有隶属关系:基层、            仲裁委员会不隶属于行政机关，
                中级、高级和最高                    互相之间也无隶属关系
 
 程序             严格依法律规定                 根据《仲裁规则》，当事人协议
 审理             一般应公开                       一般不公开(保密)
 终局             二审终审                            一裁终局
 组织属性       法院——司法机关                    仲裁委员会——民间团体
 范围          任何纠纷均可诉讼                  《仲裁法》仅限于民商事仲裁
 
 执行        一审法院或与一审法院同级的            被执行人(或财产)所在地中级法院
            被执行财产所在地法院
 
 
 翻案         再审——法院                          不予执行和撤销——法院
 
 */
#pragma mark 地域管辖
/*
 地域管辖
     一般地域:原告就被告
         公民:
             由被告住所地法院管辖;住所地与经常居住地不一致，由经常居住地法院管辖(连续居住满1年地方)
         法人:
             住所地指主要办事机构所在地，主要办事机构所在地不能确定的，法人或者其他组织的注册地或者登记地为住所地
 
         同一诉讼几个被告的，可以向任何一个被告住所地或经常居住地人民法院起诉
 
     特殊地域管辖
         因合同纠纷提起的诉讼，由被告住所地或者合同履行地人民法院管辖——法定管辖
         当事人可以在合同中协议选择由被告住所地、合同履行地、合同签订地、原告住所地、标的物所在地的人民法院管辖 ——协议管辖
     专属地域管辖:
         排除法定管辖和协议管辖
         不动产纠纷在不动产所在地法院管辖，如房屋买卖纠纷、土地
         使用权转让纠纷、建设工程施工合同纠纷——专属管辖
 
 专属管辖 协议管辖 法定管辖
 
 */
#pragma mark 民事诉讼当事人和代理人的规定
/*
 当事人 (自己名义参加诉讼)
     原告
     被告
     共同诉讼人(原告或被告为两人以上)
     第三人(独立诉求或利害关系)
 
 诉讼代理人
     法定/指定代理:
         未成年人或精神病人
     委托代理人
         一般授权
         特别授权:有权承认、放弃、变更诉求;和解;上诉、反诉
         全权代理为一般授权
 */
 #pragma mark 证据的种类
/*
 
 书证                     以文字、符号证明案件事实    合同文本、信函、电报、传真、图纸  （法律条文、行业规范不是书证）
 
 物证                     用物品的外形、特征、质量等证明:建材、设备、工程质量
 
 视听资料                 偷录的谈话记录可以作证，但侵犯隐私或窃听不行
 
 证人证言                 单位证人、 自然人证人     能正确表达意志
 
 当事人陈述               原告、被告、共同诉讼人、第三人(只有本人陈述，无其他证据，主张不予支持，对方认可除外)
 
 鉴定意见                工程质量、技术、造价、伤残、笔迹鉴定
 
 勘验笔录                应由勘验人、当事人和被邀请参加人签名或盖章
 
 电子数据                电子邮件、电子聊天记录、电子数据交换、电子资金划拨、电子公告牌记录、电子签名、移动电话记录、短信
 
 */
#pragma mark 证据应用
/*
 认证
     不能作为证据情况
         调解中认可的事实
         违法取得的证据(侵犯隐私、窃听)
         当事人只有本人陈述的主张(对方认可的除外)
     不能单独作为认定事实的证据
         未成年人作出与其年龄和智力不相当的证言
         与一方有利害关系的证人出具的证言
         存在疑点的视听资料
         无法与原件、原物核对的复印件
         无正当理由未出庭作证的证人证言
 
 */
#pragma mark 民事诉讼时效的规定
/*
 
 胜诉权消灭(可以起诉，法院应受理)
 实体权不消灭(自愿履行，法律保护)
 
 
 诉讼时效期间的种类
        普通诉讼时效期间(2年) （新的诉讼法规定为3年）
        最长诉讼时效期间(20年)
        特别诉讼时效期间
            1年:
                 身体受伤害;
                 出售质量不合格商品未声明;
                 拒付延付租金;
                 寄存财物丢失损毁。
            3年:
                 污染环境损害赔偿;
                 船舶发生油污损害
                 海上货物运输请求权1年
            4年:
                 国际货物买卖合同、技术进出口合同争议
 
 诉讼时效的中止
         在诉讼时效期间的最后6个月，因不可抗力或其它障碍不能行使请求权的， 诉讼时效中止，中止原因消除，时效继续计算。
 诉讼时效的中断
         从中断时起，诉讼时效重新计算。
        诉讼时效中断事由：
            提起诉讼;
            债权人提出要求;
            债务人同意履行义务
 
 
 */
#pragma mark 民事诉讼的审判程序
/*
 
 一审程序（普通和简易审理）
 
    起诉和受理
            起诉条件
                 有直接利害关系;
                 明确被告;
                 具体诉求、事实和理由;
                 属于民诉范围和法院管辖
            受理:7日
     审理前准备工作
            提交答辩状:被告15日内
            组成合议庭:3人或5人
     开庭审理
            法庭调查:出示与案件有关的全部证据
            法庭辩论:针对有争议的事实和法律问题
            法庭笔录:审判员和书记员签名，且当庭宣读
            宣判:必须告知当事人上诉权利、期限和法院
 
 
 二审程序
 
    上诉期间:判决书送达之日起15内;裁定书10日
    上诉状:应通过原审法院递交上诉状
    对上诉案件的裁判
         维持原判:事实清楚，法律正确
         改判、撤销或变更:事实或法律错误
         发回重审或改判:认定事实不清
         发回重审:遗漏当事人或违法缺席判决（不能改判）
 
 审判监督程序:再审程序
 
 
 */
#pragma mark - ************** 仲裁制度
/*
 
 仲裁
 
 适用范围
    仅限于民商事仲裁:   仅限于合同纠纷和其他财产纠纷
    不适用仲裁法的纠纷
        婚姻、收养、监护、扶养、继承、劳动纠纷
        依法应当由行政机关处理的行政争议
 仲裁的基本特点
 
     自愿性:仲裁协议
     专业性:专家仲裁
     独立性:无隶属关系
     保密性:依不公开审理为原则
     快捷性:一裁终局
     强制性和广泛性:法院强制且缔约国承认和执行
 
 协议仲裁制度:没有协议，仲裁委不受理
 或裁或审制度:两个都选，协议无效，由法院管辖
 一裁终局制度:不绝对
 
 
 仲裁协议的内容 (应当书面)
     请求仲裁的意思表示
     仲裁事项
     选定的仲裁委员会
 内容不全，协议补充;否则协议无效，由法院管辖
 仲裁协议的约定方式：1、在合同中以仲裁条款的形式约定 2、事后协议
 
 
 仲裁裁决自作出之日起发生法律效力
     当事人不得就已经裁决的事项再行申请仲裁，也不得就此提起诉讼。
     仲裁裁决具有执行力
 仲裁调解书自双方签收时生效
 
 裁决应当按照多数仲裁员的意见作出，少数仲裁员的不同意见可以记入笔录。仲裁庭不能形成多数意见时，裁决应当按照首席仲裁员的意见作出
 
 仲裁协议效力的确认
     有异议，在首次开庭前提出;
     仲裁协议独立存在，合同无效不影响
     一方请仲裁委，另一方请法院，法院裁定(仲裁机构所在地中院)
 */
#pragma mark - ************** 行政复议和行政诉讼制度
/*
 行政许可
 行政处罚
 行政强制
 行政复议
 行政诉讼
 
 
 复议前置，复议终局
 
有的必须先行政复议后行政诉讼
有的可行政复议可行政诉讼
有的只能行政复议
 
 
 
 行政强制执行
     (1)行政强制执行的方式:
         1加处罚款或者滞纳金;
         2划拨存款、汇款;
         3拍卖或者依法处理查封、扣押的场所、设施或者财物;
         4排除妨碍、恢复原状;
         5代履行;
         6其他强制执行方式。
 
     行政强制的程序
         没有行政强制执行权的行政机关可以自期限届满之日起3个月内申请人民法院强制执行。
         强制执行的费用由被执行人承担。
     行政强制措施的设定
         不得在夜间或者法定节假日实施强制，紧急情况除外
         不得对居民采用停止供水、供电、供热、供燃气等方式迫使当事人履行
         对违法建筑物拆除，应先公告，限期自行拆除。法定期限不复议或诉讼，又不拆除，可强制拆除
 
 */
 #pragma mark 行政复议的范围、受理和复议决定
/*
 
 可以申请行政复议(具体行政行为)
 
     (1)行政处罚:罚款、拘留、吊照、撤销、没收
     (2)行政强制:查封、扣押、冻结、拍卖、划拨
     (3)行政许可:施工许可、安全许可、营业执照
     (4)行政侵权:人身权、财产权
     (5)行政不作为:不发执照、证书、抚恤金
     (6)其他具体侵犯其合法权益行为
 对拘役（刑罚）不服的 不能提起行政复议
 
 
 不得申请行政复议
     (1)行政处分、行政奖励或其他人事处理
     (2)行政机关调解或者行政指导
     (3)行政法规、文件(法、条例、规定、办法、细则)
     (4)政府国防、外交行为
 
 注意:与行政诉讼范围大体相同
 
 行政复议申请
     申请期限:知道之日60天
     可自己，可委托;可书面，可口头
     复议机关:
         对县以上政府工作部门的具体行政行为不服的，可以向该部门的本级人民政府，也可以向上一级主管部门
     复议不诉讼，诉讼不复议
 
 行政复议受理
     具体行政行为不停止执行
     停止执行
        被申请人认为需要停止;
        复议机关认为需要停止;
        申请人申请停止，复议机关认为合理
 
 行政复议决定
     (1) 事实、证据、依据正确，内容适当的，决定维持;
     (2)被申请人不履行法定职责的，决定其在一定期限内履行
     (3)决定撤销、变更或者确认该具体行政行为违法;
     (4)被申请人不按法律规定提出书面答复、提交当初作出具体行政行为的证据、依据和其他有关材料的，视为该具体行政行为没有证据、依据，决定撤销该具体行政行为。
 
 */
#pragma mark 行政诉讼制度
/*
 
 第一审程序
     管辖:最初做出地法院，复议改变两被告，人身自由原被告，最先立案不动产
     起诉:具体行政行为之日6个月或复议决定15日
     审理:不适用调解，行政赔偿、补偿、自由裁量权例外
 
 判决
     驳回原告诉讼请求
     撤销判决，并可判决重新作出行政行为
     履行判决:不作为行为
     变更判决:行政处罚显失公平或及对款额认定有错误
 
 第二审程序
     上诉期限:判决15日或裁定10日
     上诉判决:维持原判;依法改判;发回重审或改判
 
 再审程序:向上一级人民法院
 执 行:公民、法人拒绝履行判决、裁定的，行政机关可以向 第一审人民法院申请强制执行，或者依法强制执行。
 国家赔偿:行使职权，人身权和财产权;个人行为和自己行为国家不赔
 
 
 对于不接收起诉状、接收起诉状后不出具书面凭证，以及不一次性告知 当事人需要补正的起诉状内容的，当事人可以向上级人民法院投诉
 人民法院既不立案，又不作出不予立案裁定的，当事人可以向上一级人民法院起诉
 行政行为所依据的国务院部门和地方人民政府及其部门制定的规范性文 件(不含规章)不合法，提起诉讼时，可以一并请求对该规范性文件进行审查
 
 行政案件的审理程序
         (1)行政争议未经行政复议的，应当自知道作出具体行政行为之日起6个月内起诉
         (2)经过行政复议但对行政复议决定不服而依法提起行政诉讼的， 应当在收到行政复议决定书之日起15日内起诉
         (3)法院审理行政案件不适用调解，但行政赔偿诉讼可以调解
         (4)行政诉讼期间，除该法规定的情形外，不停止具体行政行为的 执行。
             除涉及国家秘密、个人隐私和法律另有规定的外，人民法院应当公开审理行政案件。
             涉及商业秘密的案件，当事人申请不公开审理的， 可以不公开审理。
             人民法院审理行政案件，不适用调解。但是，行政赔偿、补偿以及行政机关行使法律、法规规定的自由裁量权的案件可以调 解。
         (5)人民法院审理行政案件，以【法律和行政法规、地方性法规】为依据。
             审理民族自治地方的行政案件，并以该民族自治地方的自治条例和 单行条例为依据。人民法院审理行政案件，参照规章。
 
 
 行政诉讼与民事诉讼比较
         (1)在行政诉讼中，被告对其作出的具体行政行为负有举证责任(民事诉讼"谁主张，谁举证”)
         (2)在行政诉讼过程中，被告不得自行向原告和证人收集证据
         (3)行政诉讼上诉审不受上诉范围限制，应进行全面审查(民事诉讼只审查上诉请求的范围)
         (4)必须组成合议庭(民事诉讼简易程序独任审理)
         (5)不能调解(行政赔偿诉讼可以调解，民事诉讼都可以调解)
 
     侵权的赔偿责任
     行使行政职权时侵权的赔偿责任
     赔偿诉讼可以适用调解。
     行政机关及其工作人员在行使行政职权时侵犯人身权和财产权的行为，受害人有取得赔偿的权利。
 属于下列情形之一的，国家不承担赔偿责任:
         1行政机关工作人员与行使职权无关的个人行为;
         2因公民、法人和其他组织自己的行为致使损害发生的;
         3法律规定的其他情形。
 */














