#pragma mark - ************** 理论
#pragma mark 主体  法人
#pragma mark 客体  物权
#pragma mark 行为  代理
#pragma mark 责任


#pragma mark - ************** 1Z301010 建设工程法律体系

#pragma mark 法律体系框架 （建筑法属于行政法）
/*
 【重点】
 某法律部门包括哪些法律
 某部法律属于哪个法律部门

 
 部门法 根据一定标准、原则所制定的同类法律规范的总称
 
 一、宪法及宪法相关法
     宪法相关法
         是指《中国人民代表大会组织法》、《地方各级人民代表大会和地方各级人民政府组织法》、《中华人民共和国国籍法》、《中华人民共和国国务院组织法》、《中华人民共和国民族区域自治法》等法律
 
 二、民法商法
     民法是规定并调整平等主体的公民间、法人间及公民与法人间的财产关系和人身关系的法律规范的总称。
     商法是调整市场经济关系中商人及其商事活动的法律规范的总称。
     我国采用的是民商合一的立法模式。商法被认为是民法的特别法和组成部分。
     《民法通则》、《合同法》、《物权法》、《侵权责任法》、《公司法》、《招标投标法》等属于民法商法
 
 三、行政法
     作为行政法调整对象的行政关系，主要包括行政管理关系、行政法制监督关系、行政救济关系、内部行政关系 。
     《行政处罚法》、《行政复议法》、《行政许可法》、《环境影响评价法》、《城市房地产管理法》、《城乡规划》、《建筑法》等属于行政法。
 
 四、经济法
     经济法是调整在国家协调、干预经济运行的过程中发生的经济关系的法律规范的总称。
     《统计法》、《土地管理法》、《标准化法》、《税收征收管理法》、《预算法》、《审计法》、【《节约能源法》】、《政府采购法》、《反垄断法》等属于经济法。
 五、社会法
     社会法是调整劳动关系、社会保障和社会福利关系的法律规范的总称。
     《残疾人保障法》、《矿山安全法》、《劳动法》、《职业病防治法》、《安全生产法》、《劳动合同法》等属于社会法。
     《劳动合同法》≠《合同法》 ；《合同法》属于民法商法
 
 六、刑法
     《刑法》是这一法律部门的主要内容。
 
 七、诉讼与非诉讼程序法
 
 我国三大诉讼法 《民事诉讼法》、《行政诉讼法》、《刑事诉讼法》
 非诉讼程序法主要是《仲裁法》
 
 
 【经济法和民商法是同一等级】
 宪法及相关法             宪法、组织法、选举法、民族区域自治法、国籍法
 民商法 (【平等】)           民法通则、物权法、合同法、侵权责任法、公司法、招投标法
 行政法 (【政府】)           行政处罚法、行政复议法、行政许可法、环境影响评价法、城市房地产管理法、城乡规划法、建筑法
 经济法 (【调控】)           统计法、土地管理法、标准化法、税收征收法、预算法、审计法、节约能源法、政府采购法、反垄断法
 社会法 (【弱者】)           残疾人保障法、矿山安全法、劳动法、职业病防治法、安全生产法、劳动合同法
 刑法                   刑法(犯罪、刑罚)
 诉讼与非诉讼程序法       民事诉讼法、行政诉讼法、刑事诉讼法、仲裁法
 */

#pragma mark 法的形式 (制定部门、具体的文件  只能由法律规定的事项  地方立法权扩容)
/*
 【重点】
     掌握 1谁制定 2谁公布 3特征 4效力 5规定事项
 
 我国法的形式是制定法形式
     法律是由国家主席签署主席令予以公布
     行政法规由总理签署国务院令予以公布
     地方性法规、自治条例和单行条例
             1.省、自治区、直辖市的人大及其常委会，可以制定地方性法规
             2.设区的市的人大及其常委会，可以对【城乡建设与管理、环境保护、历史文化保护】等方面的事项制定地方性法规
                 设区的市的地方性法规须报省、自治区的人大及其常委会批准后实施
     部门规章是由部门首长签署命令后予以公布
         没有法律或者国务院的行政法规、决定、命令的依据，部门规章不得设定减损公民、法人和其他组织权利或者增加其义务的规范，不得增加本部门的权力或者减少本部门的法定职责。
     地方政府规章由省长或市长签署命令后予以公布
             设区的市的人民政府制定地方政府规章，限于【城乡建设与管理、环境保护、历史文化保护】等方面的事项
 
 宪法                                  全国人大                               《宪法》及宪法相关法等
 法律(法)                               全国人大及常委会                        《建筑法》、《城乡规划法》
 行政法规(条例)                           国务院                               《建设工程质量管理条例》
 地方性法规、自治条例和单行条例(条例)        省、【设区市】人大及常委会 民族自治地方人大      《北京市建筑市场管理条例》《****自治州建筑条例》
 部门规章(规定、办法、细则)                国务院各部、委                           《招投标公告发布暂行办法》
 地方政府规章(规定、办法)                  省、【设区市政府 】                           《安徽省建设工程造价管理办法》


 注意:
 关于法的形式:习惯法、宗教法、判例 是法的形式 但不是我国法的形式，国际法是我国法的形式。
 宪法地位和效力 最高效力的根本大法。
 下列事项只能制定法律:（只能由法律规定）
     1.国家主权的事项;
     2.各级人民代表大会、人民政府、 人民法院和人民检察院的产生、组织和职权;
     3.民族区域自治制度、特别行政区 制度、基层群众自治制度;
     4.犯罪和刑罚;
     5.对公民政治权利的剥夺、限制人身 自由的强制措施和处罚;
     6.税种的设立、税率的确定和税收征收管理等税收基本 制度;
     7.对非国有财产的征收、征用;
     8.民事基本制度;
     9.基本经济制度以及 财政、海关、金融和外贸的基本制度;
     10.诉讼和仲裁制度。
 地方立法权扩容:设区市(城乡建设与管理、环境保护、历史文化保护)
 
 */


 #pragma mark 法的效力等级（需要裁决的特殊情况）

/*
 宪法至上
 
 上位法优于下位法
         (同一级别的人大大于政府、上级高于下级)
 特别法优于一般法
 新法优于旧法
 
 需要裁定的特殊情况
     同一机关制订的规定之间的冲突解决（谁制定谁裁决）:
             法律之间不一致，由全国人大常委会裁决
             行政法规之间不一致，由国务院裁决
     地方法规与部门规章之间的冲突解决 （两家不偏袒）
            由国务院提出意见，国务院以为：
                适用地方法规，国务院决定直接适用
                适用部门规章，国务院提请全国人大常委会裁定
     部门规章之间、部门规章与地方政府规章之间的冲突解决 由国务院决定（由家长裁定）
     根据授权制定的法规与法律规定不一致，不能确定如何适用时，由全国人大常委会裁决
 */


#pragma mark 备案和审查

/*
 
 行政法规、地方性法规、自治条例和单行条例、规章（不包括宪法、法律）应当在公布后的30日内依照下列规定报有关机关备案
 
    法规、规章                                                   备案机关（公布30日内）
 行政法规                                                   全国人大常委会
 地方性法规、自治条例和单行条例                                国务院+全国人大常委会
 部门规章                                                       国务院
 省级规章(省、自治区、直辖市政府制定)                            国务院+省级人大常委会
 市级规章(设区的市、自治州政府制定)                  国务院+省级人大常委会+省级人民  、政府+市级人大常委会
 授权制定的法规                                                授权决定规定的机关
 
 报备不能越级，如设区的市人大制定的地方性法规，由省人大常委会报全国人大常委会和国务院备案。
 
 
 
 
 
 
 
 */
#pragma mark - ************** 建设工程法人制度

#pragma mark 法人成立的条件

/*
 
 组织不一定是法人
 
1依法成立;
         设立法人必须经过政府主管机关的批准或者核准登记
2有必要的财产或者经费;
         法人的财产或者经费必须与法人的经营范围或者设立目的相适应
3有自己的名称、组织机构和场所;
         法人的场所是确定法律管辖的依据
4能独立承担民事责任。
         法人必须能够以自己的财产或者经费承担在民事活动中的债务

 法人住所/法定代表人
注意:
     法人的法定代表人是自然人（不是法人），法人以它的主要办事机构所在地为住所
     企业的法定代表人是自然人
 
思考:联合体可以投标，是不是法人? 项目经理部/财务部/法务部? 子公司和分公司?
 
 */
#pragma mark 法人分类

/*
 
    分为企业法人和非企业法人(包括行政法人、事业法人、 社团法人)
 
法人资格：
    企业法人依法经工商行政管理机关核准 登记后取得法人资格
    机关和事业单位法人成立之日具有资格，部分事业单位需要登记
 
    企业法人分立、合并，其权利和义务由变更后的法人享有和承担。
 
    有独立经费的机关（行政法人）从成立之日起，具有法人资格
    具有法人条件的事业单位、社会团体（事业法人、社团法人）依法不需要办理法人登记的，从成立之日起，具有法人资格
         依法需要办理法人登记的，经核准登记，取得法人资格
 */

#pragma mark 法人在建设工程中的地位
/*
 法人是建设工程中的基本主体（即最主要的主体，但不是唯一主体）
 
 法人确立了建设领域国有企业的所有权和经营权的分离
 
 施工单位、勘察设计单位、监理单位通常是具有法人资格的组织。
 但有时候，建设单位也可能是没有法人资格的其他组织。
 */
#pragma mark 企业法人与项目经理部的法律关系
/*
 项目经理部：
         对于大中型施工项目，施工企业应当在施工现场设立项目经理部；
         小型施工项目，可以由施工企业根据实际情况选择适当的管理方式
 
        项目经理部不具有法人资格，无法独立承担民事责任，
             属于施工企业非常设性下属机构，不是施工企业内部常设机构，为完成某项任务而设。
        项目经理部行为的法律后果由企业法人承担。
 问题：
 一个施工项目是否必须设立项目经理部

项目经理：
         项目经理是企业法人授权在建设项目上的管理者。
         在每个施工项目上必须有一个经企业法人授权的项目经理
 
 问题:
         项目经理签字的材料款，如果不按时支付?
         一个施工项目是否必须有项目经理
 
 
 分公司、项目经理、项目经理部、法定代表人均不具有独立法人资格，
 但子公司具有法人资格
 分公司【使用】总公司的营业执照及资质证书承揽工程       分公司==未成年子女
 子公司【不得】使用母公司的营业执照及资质证书承揽工程     子公司==成年子女
*/
#pragma mark - ************** 建设工程代理制度

#pragma mark 三方当事人，两个法律关系
/*
    建设工程代理制度
 (三方当事人，两个法律关系)
 被代理人委托代理人在代理权限内，以被代理人的名义与第三人实施具有法律意义的行为，被代理人对代理行为承担民事责任
 
 特征:
     1. 代理权限范围;         代理人实施代理行为时有独立进行意思表示的权利，否则，只能视为传达意思表示的使者
     2. 以被代理人名义;
     3. 法律意义;
     4. 后果归属于被代理人。
 */

#pragma mark 代理的种类
/*
 代理的种类：
     委托代理
         按照被代理人的委托行使代理
         招标代理、采购代理、诉讼代理
     法定代理
         根据法律的规定行使代理权
         只针对无民事行为能力人和限制民事行为能力人  监护人是其法定代理人
         监护人行使监护代理权
     指定代理
         有关单位或法院指定
         对无民事或限制民事行为能力的人指定代理
 
 
 
 建设工程的承包活动不得委托代理。
         招标活动、诉讼活动、采购活动可委托代理
         禁止转包、主体结构禁止分包
 委托代理，可以用书面形式，也可以用口头形式，但法律规定用书面的，应该用书面。
 授权委托书应载明:
     代理人的姓名或名称、
     代理事项、权限和期间，
     并由委托人签名或盖章。
 委托书授权不明的，被代理人应当向第三人承担民事责任，代理人负连带责任
 
 
 有些委托代理，代理人必须具备相应的资格才能代理
         比如招标代理
 */

#pragma mark 代理关系的终止
/*
    委托代理终止的情形和法定代理终止的情形易混（代理人或被代理人死亡导致的代理终止情形）

    委托代理终止 ：
        代理期限届满或代理事务完成
        被代理人取消委托或代理人辞去委托
        代理人死亡或丧失民事行为能力
        作为被代理人或者代理人的法人终止
 
    法定/指定代理终止：
        被代理人取得或恢复民事行为能力
        指定代理的人民法院或指定单位取消指定
        被代理人或代理人死亡
        代理人丧失民事行为能力
        由于其他原因引起的被代理人和代理人之间的监护关系消灭

注意：被代理人死亡，委托代理关系不一定终止
 */

#pragma mark 无权代理和表见代理 转代理 复代理
/*
 
 注意各自的法律效果
 
 无权代理与表见代理(区别:1、无权代理:无权，待定; 2、表见代理:无权，有效)
 表见代理是无权代理的一种特殊情况
 
 无权代理三种情形:
    1自始未经授权;
    2超越代理权;
    3代理权已终止。
 无权代理只有经过被代理人的追认，被代理人才承担民事责任。
 未经追认的行为，由行为人承担民事责任
 【无权代理的后果是效力待定】
 
 表见代理四个条件:
    1无权代理;
    2善意相对人有理由相信行为人有代理权的，
        情形包括行为人持有本人发出的委任状、已加盖公章的空白合同书或者有显示本人向向行为人授予代理权的通知函告等证明文件;
    3 本人有过失;
    4相对人为善意
 
 法律效果:无权代理追认有效
 表见代理该行为有效(被代理人无拒绝权，可追偿)
 
 【表见代理是一种特殊的无权代理】
 
 
 转代理:事先需同意，事后追认，紧急情况，为保护被代理人利益除外。（必须紧急且保护利益）
         事先取得同意的，有效代理
         事先未取得同意的，效力待定（紧急情况除外）
 复代理:代理人为处理代理事物，为被代理人选任其他人进行代理被称为复代理。
 
 知道他人以本人名义实施不做否认表示的视为同意
 */

#pragma mark 代理的责任承担（ 代理中的四个连带责任）
/*
 谁有错谁担责 都有错承担连带责任
 
 代理中的四个连带责任
 1. 委托书授权不明，被代理人应当向第三人承担民事责任，代理人负连带责任;
 2. 代理人和第三人串通，损害被代理人利益的，代理人和第三人负连带责任;
 3. 第三人知道行为人无权代理还与之实施民事行为，第三人和行为人连带责任;
 4. 违法代理行为，被代理人和代理人连带。
 
 1，4代理内部出问题; 2，3代理外部出问题。
 */



#pragma mark - ************** 建设工程物权制度

#pragma mark 物权的特征和种类
/*
一、物权的含义和法律特征
物权是指权利人依法对特定的物享有直接支配和排他的权利。   物包括动产和不动产。
 
物权的特征:支配权、绝对权、财产权、排他性
 
施工单位的施工活动是为了形成物——建设工程
 
二、物权种类
 所有权(最基本的权利):
         自己的财产
         占有、使用、收益、处分权(核心)
 四个用益物权:
         他人的财产
         (占有、使用、收益)
         土地承包经营权、建设用地使用权、宅基地使用权和地役权 （【除此之外都不是用益物权 租赁权不是用益物权】）
         因不动产或动产被征收、征用，致使用益物权消灭或者影响用益物权行使的，用益物权人有权获得相应补偿
 担保物权(为债而生，优先受偿)
         抵押权、质押权、留置权、定金、保证
 
*/
#pragma mark 与土地相关的物权(土地所有权、建设用地使用权和地役权)
/*
 
 土地所有权 ：哪些归国家所有，哪些归集体所有
 
 
 建设用地使用权 不能买卖 可以转让
 
建设用地使用权
    因建造建筑物、构筑物及其附属设施而使用国家所有的土地的权利。只能存在于国家所有的土地上，不包括农村土地
使用权人取得占有、使用、收益的权利，有权利用该土地建造建筑物等。 —— 房地产开发(房随地走，地随房走，房地一体)
可以在土地的地表、地上或者地下分别设立。新设立的建设用地使用权，不得损害已设立的用益物权。
设立建设用地使用权，可以采取出让(有偿)或者划拨(无偿)等方式。工业、商业、旅游、娱乐和商品住宅等经营性用地应当采用招标、拍卖等公开竞价方式。国家严格限制以划拨方式设立建设用地使用权。
建设用地使用权自登记时设立。
 
*/

#pragma mark  建设用地使用权人的权利
/*
 
 建设用地使用权人的权利：
    使用权转让、互换、出资、赠与、抵押
        应订立书面合同;使用期限不得超出剩余期限; 土地与地上附着物一并处分(房随地走，房地一体)
    用地期满续期的权利
        住宅用地，期满自动续期
        非住宅用地，依法律规定办理
 */

#pragma mark 地役权(约定)—— 因地生利
/*

地役权指为了使用自己不动产的便利或提高其效益而按合同约定利用他人不动产的权利
 
应采用书面形式订立，自合同生效时设立。未经登记，不得对抗善意第三人。(可登记可不登记，和建设用地使用权相区别)
 
土地上已设立土地承包经营权、建设用地使用权、宅基地使用权等权利的，未经用益物权人同意，土地所有权人不得设立地役权。
 
需役地转让的，受让人同时享有地役权;供役地转让的，地役权对受让人具有约束力。
 
例:某建设单位为方便施工现场运输，借用项目相邻单位道路通行，双方约定建设单位每月支付20000元费用。
 
 */

#pragma mark 物权的设立、变更、转让、消灭和保护
/*
1.不动产物权的设立、变更、转让和消灭
    依法登记生效，自记载于不动产登记簿时生效;不登记，不生效。
    依法属于国家所有的自然资源，可不登记。
    不动产所在地的登记机构办理。
 
不动产登记与合同效力的关系：
    当事人之间订立有关设立、变更、转让和消灭不动产物权的合同，除法律另有规定或者合同另有约定外，自合同成立时生效;未办理物权登记的，不影响合同效力。

 2.动产物权设立和转让
 
 动产物权以占有和交付为公示手段。
 动产物权设立和转让，自交付时发生效力。
 船舶、航空器和机动车等物权的设立、变更、转让和消灭，未经登记，不得对抗善意第三人
 
 总结
 
 不动产物权      登记设立主义      自登记时设立(不登记不设立)
 例外:地役权     登记对抗主义      自地役权合同生效时设立，可以不登记。但未经登记不得对抗善意第三人
 一般动产物权     交付主义        自交付时设立(不登记也设立)
 特殊动产物权(车辆、船舶、航空器、企业动产等)    登记对抗主义  自交付时设立(不登记也设立，但未经登记不得对抗善意第三人)
 
 */

#pragma mark - ************** 建设工程债权制度
#pragme mark 债的基本法律关系
/*
 
 债是按照合同的约定或者法律规定，在当事人之间产生的特定的 权利和义务关系。
 
 债的内容是主体双方的权利与义务，即债权与债务。
 物权是绝对权，债权是相对权。
 债权具有相对性:主体、内容、责任相对。
 */
#pragme mark 债的发生根据
/*
    1.合同之债  最主要、最普遍   （施工合同 、材料买卖合同）
 
    2.侵权之债  没有法律依据侵害财产权和人身权（施工噪声）
        悬挂物、搁置物脱落，所有人、管理人或使用人承担责任(除非能证明自己没有过错) //所有人、管理人或使用人 三个中其中一个承担责任
        建筑物倒塌，建设单位与施工单位承担连带责任
        抛掷物品或坠落物品，难以确定侵害人，由可能加害的使用人补偿
    3. 不当得利
         没有法律或合同根据，有损于他人而取得的利益。
         得利者与受害者间形成。得利者应将所得的不当利益返还给受损失的人。
     4. 无因管理
         无法律或受托义务，而是自觉为他人管理事务的行为。管理人和受益人间形成。
 */

#pragme mark 建设工程债的常见种类
/*
 
 (一)施工合同债 (注意债权、债务的相对性)
        建设单位和施工单位。完成施工任务?支付工程款?
 (二)买卖合同债 （注意买方）
        材料设备的买方可能是建设单位，也可能是施工单位。
 (三)侵权之债
        噪声扰民，居民是债权人，施工单位或建设单位是债务人。
 */
#pragma mark - ************** 建设工程知识产权制度
#pragme mark  知识产权的法律特征

/*
 
 知识产权是权利人对其创造的 智力成果 依法享有的权利。
 我国的知识产权包括 著作权(版权)、专利权、商标专用权、发现权、发明权以及其他科技成果权。
 
 知识产权是一种无形财产权。特征如下:
 一、财产权和人身权的双重属性
 二、专有性 （排他性）
 三、地域性
 四、期限性
 
 知识产权常见种类
 */
#pragma mark 专利权 （保护期及开始计算时间）
/*
 
 专利权——指权利人在法律规定的期限内，对其发明创造所享有的 制造、使用和销售的专有权。
 
 保护对象:发明、实用新型和外观设计(发明:从无到有。实用新型和 外观设计:有中改良)
 
 授予条件:发明和实用新型(新颖性、创造性和实用性);外观设计( 新颖性、富有美感和适于工业应用)
 专利人的权利:制造、使用、许诺销售、销售、进口其专利产品。
 
 保护期限:发明20年;实用新型和外观设计10年;均自申请日起计算。
 */
#pragma mark 商标权 （保护期及开始计算时间）

/*
 商标权
 1、指商标所有人对其注册商标享有的具体权利，
        只包括财产权，商标设计者的人身权受著作权法保护。
 2、商标专用权包括使用权和禁止权两方面。 商标专用权的保护对象是经过国家商标管理机关核准注册的商标。
 
 3、商标有效期为10年，
    自核准注册之日起算;
    应当在期满前12个月内申请续展注册，在此期间未能提出申请的，可以给予6个月的宽限期。
 */
#pragma mark 著作权 （客体、保护期及开始计算时间）

/*
 著作权(版权)——作者及其他著作权人依法对文学、艺术和科学作品所享有的专有权。
 
 客体:文字作品(招投标文件、工作报告)、建筑作品、图形作品(工程设 计图、产品设计图)、计算机软件。
 
 保护期限:
 公民发表权、使用权、获得报酬权为作者终生及其死后50年;合作作品， 以最后死亡作者为准;法人及其他组织作品，为首次发表后50年，但自创造完成后50年未发表的，不再保护。
 作者的署名权、修改权、保护作品完整权不受限制。
 
 主体(作者及其他享有著作权的公民、法人或其他组织，国家也可以成为著作权的主体)
 
 种类                          形式                      著作权归属
 
 单位作品                 单位意志创作作品，如招、投标文件       单位
 
 职务作品(内部)           为完成工作任务而创作的作品，          一般由作者享有
                            如设计师与设计图纸           (2年内未经单位同意不得许可第三人使用)
                        (单位作品的作者是单位，           单位在业务范围内优先使用
                        而职务作品的作者是公民个人)          特殊(主要利用单位的物质技术条件，并由单位承担责任)
                                                     作者只享有署名权，其他权利归单位
 
 委托作品 (外部)          接受单位委托创作的作品，                按合同约定;
                            如勘察设计文件             合同无约定时推定为受托人 (受托人，就是付出了劳动的一方)
 */

#pragma mark 计算机软件的法律保护
/*
 计算机软件的法律保护:
 (1)软件著作权属于软件开发者(在软件上署名的)，合作作品和委托作品同上表
 (2)软件合法复制品所有人可以装置、备份复制品，但不能通过任何方式提供给他人使用，并在丧失所有权时，负责将备份复制品销毁。
 (3)可以为了把该软件用于实际的计算机应用环境或者改进其功能、性能而对复制品进行必要的修改，但未经许可不可向任何第三人提供修改后的软件。
 (4)软件著作权制度存在合理使用(学习和研究)，可以不经软件著作权人许可，不向其支付报酬。
 
 */

#pragma mark 建设工程知识产权的保护
/*
 建设工程知识产权的保护
 建设工程知识产权权利人的权益受到损害的情况包括违约和侵权两种情况，当事人可以寻求的保护途径包括民法保护、行政法保护和刑法保护。
 
 建设工程知识产权发生纠纷后，由当事人协商解决;不愿协商或协商不成的，可以起诉，也可以请求知识产权行政主管部门处理。
 
 (一)建设工程专利权的保护 (诉前保全)
 
 专利权人或者利害关系人有证据证明他人正在实施或者即将实施侵犯专利权的行为， 如不及时制止将会使其合法权益受到难以弥补的损害的，可以在起诉前向人民法院申请采取责令停止有关行为的措施。
 
 申请人提出申请时，应当提供担保;不提供担保的，驳回申请。
 
 人民法院应当自接受申请之时起四十八小时内作出裁定;有特殊情况需要延长的， 可以延长四十八小时。裁定责令停止有关行为的，应当立即执行。当事人对裁定不服的，可以申请复议一次;复议期间不停止裁定的执行。
 
 (二)商标权的保护:
 下列属于侵犯注册商标专用权:
 (1)未经商标注册人的许可，在同一种商品或者类似商品上使用与其注册商标相同或者近似的商标的;(造假货)
 (2)销售侵犯注册商标专用权的商品的;(卖假货)
 (3)伪造、擅自制造他人注册商标标识或者销售伪造、擅自制造的注册商标标识的 ;(造或卖假商标)
 (4)未经商标注册人同意，更换其注册商标并将该更换商标的商品又投入市场的;  (贴牌)
 (5)给他人的注册商标专用权造成其他损害的。
 
 (三)著作权的保护
 对于著作权的保护，主要是民法保护。
 
 */

#pragma mark 建设工程知识产权侵权的法律责任
/*
 建设工程知识产权侵权的法律责任
 在建设工程知识产权侵权的民事责任中，最主要的是赔偿损失。
 4种确定方法:
 一、按照权利人因被侵权所受到的实际损失确定;  （权利人受损）
 二、实际损失难以确定的，可以按照侵权人因侵权所获得的利益确定; （侵权人获利）
 三、权利人的损失或者侵权人获得的利益难以确定的，参照倍数合理确定;
 四、以上都难以确定的，人民法院可以根据专利权的类型、侵权行为的性质和情节等因素，确定给予一定数额的赔偿。
 赔偿数额还应当包括权利人为制止侵权行为所支付的合理开支。
 
 */
#pragma mark - ************** 建设工程担保制度

#pragma mark 担保与担保合同的规定
/*
 担保与担保合同的规定
 一、担保方式:保证、抵押、质押、留置和定金
 二、第三人为债务人向债权人提供担保时，可以要求债务人提供反担保。
 反担保适用《担保法》担保的规定。
 三、担保合同是主合同的从合同，主合同无效，担保合同无效。
 */

#pragma mark 保证
/*
    保证
 【注意保证的双方当事人】
 保证的概念 :是指保证人和债权人约定，当债务人不履行债务时，保证人按照约定履行债务或者承担责任的行为。最高额保证。
 
 保证人资格：
     (1)国家机关不得为保证人;
     (2)学校、幼儿园、医院等以公益为目的的事业单位、社会团体不得为保证人;
     (3)企业法人的分支机构、职能部门不得为保证人，    书面 授权可以
     具有代为清偿能力的法人、其他组织或公民，可以做保证人。如银行、担保公司
 
 
 保证方式:
     一般保证
     连带责任保证 :约定不明或没有约定
 
 保证范围:
    主债权、利息、违约金、损害赔偿金和实现债权费用，没有约定或约定不明确的，应对全部债务承担责任。
 
 保证期间
    保证期间:
         主债务履行期届满之日起6个月(未约定) 有约定按约定
    保证期间合同变更
         债务人变更应取得保证人书面同意;(债务转让)
         债权人变更，保证继续有效;(债权转让)
         变更主合同，应取得保证人书面同意(主合同转让)
 
 
 种类
 
 种类                             主体间关系                          保证内容
 施工投标保证金                投标人向招标人提供               投标人为自己的有效行为担保
 (招标估算价2%)
 
 履约保证金                   中标人向招标人提供              保证施工合同顺利履行
 (中标合同价10%)
 
 工程款支付担保                  招标人向中标人提供             保证按照合同约定支付工程款
 
 预付款担保                  承包人向发包人提供               避免承包人拿到预付款后跑路或挪用
 
 */

#pragma mark 抵押
/*
 
 (不转移对抵押物的占有；债务人或第三人都可以抵押；动产和不动产都可以抵押；抵押物不能直接归债权人所有，优先受偿)
 
 抵押(不转移对抵押物的占有)
 
 一、概念
        债务人或者第三人不转移对财产的占有，将该财产作为债权的担保。
        债务人不履行债务时，债权人有权以该财产折价或以拍卖、变卖该财产的价款优先受偿的担保方式。
        债务人或者第三人称为抵押人，债权人称为抵押权人。
 二、抵押物
     (一)可以抵押的财产
        1、建筑物和其他土地附着物;
        2、建设用地使用权;
        3、以招标、拍卖、公开协商等方式取得的荒地等土地承包经营权;
        4、生产设备、原材料、半成品、产品 ;
        5、正在建造的建筑物、船舶、航空器;
        6、交通运输工具;
        7、法律、行政法规 未禁止抵押的其他财产
     (二)不得抵押的财产 （公有的和有问题的不能抵押）
         1、土地所有权;
         2、耕地、宅基地、自留地、自留山等集体所有的土地使用权 ;
         3、学校、幼儿园、医院等以公益为目的的事业单位、社会团体的教育设施、医疗卫生设施和其他社会公益设施;
         4、所有权、使用权不明或有争议的财产;
         5、依法被查封、扣押、监管的财产。
     (三)抵押权的产生
         (1)不动产登记生效:建筑物;林木;建设用地使用权;荒地承包经营权;城市房地产;正在建造的建筑物。
         (2)动产合同生效时设立(未经登记不能对抗善意第三人):生产设备、原材料、半成品、产品;交通运输工具;正在建造的船舶、航空器。
 三、抵押权的效力
     (1)抵押担保的范围
        包括主债权及利息、违约金损害赔偿金和实现抵押权的费用。当事人也可以在抵押合同中约定抵押担保的范围。
     (2)抵押人有义务妥善保管抵押物并保证其价值。
         抵押人转让抵押物的价款，超过债权的部分归抵押人所有，不足部分由债务人清偿。
         转让抵押物的价款不得明显低于其价值。
         抵押人转让已登记抵押财产的，必须通知抵押权人并告知受让人，否则转让行为无效
     (3)抵押权与其担保的债权同时存在。
         抵押权不得与债权分离而单独转让或者作为其他债权的担保。
 
  四、抵押权的实现
 
        抵押权人折价或拍卖、变卖所得优先受偿
 
        实现顺序：（登记>顺序>比例）
             已登记的，按登记先后顺序;顺序相同，按比例清偿;
             未登记的，按合同生效先后顺序;顺序相同，按比例清偿;
             已登记的先于未登记清偿
 */

#pragma mark 质押
/*
 【抵押和质押都是优先受偿权 不能直接去的所有权】
 
 质押(必须转移对质押物的占有，这是与抵押最主要的区别)
 
 概念
    是指债务人或第三人将其动产或权利移交债权人占有，用以担保债权的实现， 当债务人不能履行债务时，债权人依法有权就该动产或权利优先得到清偿的担保法律行为。
 
 质权是一种约定的担保物权，以转移占有为特征。
 债务人或第三人为出质人，债权人为质权人，移交的动产或权利为质物。
 
 质押的分类:
    动产质押(能够用作质押的动产没有限制)
    权利质押:
         (1)汇票、 支票、本票、债券、存款单、仓单、提单;
         (2)依法可以转让的股份、股票;
         (3)依法可以转让的商标专用权、专利权、著作权中的财产权;
         (4)依法可以质押的 其他权利。
         注意:无房产证
 */

#pragma mark 留置权
/*
 留置权
    是指债权人按合同约定占有债务人的动产，当债务人在约定期限内不能履行债务时，债权人依法有权依法留置该动产，以该财产折价或拍卖、变卖所得优先受偿。
 
 适用:
     保管、运输、加工承揽等法律规定可以留置的其他合同。
 注意:
    当事人可以在合同中约定不得留置标的物。
    留置权负有妥善保管留置物的义务。因保管不善致使留置物灭失或者损毁的，留置权人应当承担民事责任。
 注意:留置权>已登记抵押权>质权>未登记抵押权
 
 */

#pragma mark 定金
/*
 定金
    履行后，抵作价款或收回
 
 
 定金合同:
        实践合同(交付定金合同生效)
        书面合同
        和违约金不可同时适用
【必须是书面合同、必须交付定金时生效，不可与违约金同时适用，20%】
 
 定金罚则
     (1)交付定金方违约:没收定金
     (2)收受定金方违约:双倍返还
 
 定金限额
     (1) 不超过合同金额20%
     (2)超过部分无效，视为预付款
 */
#pragma mark - ************** 建设工程保险制度

#pragma mark 保险概述
/*

 保险概述
    危险的存在是保险产生的前提。
    保险制度上的危险具有损失发生的不确定性，包括发生与否的不确定性、发生时间的不确定性和发生后果的不确定性。
 */
 #pragma mark 保险合同
 /*
 保险合同
  
 保险合同
    投保人与保险人约定保险权利义务关系的协议。
  
 投保人
    指与保险人订立保险合同，并按照合同约定负有支付保险费义务的人。
 保险人
    是指与投保人订立保险合同，并按照合同约定承担赔偿或者给付保险金责任的保险公司。
 被保险人
    是指其财产或者人身受保险合同保障，享有保险金请求权的人。
    投保人可以为被保险人。
 受益人
    是指人身保险合同中由被保险人或者投保人指定的享有保险金请求权的人 。
    投保人、被保险人可以为受益人。
  
 财产保险
    是以财产及其有关利益为保险标的的保险。
 人身保险
    是以人的寿命和身体为保险标的的保险。
    投保人可以按照合同约定向保险人一次支付全部保险费或者分期支付保险费。
    保险人对人寿保险的保险费，不得用诉讼方式要求投保人支付。

  在合同有效期内，保险标的的危险程度显著增加的，被保险人应当按照合同约定及时通知保险人，保险人可以按照合同约定增加保险费或者解除合同。

  
 建筑工程一切险和安装工程一切险属于?  财产保险合同
  */
#pragma mark 保险索赔
/*
 
 保险索赔
 保险索赔证明:
    保单、建设工程合同、事故照片、鉴定报告以及保单中规定的证明文件。
 计算损失大小:
    保险单上载明的保险财产全部损失，应当按照全损进行索赔。
    如果一个项目同时由多家保险公司承保，按比例。
 */
#pragma mark 建筑工程一切险
/*
 建筑工程一切险(及第三者责任险)
 
 1、建筑工程一切险
        是承保各类民用、工业和公用事业建筑工程项目，在建造过程中因自然灾害或意外事故而引起的一切损失的险种。
 2、投保人
        发包人，如委托承包人投保，保费由发包人承担。
 被保险人
        (1)业主或工程所有人;
         (2)承包商或分包商;
         (3)技术顾问等。
 
 3、承保范围:
        自然事件和意外事故
     除外责任:
         (1)保风险——必然发生的损失不保;
         (2)保自然事件、意外 事故——因被保险人疏于管理而发生的损失不保;
         (3)保建造/安装过程—— 开工前、竣工后的损失不保。
 
     (1)保风险，
            必然发生的损失(如材料损耗/机械磨损/维修检修费用)不保。
     (2)保自然灾害或意外事故，
            因被保险人疏于管理而发生的损失(如设计错误 /施工方法不当/材料不合格/停电断电造成的)不保。
     (3)战争/暴乱/恐怖袭击/罢工等属于除外责任，不保。
     (4)保建造/安装过程，保险财产中工程 业主已经验收合格或实际接收的部分 不保。
 
 4、第三者责任险:
        意外事故引起工地内及邻近区域的第三者人身伤亡、 疾病或财产损失;诉讼费用以及事先经保险人书面同意而支付的其他费用。
 
 5、赔偿金额:
        以法院或政府部门裁定为准，但不得超过保险单明细表中对应列明的每次事故赔偿限额;
        最高赔偿责任不得超过本保险单明细表中列明的累计赔偿限额。
 
 6、保险期限
         1起始:开工时或材料设备运抵工地时(以先发生者为准)
         2终止:验收合格时或实际占有使用时(以先发生者为准)
         3任何情况下，保险期限的起始或终止不得超出保险单明细表中列明的保险生效日或终止日。
 */
#pragma mark 安装工程一切险
/*
 安装工程一切险
 安装工程一切险的保险责任自保险工程在工地动工或用于保险工程的材料、设备运抵工地之时起始，至工程所有人对部分或全部工程签发验收证书或验收合格，或工程所有人实际占有或使用接收该部分或全部工程之时终止，以先发生者为准。
 
 1、保险期内一般应包括一个试车考核期
 2、试车考核期的保险责任一般不超过3个月，否则应另加收保险费
 3、对旧机器设备不负考核期的保险责任，也不承担其维修期的保险责任
 
 无论是建筑工程一切险还是安装工程一切险，在任何情况下，保险期限的起始和终止不得超出保险单明细表中列明的试车和考核期限。
 
 */
#pragma mark 工伤保险和建筑职工意外伤害险
/*
 工伤保险和建筑职工意外伤害险
 
 鼓励施工单位应当为施工现场从事危险作业的人员办理意外伤害险(法定非强制性，属于商业保险)
 施工企业应当为职工参加工伤保险(法定强制险，属于社会保险)
 
 */
#pragma mark 保险代理人和保险经纪人
/*
 保险代理人和保险经纪人
 
 保险代理人——保险人的委托
 保险经纪人——投保人的委托
*/
#pragma mark - ************** 建设工程法律责任制度


#pragma mark - 法律责任
/*
 民事责任 行政处分 行政处罚 刑法
 
 
 法律责任
    是指行为人由于违法行为、违约行为或者法律规定而应承担的不利后果。
 5种责任
    (违宪、刑事、民事、行政和国家赔偿责任)，
 4个特征
    (存在法律义务、不利的后果、国家专门机关依照法定程序、国家强制力作保障)。
*/
 #pragma mark - 民事责任
 /*
 民事责任 ：主要是财产责任
     违约责任:合同
     侵权责任 （过错、无过错）
         人身责任
         财产责任
 
承担民事责任的方式：
     停止侵害
     排除妨碍
     消除危险
     返还财产
     恢复原状
     修理、重作、更换
     赔偿损失
     支付违约金
     消除影响、恢复名誉(人身)
     赔礼道歉(人身)
 承担民事责任的方式， 可以单独适用，也可以合并适用。
 
 建设工程主要民事责任:
     返还财产(合同无效、被撤销)
     修理(质量问题或竣工验收不合格)
     赔偿损失(违约造成损失)
     支付违约金(违约不一定造成损失)
 
  */
#pragma mark - 行政责任
/*
 行政责任(违法不犯罪)的种类及方式
 
 行政责任
    行政处罚
        警告
        罚款
        没收违法所得
        没收非法财物
        责令停产停业
        暂扣吊销许可证/营业执照
        行政拘留
    行政处分
        警告
        记过
        记大过
        降职
        降薪
        留用察看
        开除
 
 建筑行业特殊行政处罚:责令限期改正、责令停业整顿、取消投标资格、责令停止施工、降低资质、吊销或撤销资质证书
 
 */
#pragma mark - 刑罚
/*
 刑罚种类
    主 刑
        管制
        拘役
        有期徒刑
        无期徒刑
        死刑
    附 加 刑
        罚金
        没收财产
        剥夺政治权利
        驱逐出境 (可单独适用）
 
 
 行政处罚（轻）     刑罚（重）
 
 拘留             拘役
 罚款             罚金
 没收违法所得      没收财产
 没收非法财物
 
 建设工程常见刑事责任
     一、工程重大安全事故罪:（工程质量）
            建设单位、设计单位、施工单位、工程监理单位违反国家规定，降低工程质量标准，造成重大安全事故的行为。（没有勘察单位）
     【注释】重特大安全事故的标准:死亡≥10人，或重伤≥50人，或直接经济损失≥5000万元。
     二、重大责任事故罪:
            本罪的客观方面，表现为在生产、作业中违反有关安全管理的规定(如挪用安全管理费)，或者强令他人违章冒险作业，因而发生重大伤亡事 故或者造成其他严重后果的行为。
     (1死3伤100万)
     三、重大劳动安全事故罪:
            本罪的客观方面，表现为在生产、作业中安全生产设施 或安全生产条件不符合国家规定，发生重大伤亡事故或造成其他重大严重后果。
     四、串通投标罪:
            投标人相互串通投标报价，损害招标人或者其他投标人利益，情节严重的，处3年以下有期徒刑或者拘役，并处或者单处罚金。投标人与招标人串通投标，损害国家、集体、公民的合法利益的，依照以上规定处罚。
 */
#pragma mark - ************** 建设工程招标投标制度
/*
    视为串标 / 属于串标
 
 */

 #pragma mark ****** 一、招标前的准备工作(定范围/定标准/定方式/定场所)
/*
建设工程法定招标的范围、招标方式和交易场所
*/
#pragma mark 法定招标的范围
/*
 法定招标的范围（三个工程必须满足四个标准）
     必须招标的项目范围(工程和资金性质—三类工程)
         大型基础设施、公用事业等关系社会公共利益、公众安全的项目(工程)
         全部或者部分使用国有资金投资或者国家融资的项目（资金）
         使用国际组织或者外国政府贷款、援助资金的项目（资金）
      项目规模 (四个标准)（二一添作五 事不过三）
         施工合同单项合同估算价200万元以上
         重要设备、材料等货物采购合同单项合同估算价100万元以上
         勘察、设计、监理等单项合同估算价50万元以上
         总投资额3000万元以上
 【解释】
 基础设施:能源 交通 通讯 水利 城市设施 环境保护
 公用事业:市政 教科文卫体 商品住宅
 国有资金:
     1. 财政预算
     2. 政府性专项资金
     3. 国企事业单位自有资金 (且国有投资者拥有控制权)
 国家融资:1. 国债项目 2. 国家借款 3. 政策贷款 4. 国家授权
 外国资金:1.国际贷款 2.外国贷款 3.国际救助
 
 
 可以不招标的施工项目：
     涉及国家安全、国家秘密或抢险救灾
     用扶贫资金实行以工代赈或使用农民工
     需要采用不可替代的专利或专有技术（不可替代\专有）
     采购人依法能够自行建设、生产或提供
     需要向原中标人采购，否则影响施工或功能配套要求的
     已通过招标方式选定的特许经营项目投资人依法能够自行建设、生产、提供的
 
 3+4-5 必须招标
 5可以不招标

 */
#pragma mark 建设工程招标方式
/*
 建设工程招标方式
 
 一、公开招标
     采用招标公告的方式邀请不特定组织
     范围:
        全部使用国有资金或占控股、主导地位的依法必须招标的项目，
        例外是可以邀请招标（属于邀请招标范围的可以邀请招标 人少钱多）
 二、邀请招标
     采用投标邀请书的方式邀请三个以上组织
     范围：
         技术复杂或特殊要求或受自然环境限制，只有少量潜在投标人可供选择（人少）
         采用公开招标方式的费用占项目合同金额的比例较大（钱多）
     国务院发展计划部门确定的国家重点项目和省级政府确定的地方重点项目不适宜公开招标的，经相应政府批准邀请招标
 三、总承包招标
     招标人可以依法对工程以及与工程建设有关的货物、服务全部或者部分实行总承包招标
 四、两阶段招标
     适用范围:技术复杂或者无法精确拟定技术规格的项目
     第一阶段，投标人提交不带报价的技术建议，招标人技术建议确定技术标准和要求，编制招标文件（技术标）
     第二阶段，第一阶段提交技术建议的投标人提交包括最终技术方案和投标报价的投标文件（商务标 交报价 交投标保证金）
    只有提技术标的投标人才能进行第二阶段的投标
 */
#pragma mark 建设工程招标交易场所
/*
 建设工程招标交易场所
 
 一、设区的市级以上地方人民政府可以根据实际需要，建立统一规范的招标投标交易场所
 国家鼓励利用信息网络进行电子招标投标。
 电子招投标活动完成招标投标交易 、公共服务、行政监督三项活动。
 数据电文形式与纸质形式的招标投标活动具有同等法律效力。
 二、招标人或者其委托的招标代理机构应当在资格预审公告、招标公告或者投标邀请书中载明潜在投标人访问电子招标投标交易平台的网络地址和方法。
 三、相关公告应当在电子招标投标交易平台和国家指定的招标公告媒介同步发布;
 四、投标人应当在投标截止时间前完成投标文件的传输递交，并可以补充、修改或者撤回;
 五、投标截止时间前未完成投标文件传输的，视为撤回投标文件。
     投标截止时间后 送达的投标文件，电子招标投标交易平台应当拒收。
 */

 #pragma mark ****** 二、招投标的基本程序(招标/投标/开标/评标/定标/签合同)
/*
 
 招标基本程序和禁止肢解发包、限制排斥投标人的规定
 
 招标基本程序:
     公开、公平、公正、诚实信用原则。
 建设工程招标的基本程序包括:
     履行项目审批手续、
     委托招标代理机构、编制招标文件及标底、
     发布招标公告或投标邀请书、
     资格审查、
     开标、
     评标、
     中标 、
     签订合同、
     终止招标。
 
 */

#pragma mark 履行项目审批手续
/*
 履行项目审批手续
 
 资金来源已经落实
 
 审批事项:
     按规定履行手续，依法必须招标项目 审批其招标范围（3+4-5）、方式（公开招标/邀请招标）和组织形式（自己招标/委托招标）
 
 招标基本程序:
 */

#pragma mark 委托招标代理机构
/*
 委托招标代理机构
 
《招投标法》规定，招标人具有编制招标文件和组织评标能力的，可以自行办理招标事宜。（能编、能评）
 依法必须进行招标的项目，招标人自行办理招标事宜的，应当向有关行政监督部门备案。
 
《招投标法》规定，招标代理机构是依法设立的社会中介组织 。
 招标代理机构应当具备下列条件:
 (1)有从事招标代理;业务的营业场所和相应资金;（有钱）
 (2)有能够编制招标文件和组织评标的相应专业力量;（有能力）
 (3)有符合本法规定条件、可以作为评标委员会成员人选的技术、经济等方面的专家库。（专家库）
 
 《招投标条例》规定，招标代理机构不得在所代理的招标项目中投标或者代理投标，也不得为所代理的招标项目的投标人提供咨询。
 
 */

#pragma mark 编制招标文件及标底
/*
 1、招标文件的内容:
     招标文件应当包括招标项目的技术要求、对投标人资格审查的标准、投标报价要求和评标标准等所有实质性要求和条件以及拟签订合同的主要条款。
 2、提交投标文件的时间
     招标人应当确定投标人编制投标文件所需要的合理时间;
     但是，依法必须进行招标的项目，自招标文件开始发出之日起至投标人提交投标文件截止之日止，最短不得少于20日。（依法必须招标 编制时间不少于20天）
 3、招标文件(资格预审文件)的修改或澄清
     招标人对已发出的招标文件进行必要的澄清或者修改的，应当在招标文件要求提交投标文件截止时间至少十五日前，以书面形式通知所有招标文件收受人。
     该澄清或者修改的内容为招标文件的组成部分。
     招标人澄清或者修改资格预审文件， 应当在提交资格预审申请文件截止时间至少3日前;以书面形式通知所有获取资格预审文件的潜在投标人。
     不足3日或者15日的，招标人应当顺延提交资格预审申请文件或者投标文件的截止时间。
 
 （20 15 3 ）
 
 4、对招标文件的异议
     潜在投标人或者其他利害关系人对招标文件有异议的，应当在投标截止时间10日前提出。招标人应当自收到异议之日起3日内作出答复;作出答复前， 应当暂停招标投标活动。
 （10 3 ）
 
 5、标底
     招标人可以自行决定是否编制标底。
     一个招标项目只能有一个标底。标底必须保密。
     招标项目设有标底的，招标人应当在开标时公布。

 6、最高(最低)投标限价
     招标人设有最高投标限价的，应当在招标文件中明确最高投标限价或者最高投标限价的计算方法。
     招标人不得规定最低投标限价。
 
     国有资金投资的建筑工程招标的，应当设有最高投标限价;
     非国有资金投资的建筑工程招标的，可以设有最高投标限价或者招标标底。
 
     全部使用国有资金投资或者以国有资金投资为主的建筑工程，应当采用工程量清单计价;
     非国有资金投资的建筑工程，鼓励采用工程量清单计价。
 
     工程量清单应当作为招标文件的组成部分。
 
 招标人应当在招标文件中载明投标有效期，投标有效期从提交投 标文件的截止之日起算
 
 
 */

#pragma mark 发布招标公告或投标邀请书
/*
 发布招标公告或投标邀请书
 
 (1)招标公告(招标邀请书)的内容
     应当载明招标人的名称和地址、招标项目的性质、数量、实施 地点和时间以及获取招标文件的办法等事项。
 (2)招标文件(资格预审文件)的发售
     资格预审文件或者招标文件的发售期不得少于5日。
     招标人发售资格预审文件、招标文件收取的费用应当限于补偿印刷、邮寄的成本支出，不得以营利为目的。
 
 */

#pragma mark 资格审查
/*
 资格审查
 
 资格预审的分类:分为资格预审(投标前)和资格后审(开标后)
 
 资格预审:
     1依法必须进行招标的项目提交资格预审申请文件的时间， 自资格预审文件停止发售之日起不得少于5日。
     2国有资金占控股或者主导地位的依法必须进行招标的项目，招标人应当组建资格审查委员会审查资格预审申请文件。
      资格审查委员会及其成员应当遵守招标投标法和本条例有关评标委员会及其成员的规定。
     3未通过资格预审的申请人不具有投资资格。
      通过资格预审的申请人少 3个的，应当重新招标。
     4对资格预审文件的异议
     潜在投标人或者其他利害关系人对资格预审文件有异议的，应当在提交 资格预审申请文件截止时间2日前提出。招标人应当自收到异议之日起3 日内作出答复;作出答复前，应当暂停招标投标活动。
 
 资格后审:招标人采用资格后审办法对投标人进行资格审查的，应当在开标后由评标委员会按照招标文件规定的标准和方法对投标人的资格进行审查。
 
 */

#pragma mark 开标
/*
 开标
 
 
 1.开标时间和地点
     开标应当在招标文件确定的提交投标文件截止时间的同一时间公开进行;
     开标地点应当为招标文件中预先确定的地点。
 2.程序
     开标由招标人主持，邀请所有投标人参加。
     开标时，由投标人或者其推选的代表检查投标文件的密封情况，也可以由招标人委托公证机构检查并公证;经确认无误后，由工作人员当众拆封，宣读投标人名称、投标价格和投标文件的其他主要内容。
     招标人在招标文件要求提交投标文件的截止时间前收到的所有投标文件，开标时都应当当众予以拆封、宣读。
     开标过程应当记录，并存档备查。
 
 */

#pragma mark 评标
/*
 评标
 
 1.评标委员会
     评标由招标人依法组建的评标委员会负责。
     依法必须进行招标的项目，其评标委员会由招标人的代表和有关技术、 经济等方面的专家组成，成员人数为5人以上单数(含5人)，其中经济、技术专家不少于成员总数的2/3。
     评标委员会成员的名单在中标结果确定前应当保密。
 （>=5人单数 + >2/3 ）
 
 2.评标
     评标委员会经评审，认为所有投标都不符合招标文件要求的，可以否决所有投标。
     依法必须进行招标的项目的所有投标被否决的，招标人应当依法重新招标。
 
     评标委员会成员应当依照招标投标法和本条例的规定，按照招标文件规定的评标标准和方法，客观、公正地对投标文件提出评审意见。
     招标文件没有规定的评标标准和方法不得作为评标的依据。
 
     评标委员会成员不得私下接触投标人，不得收受投标人给予的财物或者其他好处，不得向招标人征询确定中标人的意向，不得接受任何单位或者个人明示或者暗示提出的倾向或者排斥特定投标人的要求，不得有其他不客观、不公正履行职务的行为。
 
 3.标底
     招标项目设有标底的，招标人应当在开标时公布。
     标底只能作为评标的参考，不得以投标报价是否接近标底作为中标条件，也不得以投标报价超过标底上下浮动范围作为否决投标的条件。
 
 4.否决投标（必考）
     1投标文件未经投标单位盖章和单位负责人签字;（都没有的否决，有一个就不能否决）
     2投标联合体没有提交共同投标协议;
     3投标人不符合国家或者招标文件规定的资格条件;
     4同一投标人提交两个以上不同的投标文件或者投标报价，但招标文件要求提交备选投标的除外;
     5投标报价低于成本或者高于招标文件设定的最高投标限价;
     6投标文件没有对招标文件的实质性要求和条件作出响应;
     7投标人有串通投标、弄虚作假、行贿等违法行为。
 
 5.投标人对投标文件的澄清和说明 （必考）
     评标委员会可以要求投标人对投标文件中含义不明确的内容作必要澄清或说明，但是澄清或者说明不得超出投标文件的范围或改变投标文件的实质性内容。
     投标文件中有含义不明确的内容、明显文字或者计算错误，评标委员会认为需要投标人作出必要澄清 、说明的 ，应当书面通知该投标人 。
 
     投标人的澄 清、说明应当采用书面形式，并不得超出投标文件的范围或者改变投标文件的实质性内容。
     评标委员会不得暗示或者诱导投标人作出澄清、说明，不得接受投标人主动提出的澄清、说明。
 
 6.评标后工作
     评标完成后， 评标委员会应当向招标人提交书面评标报告和中标候选人名 单。中标候选人应当不超过3个，并标明排序。（3个以下的候选人）
     评标报告应当由评标委员会全体成员签字。对评标结果有不同意见的评标委员会成员应当以书面形式说明其不同意见和理由，评标报告应当注明该不同意见。
     评标委员会成员拒绝在评标报告上签字又不书面说明其不同意见和理由的，视为同意评标结果。
 
 
 */

#pragma mark 定标
/*
 定标
 
 中标人的确定
 (1)招标人根据评标委员会提出的书面评标报告和推荐的中标候选人确定中标人，招标人也可以授权评标委员会直接确定中标人。
     国有资金占控股或主导地位的依法必须招标的项目，招标人应当确定排名第一的中标候选人为中标人;
 (2)排名第一的中标候选人放弃中标、不可抗力、不交履约保证金的，招标人可以按照中标候选人名单排序依次确定其他中标候选人为中标人，也可以重新招标。
 
 【
     国有资金占控股或主导地位的依法必须招标的项目，
        1.必须公开招标
        2.招标人应当组建资格审查委员会审查资格预审申请文件
        3.招标人应当确定排名第一的中标候选人为中标人;
 】
 */

#pragma mark 签订合同
/*
 合同的签订
 (1)招标人和中标人应当自中标通知书发出之日起（30）日内，按照招标文件和中标人的投标文件订立书面合同;
 (2)当事人就同设工程另行订立的建设工程施工合同与经过备案的中标合同实质性内容不一致的，应当以备案的中标合同作为结算工程价款的根据。
 
 依法必须招标的建设项目，招标人应当自确定中标人之日起 (15 )日内， 向有关行政监督部门提交招标投标情况的书面报告。
 
 */
//投标人、投标文件和投标保证金
#pragma mark  投标人
/*
 投标人
 
     投标人参加依法必须进行招标项目的投标，不受地区或者部门的限制
 
     与招标人存在利害关系可能影响招标公正性的法人、其他组织或者个人，不得参加投标，否则投标无效
     单位负责人为同一人或者存在控股、管理关系的不同单位，不得参加同一标段投标或者未划分标段的同一招标项目投标，否则投标无效
     投标人发生合并、分立、破产等重大变化的，不再具备资格预审文件、招标文件规定的资格条件或者其投标影响招标公正性的，其投标无效。
 
 
 */

#pragma mark  联合体投标
/*
 联合体投标的含义:
     两个以上法人或其他组织组成
 
 资质条件要求
     均应具备资质
     就低不就高(同一专业)
 
 共同投标协议
     必须签订，否则，否决投标
 
 联合体各方的责任
     (1)共同与投标人签订合同，且承担连带责任
     (2)不得重复投标，否则投标无效
     (3)联合体应当在提交资格预审申请文件前组成。
     资格预审后不得随意改变联合体的构成，否则投标无效。
     各方在同一项目中以自己名义单独投标或参加其他联合体投标的，相关投标均无效。
 */

#pragma mark  投标文件
/*
 
 应当对招标文件的实质性要求和条件作出响应
 
 投标文件的修改或撤回
     在投标截止日期前，可补充、修改、撤回投标文件，并书面通知招标人
 
 投标文件的送达与签收
     时间:
         招标文件规定的截止时间前
     密封要求:
         招标人收到投标文件后，不得开启
     有效投标数量:
         3个及以上
     拒收:
         未通过预审、逾期送达或者未按招标文件要求密封的
 
 */

#pragma mark  投标保证金
/*
 形式
    现金
    银行保函
    保兑支票
    银行汇票
    现金支票
 
 金额
     不超过招标项目估算价的2%，如果是施工项目也不能超过80万
 
  有效期
     与投标有效期一致
 
 作用:
     在投标有效期内随意撤销投标或中标后不提交履约保证金和签署合同，招标人有权不退投标保证金
 
 现金或支票形式的保证金应当从其基本账户转出
 
 两阶段招标，招标人要求投标人提交投标保证金的，应在第二阶段提出
 
 招标人退还投标保证金的时间
     招标人终止招标的，应当及时退还所收取的投标保证金及银行同期存款利息
     投标人撤回提交投标文件的，招标人应当自收到投标人书面撤回通知之日起5日内退还投标保证金
     投标截止后投标人撤销投标文件的，招标人可以不退还投标保证金
     招标人最迟应当在书面合同签订后5日内向中标人和未中标的投标人退还投标保证金及银行同期存款利息
 
 */
 #pragma mark ****** 三、禁止行为(限制排斥潜在投标人/串标)
/*
 
 */

#pragma mark  禁止限制、排斥投标人
/*
 禁止限制、排斥投标人
 
 招标人有下列行为之一的，属于以不合理条件限制、排斥潜在投标人或者投标人:
     (一)就同一招标项目向潜在投标人或者投标人提供有差别的项目信息;
     (二)设定的资格、技术、商务条件与招标项目具体特点和实际需要不适应或与合同履行无关;
     (三)依法必须进行招标的项目以特定行政区域或者特定行业的业绩、奖项作为加分条件或者中标条件;
     (四)对潜在投标人或者投标人采取不同的资格审查或者评标标准;
     (五)限定或者指定特定的专利、商标、品牌、原产地或者供应商;
     (六)依法必须进行招标的项目非法限定潜在投标人或者投标人的所有制形式或者组织形式;
     (七)以其他不合理条件限制、排斥潜在投标人或者投标人;
 
 招标人不得组织单个或者部分潜在投标人踏勘项目现场。
 
 */

#pragma mark  禁止串通投标和其他不正当竞争行为的规定
/*
 1Z303014 禁止串通投标和其他不正当竞争行为的规定
 
 考点十八:禁止串通投标及其他不正当竞争行为的规定
 
 一、禁止投标人相互串通
     有下列情形之一的，属于投标人相互串通投标:
        投标人之间协商投标报价等投标文件的实质性内容
        投标人之间约定中标人
        投标人之间约定部分投标人放弃投标或者中标
        属于同一集团、协会、商会等组织成员的投标人按照该组织要求协同投标
        投标人之间为谋取中标或者排斥特定投标人而采取的其他联合行动
 
     有下列情形之一的，视为投标人相互串通投标:
         不同投标人的投标文件由同一单位或者个人编制
         不同投标人委托同一单位或者个人办理投标事宜
         不同投标人的投标文件载明的项目管理成员为同一人
         不同投标人的投标文件异常一致或者投标报价呈规律性差异
         不同投标人的投标文件相互混装
         不同投标人的投标保证金从同一单位或者个人的账户转出
 
 二、禁止招标人与投标人串通投标
     有下列情形之一的，属于招标人与投标人串通投标:
         招标人在开标前开启投标文件并将有关信息泄露给其他投标人
         招标人直接或者间接向投标人泄露标底、评标委员会成员等信息
         招标人明示或者暗示投标人压低或者抬高投标报价
         招标人授意投标人撤换、修改投标文件
         招标人明示或者暗示投标人为特定投标人中标提供方便
         其他串通行为
 */
 #pragma mark ****** 四、争议解决(异议和投诉)
/*
 
                                         投标人异议及投诉程序（四种情况两步走 其他直接投诉）
 
 对资格预审文件提出异议        提交资格预审文件截止时间2日前提出               招标人自收到异议之日起3日 内答复，答复前，暂停招投标活动
 
 对招标文件提出异议           提交投标文件截止时间10日前提出                 招标人自收到异议之日起3日 内答复，答复前，暂停招投标活动
 
 对开标提出异议              开标现场提出                                 招标人当场作答并书面记录
 
 对评标结果提出异议           中标候选人公示期间提出(2014)                  招标人自收到异议之日起3日 内答复，答复前，暂停招投标活动
 
 以上四种情况招标人不答复，或投标人对招标人答复不服的，可以向招标办投诉
 
 其他事项                   知道或应当知道之日起10日内                      直接向招标办投诉
 
 */
#pragma mark - ************** 建设工程合同制度

/*
    建设工程合同和劳动合同法律制度
 
        建设工程合同制度
 
 */

#pragma mark 合同的分类
/*
        合同的分类
 
         分类 标准                         分类内容                     举例
         法律是否明文规定                   有名合同\无名合同           合同法规定15个
         是否相互给付义务                   双务合同\单务合同       赠与、借用属单务合同
         是否需交付标的物                   诺成合同\实践合同   自然人之间借贷、定金合同属实践合同
         是否要特定形式                    要式合同\不要式合同      企业之间借贷、担保合同属要式合同
         是否存在对价关系                   有偿合同\无偿合同       赠与、借用合同属无偿合同
         相互之间主从关系                  主合同\从合同              担保合同属从合同
 
         建设工程合同属于有名、双务、有偿、诺成、要式、主合同
         建设工程合同种类:勘察、设计、施工合同(不包括监理合同)
 
 
 */

#pragma mark 合同订立过程（邀约和承诺）
/*
  合同订立过程
 
     要约邀请 (无约束力)
         寄送价目表
         拍卖公告
         招标公告
         招股说明书
         商业广告
 
 要约构成要件:
     内容具体确定(到达生效;(未到达)可撤回、（未承诺前）撤销)
 
 承诺的条件
     由受要约人/其代理人向要约人作出
     内容应当与要约的内容一致(实质性内容不能变更，视为新要约)
     在要约有效期内作出承诺(逾期承诺视为新邀约)
 
 总结:合同的成立一般要经过要约和承诺两个阶段
 
 邀约不可撤销的情形：
 1.要约人确定了承诺期限或以其他形式明示要约不可撤销；
 2.受要约人有理由认为要约是不可撤销的，并已经为履行合同作了准备工作。
 
 
 */

#pragma mark 欠付工程款和垫资处理
/*
 欠付工程款和垫资处理不同。
    （已同情无过错一方为原则，欠付，施工单位无过错，垫资（住建部明文要求不要垫资），属不听劝阻，不同情）
     欠付工程款 约定利息超过人行同期贷款利率，按约定予以支持；未约定，则按人行同期存款利率；
     垫资 约定利息超过人行同期贷款利率，超过部分不予以支持；未约定，不付利息；
 承包人工程价款优先受偿权(工程拍卖/折价所得)(合同法及司法解释)
     优于抵押权和其他债权
     不得对抗房屋买受人(消费者购房款 购房者支付全款或大部分款项)
     房屋买受人 > 承包人工程价款 > 抵押权 > 其他债权
     承包人工程价款包括人员报酬、材料款等实际支付费用和垫资，不包括因发包人违约造成的损失 （
         实际支付的部分优先受偿，利息及违约金和损失不优先受偿）
     优先权期限为6个月，自工程竣工验收之日或合同约定竣工之日起计算
 
 */

#pragma mark 合同生效要具备的条件

/*
合同生效要具备的条件
     当事人具有相应的民事行为能力(主体合格)
     意思表示真实
     不违反法律或社会公共利益(内容合法)
     具备法律所要求的形式(形式合法)
 
 内容、形式不合法:无效
 主体不合格:待定
 意思表示不真实:可变更、可撤销
 
 
 */

#pragma mark 无效合同

/*
 无效合同的规定(欠缺合法性要件)
 
 无效合同的类型
 
     一方以欺诈、胁迫的手段订立合同，损害国家利益;
     恶意串通，损害国家、集体或者第三人利益;
     以合法形式掩盖非法目的;
     损害社会公共利益;
     违反法律、行政法规的强制性规定。
 
     造成对方人身伤害的
     因故意或者重大过失造成对方财产损失的
 
 建设工程无效施工合同的情形
     承包人未取得资质或超越资质
     承包人借用资质
     工程必须招标而未招标或者中标无效
     承包人非法转包、违法分包
 无效合同的法律后果
     自始没有法律约束力(签订合同时)
     合同无效不影响合同独立存在的有关争议解决方法条款的效力
 法律责任:
     返还财产，不能返还的折价补偿;有过错的一方，应赔偿损失
 无效施工合同的工程款结算
     工程竣工验收合格的，应按约定支付承包人工程价款
     修复后工程竣工验收合格的，承包人承担修复费用，应按约定支付承包人工程价款
     修复后工程竣工验收不合格的，不支付承包人工程价款
 
 */

#pragma mark 效力待定合同

/*
 效力待定合同规定(主体不合格)
 
  效力待定合同
     限制民事行为能力人订立的合同(纯获利益或智力相当除外)
     无权代理合同(无代理权、超越代理权或代理权终止)
     无处分权的人处分他人财产的合同(租赁、保管、运输、承揽)
 
 1限制民事行为能力人订立的合同相对人可催告法定代理人在1个月内追认，未最追认表示拒绝;善意相对人有撤销权;
 2无权代理合同，相对人可催告被代理人在1个月内追认，未做表示视为拒绝;善意相对人有撤销权;
 3无权订立合同事后取得处分权或经权利人追认，合同有效
 
 */

#pragma mark 可撤销合同(法院或仲裁机构撤销)

/*
 可撤销合同(法院或仲裁机构撤销)
     因重大误解订立的合同(大意、缺乏经验或信息不通)
     在订立合同时,显失公平的合同(价值过于悬殊)
     一方采用欺诈、胁迫手段或乘人之危订立的合同 此时只有受害方可以行使撤销权，只能请求法院或仲裁机构撤销
 注意:欺诈、胁迫损害国家利益无效
 
 
 撤销权消灭情形:
     撤销权一年内没行使的;
     知道事由后明确表示或以自己的行为放弃撤销权
 撤销的法律后果:自始无效(签合同时)
 
 */

#pragma mark 合同的履行、变更、转让、撤销和终止

/*
 合同的履行、变更、转让、撤销和终止
 
 合同的履行
     当事人不得以主体姓名、名称、法定代表人、负责人、承办人变更而不履行合同义务
 
 合同变更
     应双方协商一致且遵循法定程序
     变更内容约定不明视为合同未变更
 
 合同权利的转让
     不得转让的权利:
         根据合同性质不得转让(如人身性质);
         当事人约定不得转让;
         法律规定不得转让(建设工程合同、监理合同)
     应通知债务人，未经通知，该转让对债务人不发生效力
     与债权有关的从权利(如担保权利)随之转移，但专属于债权人自身的除外(人身损害赔 ，如军人退役补贴、残疾人补贴)
 合同义务的转让
     需征得债权人同意，未经债权人同意，债务人转移合同义务的行为对债权人不发生效力
 合同中权利和义务一并转让(如采购合同更换当事人)
     当事人一方经对方同意，可以将自己在合同中的权利和义务一并转让给第三人
 
 合同的终止
 
     合同终止的原因:履行、解除、抵销、提存、混同(同归一人)、免除
 
    合同解除
        合同解除的分类
            约定解除:协商一致
            法定解除:一方通知到达对方(3月内异议)
        法定解除条件
             (1)因不可抗力致使不能实现合同目的;
             (2)在履行期限届满之前，当事人一方明确表示或者以自己的行为表明不履行主要债务;
             (3)当事人一方迟延履行主要债务，经催告后在合理期限内仍未履行;
             (4)当事人一方迟延履行债务或其他违约行为致使不能实现合同目的
        解除的法律后果
             合同权利义务中止不影响合同中结算、清理条款和独立存在的解决争议方法的效力
 
 施工合同的解除(司法解释)
     发包人解除合同:
         承包人不履行合同主要义务;
         约定期限内未完工，催告合理期限仍未完工;
         工程质量不合格，且拒绝修复;
         非法转包、违法分包
     承包人解除合同:
         未按约定支付工程价款;
         提供的主要建筑材料、构配件和设备不符合强制性标准;
         不履行合同约定的协助义务
     解除法律后果:
         工程竣工验收合格的，应按约定支付承包人工程价款
         修复后工程竣工验收合格的，承包人承担修复费用
         修复后工程竣工验收不合格的，不支付承包人工程价款
 
 
 */

#pragma mark 违约责任及违约责任的免除

/*
 违约责任及违约责任的免除
 
 承担违约责任的种类
     法定责任:
         继续履行、采取补救措施、赔偿损失、停止违约行为
     约定责任:
         支付违约金或定金
 
 违约金和定金
     违约金低于造成的损失时，可请求法院或仲裁机构增加
     违约金过分高于造成的损失时，可请求法院或仲裁机构予以适当减少
 定金罚则(双倍返还)
 
 既约定违约金，又约定定金的，对方可选择其中一条款，但不能同时适用
 
 违约责任的免除
     不可抗力为违约方免除违约责任的法定事由
     不可抗力引起的损失由自己承担
     当事人迟延履行后发生不可抗力的，不能免除责任
     一方因发生不可抗力不能履行合同时，负有通知对方，并在合理期限内提供证明的责任
 
 
 建设工程合同示范文本
 《施工合同(示范文本)》内容:合同协议书、通用合同条款和专用合同条款
 法律地位:参考作用，无法律强制性
 */
#pragma mark - ************** 相关合同制度

#pragma mark 承揽合同
/*
 承揽合同的法律规定
 
 承揽合同是承揽人按照定定作人的要求完成工作，交付工作成果，定作人给付报酬的合同。
 承揽包括加工、订作、修理、复制、测试、检验等工作。
 
 4S店修车、加工零件均为承揽合同。车主——定作人，4S店——承揽人。
 
 一、承揽合同的特征
     (一)承揽合同以完成一定的工作并交付工作成果为标的
     (二)承揽人须以自己的设备、技术和劳力完成所承揽的工作
     (三)承揽人工作具有独立性
 承揽人在完成工作过程中，不受定作人的指挥管理，独立承担完成合同约定的质量、数量、期限等责任。
 承揽人在工作期间，应当接受定作人必要的监督检查。
 
 二、承揽合同当事人的权利义务:
     承揽合同是双务合同。
 
 (一)承揽人的义务
     1.按照合同约定完成承揽工作的义务
     2.材料检验的义务
         承揽人提供材料的，承揽人应当按照约定选用材料，并接受定作人检验。
         定作人提供材料的，承揽人应当对定作人提供的材料及时检验，发现不符合约定时，应当及时通知定作人更换、补齐或者采取其他补救措施。
     3.通知和保密的义务
     4.接受监督检查和妥善保管工作成果等的义务
         承揽人应当妥善保管定作人提供的材料以及完成的工作成果，因保管不善造成毁损、灭失的，应当承担损害赔偿责任。
     5.交付符合质量要求工作成果的义务
         承揽人交付的工作成果不符合质量要求的，定作人可以要求承揽人承担修理、重作、减少报酬、赔偿损失等违约责任。
     共同承揽人对定作人承担连带责任。
 (二)定作人的义务
     1.按照约定提供材料和协助承揽人完成工作的义务
     2.支付报酬的义务
         定作人应当按照约定的期限支付报酬。期限没有约定→协议补充→交易习惯
         定作人应当在承揽人交付工作成果时支付;
         工作成果部分交付的，定作人应当相应支付。除当事人另有约定的外，定作人未向承揽人支付报酬或者材料费等价款的，承揽人对完成的工作成果享有留置权。
     3.依法赔偿损失的义务
         定作人中途变更承揽工作的要求，造成承揽人损失的，应当赔偿损失。
         承揽人发现定作人提供的图纸或者技术要求不合理的，在通知定作人后，因定作人怠于答复等原因造成承揽人损失的，定作人应当赔偿损失。
     4.验收工作成果的义务
 三、承揽合同的解除
 (一)承揽人的法定解除权
     定作人不履行协助义务致使承揽工作不能完成的，承揽人可以催告定作人在合理期限内履行义务，并可以顺延履行期限;定作人逾期不履行的，承揽人可以依法解除合同。
 (二)定作人的法定解除权
     (经定作人同意)承揽人将其承揽的主要工作交由第三人完成的，应当就该第三人完成的工作成果向定作人负责;未经定作人同意的，定作人可以解除合同。
     承揽人将承揽的辅助工作交由第三人完成的，应当就第三人完成的工作成果向定作人负责。
 (三)定作人的法定任意解除权
     ——与施工合同不同 定作人可以随时解除承揽合同，造成承揽人损失的，应当赔偿损失。
 
 
 */

#pragma mark 买卖合同的法律规定

/*
 19min
 
  一、买卖合同的法律特征
     (一)买卖合同是一种转移财产所有权(——占有、使用、收益、处分)的合同
     (二)买卖合同是有偿合同
     (三)买卖合同是双务合同
     (四)买卖合同是诺成合同
     买卖合同可以是书面的，也可以是口头的。
     房屋买卖等标的额较大的财产买卖，应当签订书面合同。
 二、买卖合同当事人的权利义务
 (一)出卖人的主要义务
 1. 按照合同约定交付标的物的义务;
     (1)现实交付; 一手交货一手交钱
     (2)简易交付; 买方提前占有交易物
     (3)占有改定; 出卖后又租回
     (4)指示交付; 物品被第三人占有 指示第三人交付
     (5)拟制交付。交易票据类
 2. 转移标的物的所有权的义务;
     除法律另有约定或当事人另有约定以外，标的物的所有权自标的物交付时起转移。
     但是出卖具有知识产权的计算机软件等标的物的，除法律另有约定或当事人另有约定以外，该标的物的知识产权不属于买受人。
 3.瑕疵担保义务
     出卖人的瑕疵担保义务，可分为权利瑕疵担保义务和物的瑕疵担保义务。
     (1)权利瑕疵担保义务
         如果出卖人对于出卖的标的物没有所有权或处分权，或者没有完全的所有权或处分权，或者其处分涉及第三人的物权、知识产权等权益，则称其标的物存在权利瑕疵，出卖人因此应当承担权利瑕疵担保责任。
         买受人有确切证据证明第三人可能就标的物主张权利的，可以中止支付相应的价款，但出卖人提供适当担保的除外。
     (2)物的瑕疵担保义务
         出卖人就其所交付的标的物具有约定或法定品质所负有的担保义务。
 
 三、标的物毁损灭失风险的承担
 
     标的物毁损、灭失的风险，在标的物交付之前由出卖人承担，交付之后由买受人承担。
 
     因买受人的原因致使标的物不能按照约定的期限交付的，买受人应当自违反约定之日起承担标的物毁损、灭失的风险。
 
     出卖人出卖交由承运人运输的在途标的物，除当事人另有约定的以外，毁损、灭失的风险自合同成立时起由买受人承担。
     但在合同成立时出卖人知道或者应当知道标的物已经毁损、灭失却未告知买受人的，出卖人应当负担标的物毁损、灭失的风险。
 
     对于需要运输的标的物，当事人没有约定交付地点或约定不明确，出卖人将标的物交付给第一承运人后，标的物毁损、灭失的风险由买受人承担。
     出卖人依约将标的物置于交付地点，买受人违反约定没有收取的，标的物毁损、灭失的风险自违反约定之日起由买受人承担。
 
 四、特殊买卖合同的规定
     凭样品买卖:封存样品。
     试用买卖:适用买卖期间可以购买标的物，也可以拒绝购买。届满，买受人对是否购买标的物未作表示的，视为购买。
 五、孳息的归属和买卖合同的解除
     1、归属:交付。（交付时发生转移）
         法定孳息:租金、利息。
     2、解除:主物解除及于从物，从物不及于主物
         数物中，一物解除，其他物受损，数物也可解除
         多批物品中，一批解除，视关联程度解除其他批次
         分期付款，未支付价款达到五分之一，对方可要求支付全部价款或者解除合同，同时要求支付该物品使用费。
 
 
 */

#pragma mark 借款合同的法律规定

/*
  一、借款合同的法律特征
     (一)借款合同的标的物是货币
     (二)借款合同一般为要式合同
         借款合同采用书面形式，但自然人之间借款另有约定的除外。
     (三)借款合同一般是有偿合同
         借款合同原则上为有偿合同，也可以是无偿合同。
 
 二、借款合同当事人的权利义务
 (一)贷款人的义务
     贷款人的主要义务是提供借款和不得预扣利息。
     借款的利息不得预先在本金中扣除。利息预先在本金中扣除的，应当按照实际借款数额返还借款并计算利息。
 三、借款合同的其他规定
     自然人之间的借款合同，自贷款人提供借款时生效。（自然人之间的借款合同是实践合同，自然人与金融机构之间的借款合同是诺成合同）
     自然人之间的借款合同对支付利息没有约定或者约定不明确的，视为不支付利息。
 
 */

#pragma mark 租赁合同的法律规定

/*
  一、租赁合同的法律特征
     租赁合同是转移租赁物使用收益权(——占有、使用、收益，无处分)的合同，也是诺成合同和双务、有偿合同。
 二、租赁合同的内容和类型
     (二)租赁合同的类型
         租赁合同根据租赁标的物不同，可分为动产租赁和不动产租赁。
         此外，根据是否约定租赁期限，还可分为定期租赁和不定期租赁。
 
         租赁合同可以约定租赁期限，但租赁期限不得超过20年。超过20年的， 超过部分无效。
         租赁期限6个月以上的，应当采用书面形式。当事人未采用书面形式的，视为不定期租赁。不定期租赁，当事人可以随时解除合同。
 三、租赁合同当事人的权利义务
     (一)出租人的义务
         出租人的主要义务是交付出租物、维修租赁物、权利瑕疵担保、物的瑕疵担保、保证承租人优先购买权和保证共同居住人继续承租。
         除当事人另有约定的外，出租人应当履行租赁物的维修义务。
         出租人出卖租赁房屋的，应当在出卖之前的合理期限内通知承租人，承租人享有以同等条件优先购买的权利。
         租赁物在租赁期间发生所有权变动的，不影响租赁合同的效力。——买卖不破租赁
     (二)承租人的义务
         承租人的主要义务是支付租金、按照约定使用租赁物、妥善保管赁物、有关事项通知、返还租赁物和损失赔偿。
         承租人应当按照约定的期限支付租金。
 
         承租人经出租人同意，可以将租赁物转租给第三人。
         承租人转租的，承租人与出租人之间的租赁合同继续有效，第三人对租赁物造成损失的，承租人应当赔偿损失。
         承租人未经出租人同意转租的，出租人可以解除合同。
 
 */

#pragma mark 融资租赁合同的法律规定

/*
 融资租赁合同的法律规定
 《合同法》规定，融资租赁合同是出租人根据承租人对出卖人、租赁物的选择，向出卖人购买租赁物，提供给承租人使用，承租人支付租金的合同。
 
 
 一、融资租赁合同的法律特征
     (一)出租人身份的二重性
         出租人是租赁行为的出租方，又是买卖关系的买受人。
         承租人将其自有物出卖给出租人，再通过融资租赁合同将租赁物从出租人处租回的，人民法院不应仅以承租人和出卖人系同一人为由认定不构成融资租赁法律关系。
     (二)出卖人权利与义务相对人的差异性
         承租人享有买受人的权利但不承担买受人的义务。
         出租人不负担租赁物的维修与瑕疵担保义务，但承租人须向出租人履行交付租金义务。
     (三)融资租赁合同是要式合同
         《合同法》规定，融资租赁合同应当采用书面形式。
 二、融资租赁合同当事人的权利义务
     (一)出租人的义务
         出租人应当根据承租人对出卖人、租赁物的选择订立的买卖合同，向出卖人支付标的物的价金。
         出租人应当保证承租人对租赁物的占有和使用。
 
         出租人、出卖人、承租人可以约定，出卖人不履行买卖合同义务的，由承租人行使索赔的权利。
         承租人行使索赔权利的，出租人应当协助。
 
         出租人根据承租人对出卖人、租赁物的选择订立的买卖合同，未经承租人同意，出租人不得变更与承租人有关的合同内容。
         租赁物不符合约定或者不符合使用目的的，出租人不承担责任，但承租人依赖出租人的技能确定租赁物或者出租人干预选择租赁物的除外。
 
     (二)出卖人的义务
         出卖人的主要义务是向承租人交付标的物、标的物的瑕疵担保。
         出卖人违反合同约定的向承租人交付标的物的义务，承租人因下列情形之一拒绝受领租赁物的，人民法院应予支持:
         (1)租赁物严重不符合约定的;
         (2)出卖人未在约定的交付期间或者合理期间内交付租赁物，经承租人或者出租人催告，在催告期满后仍未交付的。
     (三)承租人的义务
         承租人应当履行占有租赁物期间的维修义务。承租人占有租赁物期间，因租赁物造成第三人的人身伤害或者财产损害的，出租人不承担责任。
         出租人享有租赁物的所有权。
         出租人和承租人可以约定租赁期间届满租赁物的归属。没有约定→协议补充→交易习惯→出租人。
         承租人破产的，租赁物不属于破产财产。
         《解释》规定，承租人占有租赁物期间，租赁物毁损、灭失的风险由承租人承担，出租人要求承租人继续支付租金的，人民法院应予支持。但当事人另有约定或者法律另有规定的除外。
         出租人转让其在融资租赁合同项下的部分或者全部权利，受让方以此为由请求解除或者变更融资租赁合同的，人民法院不予支持。
 */

#pragma mark - ************** 建设工程安全生产法律制度
/*
 */

#pragma mark ******* 施工安全生产许可证制度   （8分）
/*
 
 国家对矿山企业、建筑施工企业和危险化学品、烟花爆竹、民用爆炸物品生产企业(以下统称企业)实行安全生产许可制度。(不包括经营、储存单位)
 企业未取得安全生产许可证的，不得从事生产活动。省、自治区、直辖市人民 政府建设主管部门负责建筑施工企业安全生产许可证的颁发和管理，并接受国务院建设主管部门的指导和监督。
 
 */

 #pragma mark 申领安全生产许可证的条件（必考）
/*
 (1)建立、健全 安全生产责任制 ，制定完备的安全生产规章制度和操作规程; （安全生产责任制）
 (2)保证本单位安全生产条件 所需资金的投入 ; （资金投入）
 (3)设置 安全生产管理机构 ，按照国家有关规定配备 专职 安全生产管理人员; （安全生产管理机构 专职人员）
 (4)主要负责人、项目负责人、专职安全生产管理人员经建设主管部门或者其他有关部门考核合格; （考核合格）
 (5)特种作业人员经有关业务主管部门考核合格，取得特种作业操作资格证书; （特种作业人员）
 (6)管理人员和作业人员每年至少进行一次安全生产教育培训并考核合格; （每年一次培训）
 (7)依法参加工伤保险，依法为施工现场从事危险作业的人员办理意外伤害保险， 为从业人员交纳保险费; （工伤保险）
 (8)施工现场的办公、生活区及作业场所和安全防护用具、机械设备、施工机具及配件符合有关安全生产法律、法规、标准和规程的要求;
 (9)有职业危害防治措施，并为作业人员配备符合国家标准或者行业标准的安全防护用具和安全防护服装; （职业危害防治措施）
 (10)有对危险性较大的分部分项工程及施工现场易发生重大事故的部位、环节的预防、监控措施和应急预案;
 (11)有生产安全事故应急救援预案、应急救援组织或者应急救援人员，配备必要的应急救援器材、设备; （生产安全事故应急救援预案）
 (12)法律、法规规定的其他条件。
 
 */

#pragma mark  安全生产许可证的有效期和政府监管的规定
/*

 颁发机构:
     省级政府建设主管部门
 
 安全生产许可证的有效期为3年。
 安全生产许可证有效期满需要延期的，企业应当于期满前3个月向原安全生产许可证颁发管理机关办理延期手续
 企业在安全生产许可证有效期内，严格遵守有关安全生产的法律法规，未发生死亡事故的，安全生产许可证有效期届满时，经原安全生产许可证颁发管理机关同意，不再审查，安全生产许可证有效期延期3年。
 
 三、政府监管
 住房城乡建设主管部门在审核发放施工许可证时，应当对已经确定的建筑施工企业是否有安全生产许可证进行审查，对没有取得安全生产许可证的，不得颁发施工许可证。
 
 企业取得安全生产许可证后，不得降低安全生产条件。
 安全生产许可证颁发管理机关发现企业不再具备安全生产条件的，应当暂扣或者吊销安全生产许可证。
 
 安全生产许可证颁发管理机关或者其上级行政机关发现有下列情形之一的，可以撤销安全生产许可证:
     (1)安全生产许可证颁发管理机关工作人员滥用职权、玩忽职守颁发安全生产许可证的;
     (2)超越法定职权颁发安全生产许可证的;
     (3)违反法定程序颁发安全生产许可证的;
     (4)对不具备安全生产条件的建筑施工企业颁发安全生产许可证的;
     (5)依法可以撤销已经颁发的安全生产许可证的其他情形。
 
 注意撤销和注销的区别
 
 */

#pragma mark *******  施工安全生产责任和安全生产教育培训制度
/*
 
 */

#pragma mark 施工单位的安全生产责任(4制度、5责任)
/*
 施工单位的安全生产责任(4制度、5责任)
 4制度:
    安全生产责任制度，
    负责人现场带班制度，
    重大事故隐患治理挂牌督办制度，
    群防群治制度
 5责任(总包单位):
    明确总分包双方的安全生产责任，
    统一编制应急 救援预案，
    上报施工生产安全事故，
    自行完成主体结构的施工，
    连带责任
 
                                               三类人员的职责区分
 
 企业负责人(A证)                                  项目负责人(B证)                                       专职安全员(C证)
 建立生产责任制和生产教育培训制度           生产责任制、安全生产规章制度和操作规程                     施工现场安全生产日常检查并做好检查记录
 安全生产制度和操作规程                    根据工程的特点组织制定安全施工措施、                  现场监督危险性较大的工程安全专项施工方案的实施情况
 本单位安全生产条件                                  安全施工的                               对作业人员违规违章行为有权予以纠正或查处
 对承建工程进行定期和专项安全检查                       安全事故                                对施工现场存在的安全隐患有权责令立即整改
 及时、如实报告生产安全事故                      对建设工程的安全施工                          发现重大安全隐患，有权向企业安全生产管理机构报告
 对本单位的安全生产工作全面负责                                                                    依法报告生产安全事故情况
 
 注:建筑施工企业负责人，是指企业的法定代表人、总经理、主管质量安全和生产工作的副总经理、总工程师和副总工程师。
 
 
 【都是应当 不是必须】
                                时间要求                                                        工作要求
 企业负责人          定期带班检查，≥工作日的25%，应当施工现场带班检查，                         分别在公司和项目部存档备查
             超过一定规模的危险性较大的分部分项工程，工程项目出现险情或发现重大隐患时;
             对于有分公司的企业集团， 集团负责人可书面委托工程所在地分公司负责人带班检查。
 
 项目负责人                  ≥施工时间的80%                                              记录存档备查，全面掌握生产状况，
                                                                                     加强对重点关键环节的控制，及时
                                                                                     消除隐患，(向建设单位)，离开
                                                                                     期间委托项目相关负责人负责其外
                                                                                     出时的日常工作
 
 */

#pragma mark 施工总承包和分包单位的安全生产责任
/*
 
 《建筑法》规定，施工现场安全由建筑施工企业负责。实行施工总承包的，由总承包单位负责。分包单位向总承包单位负责，服从总承包单位对施工现场的安全生产管理。
 《安全生产法》规定，两个以上生产经营单位在同一作业区域内进行生产经营活动，可能危及对方生产安全的，应当签订安全生产管理协议，明确各自的安全生产管理职责和应当采取的安全措施，并指定专职安全员进行安全检查与协调。
 
 一、总承包单位应当承担的法定安全生产责任
    (一)分包合同应当明确总分包双方的安全生产责任
         施工总/分包单位的安全生产责任，分为法定责任和约定责任。
         约定责任不能与法定责任相抵触。
     (二)统一组织编制建设工程生产安全应急救援预案
         总包统一编，总分各自建。
     (三)负责上报施工生产安全事故
         无论是总包还是分包发生的安全事故均由总包上报
     (四)自行完成建设工程主体结构的施工
     (五)承担连带责任
         总承包单位和分包单位对分包工程的安全生产承担连带责任。
 二、分包单位应当承担的法定安全生产责任
 《安全条例》规定，分包单位应当服从总承包单位的安全生产管理，分包单位不服从管理导致生产安全事故的，由分包单位承担主要责任。
 
 */

#pragma mark 施工作业人员安全生产的权利和义务
/*
 
  一、施工作业人员依法享有的安全生产保障权利
        (一)施工安全生产的知情权和建议权
        (二)施工安全防护用品的获得权
            ——获得是权利，正确使用是义务
            施工安全防护用品一般包括安全帽、安全带、安全网、安全绳等。
        (三)批评、检举、控告权及拒绝违章指挥权  （有批评权）
        (四)紧急避险权
        (五)获得工伤保险和意外伤害保险赔偿的权利
        ( 六 ) 请求民事赔偿权
        ( 七 ) 依靠工会维权和被派遣劳动者的权利
 
 二、施工作业人员应当履行的安全生产义务
     遵章义务、培训义务、事故隐患报告义务
     (一)守法遵章和正确使用安全防护用具等的义务
         ——获得是权利，正确使用是义务
     (二)接受安全生产教育培训的义务
         ——建造师继续教育中，接受培训既是权利又是义务;
             安全生产中，接受培训只是义务    （只是义务）
     (三)施工安全事故隐患报告的义务 （报告是义务）
     (四)被派遣劳动者的义务
 《安全生产法》规定，生产经营单位使用被派遣劳动者的，被派遣劳动者应当履行本法规定的从业人员的义务。
 
 */

#pragma mark 施工单位安全生产教育培训的规定
/*
 
  一、施工单位三类管理人员与特种作业人员的培训考核
 (一)三类管理人员的培训考核
     《安全条例》规定，施工单位的主要负责人、项目负责人、专职安全生产管理人员应当经建设行政主管部门或者其他部门考核合格后方可任职。
 (二)特种作业人员的培训考核
     《安全条例》规定，垂直运输机械作业人员、安装拆卸工、爆破作业人员、起重信号工、登高架设作业人员等特种作业人员，必须按照国家有关规定经过专门的安全作业培训，并取得特种作业操作资格证书后，方可上岗作业。
 
     《建筑施工特种作业人员管理规定》规定，建筑施工特种作业包括:
         (1)建筑电工;（电焊工也是）
         (2)建筑架子工;
         (3)建筑起重信号司索工;
         (4)建筑起重机械司机;
         (5)建筑起重机械安装拆卸工;
         (6)高处作业吊篮安装拆卸工;
         (7)经省级以上人民政府建设主管部门认定的其他特种作业。
 
 二、施工单位全员的安全生产教育培训
     《安全条例》规定，施工单位应当对管理人员和作业人员每年至少进行一次安全生产教育培训。
 三、进入新岗位或者新施工现场前的安全生产教育培训
     建筑企业要对新职工进行至少32学时的安全培训，每年进行至少20学时的再培训。 （32 20）
 四、采用新技术、新工艺、新设备、新材料前的安全生产教育培训
 五、安全教育培训方式
 
     安全教育培训形式:安全形势报告会、事故案例分析会、安全法制教育、安全技术交流、安全竞赛、师傅带徒弟等。
 
     高危企业新职工安全培训合格后，要在工人师傅带领下，实习至少2个月后方可独立上岗。工人师傅应具备中级工以上技能等级，3年以上相应工作经历，成绩突出，善于“传、帮、带”，没有发生过“三违” 行为等条件。
 
 
 */



#pragma mark *******  施工现场安全防护制度
/*
 */
#pragma mark 编制安全技术措施、专项施工方案和安全技术交底的规定
/*

 一、编制安全技术措施和施工现场临时用电方案
    《施工现场临时用电安全技术规范》规定，施工现场临时用电设备在【5台】及以上或设备总容量在【50kW】及以上者，应编制【用电组织设计】。
    施工现场临时用电设备在5台以下或设备总容量在50kW以下者，应制定【安全用电和电气防火措施】。
 二、编制【安全专项施工方案】
    《安全条例》规定，对下列达到一定规模的危险性较大的分部分项工程编制【专项施工方案】，并附具安全验算结果，经【施工单位技术负责人、总监理工程师】签字后实施，由【专职安全员】进行现场监督:
     (1)基坑支护与降水工程;
     (2)土方开挖工程;
     (3)模板工程;
     (4)起重吊装工程;
     (5)脚手架工程;
     (6)拆除、爆破工程;
     (7)国务院建设行政主管部门或者其他有关部门规定的其他危险性较大的工程。
     对以上所列工程中涉及以下事项的 施工单位(——总承包) 还应当组织【专家论证】。 （施工单位组织论证）
     (1)深基坑、
     (2)地下暗挖工程、
     (3)高大模板工程的专项施工方案，
 
 
 
 */
#pragma mark 施工现场安全防护和安全费用的规定
/*
  一、施工现场安全防护
 (一)危险部位设置安全警示标志
     施工单位应当在【施工现场入口处】、施工起重机械、临时用电设施、脚手架、出入通道口、楼梯口、电梯井口、孔洞口、桥梁口、隧道口、【基坑边沿】、爆破物及有害危险气体和液体存放处等危险部位，设置明显的安全警示标志。
 
    不包括施工现场出口处、基坑底部
 
 (二)不同施工阶段和暂停施工应采取的安全施工措施
     《安全条例》规定，施工现场暂时停止施工的，施工单位应当做好现场防护，所需费用由责任方承担，或者按照合同约定执行。
 (三)施工现场临时设施的安全卫生要求
    《安全条例》规定，施工单位应当将施工现场的办公、生活区与作业区分开设置，并保持安全距离;办公、生活区的选址应当符合安全性要求。（办公、生活区可以混合）
    职工的膳食、饮水、休息场所等应当符合卫生标准。
    施工单位不得在尚未竣工的建筑物内设置员工集体宿舍。 （通过竣工验收也不行 只要尚未竣工就不行）
    施工现场临时搭建的建筑物应当符合安全使用要求。
    施工现场使用的装配式活动房屋应当具有产品合格证。
 
 (四)对施工现场周边的安全防护措施
    《安全条例》规定，施工单位对因建设工程施工可能造成损害的毗邻建筑物、构筑物和地下管线等，应当采取专项防护措施。
    在城市市区内的建设工程，施工单位应当对施工现场实行封闭围挡。
 
 (五)危险作业的施工现场安全管理
     《安全生产法》规定，生产经营单位进行爆破、吊装等危险作业，应当安排专门人员进行现场安全管理。
     《危险化学品安全管理条例》规定，进行可能危及危险化学品管道安全的施工作业，施工单位应当在开工的 【7日前】【书面通知】 管道所属单位，并与管道所属单位共同制定应急预案。（【7日 书面通知 施工单位 管道所属单位】）
 (六)安全防护设备、机械设备等的安全管理
     《安全条例》规定，施工单位采购、租赁的安全防护用具、机械设备、施工机具及配件，应当具有【生产(制造)许可证】、【产品合格证】（不是产品销售许可证），并在进入施工现场前进行查验。
 (七)施工起重机械设备等的安全使用管理
     《安全条例》规定，使用承租的机械设备和施工机具及配件的，由【施工总承包单位、分包单位、出租单位和安装单位】共同进行验收。(不需要设计、监理和建设单位验收)验收合格的方可使用。
 
 
 二、施工单位安全生产费用的提取和使用管理
 (一)施工单位安全费用的提取管理
     建设单位与施工单位在施工合同中对安全防护、文明施工措施费用预付、支付计划未作约定或约定不明的，
     合同工期在一年以内的，建设单位预付安全防护、文明施工措施项目费用不得低于该费用总额的【50%】;
     合同工期在一年以上的(含一年)，预付安全防护、文明施工措施费用不得低于该费用总额的【30%】，其余费用应当按照施工进度支付。
     【注意一年的计算】
 
     《建筑安装工程费用项目组成》，规定安全文明施工费包括:
         (1)环境保护费。
         (2)文明施工费。
         (3)安全施工费。
         (4)临时设施费。
 
 (二)施工单位安全费用的使用管理
     《企业安全生产费用提取和使用管理办法》中规定，建设工程施工企业安全费用应当按照以下范围使用:
         (1)完善、改造和维护安全防护设施设备支出(【不含“ 三同时”要求初期投入的安全设施】)，包括施工现场临时用电系统、洞口、临边、机械设备、高处作业防护、交叉作业防护、防火、防爆、防尘、防毒、防雷、防台风、防地质灾害、地下工程有害气体监测、通风、临时安全防护等设施设备支出;
         (2)配备、维护、保养应急救援器材、设备支出和应急演练支出;
         (3)开展重大危险源和事故隐患评估、监控和整改支出;
         (4)安全生产检查、评价(【不包括新建、改建、扩建项目安全评价】)、咨询和标准化建设支出;
         (5)配备和更新现场作业人员安全防护用品支出;
         (6)安全生产宣传、教育、培训支出;
         (7)安全生产适用的新技术、新标准、新工艺、新装备的推广应用支出;
         (8)安全设施及特种设备检测检验支出;
         (9)其他与安全生产直接相关的支出。
 
 在规定的使用范围内，企业应当将安全费用【优先用于】满足安全生产监督管理部门、煤矿安全监察机构以及行业主管部门对企业安全生产提出的【整改措施】或者达到安全生产标准所需的支出。
 工程总承包单位对建筑工程安全防护、文明施工措施费用的使用负总责。
 总承包单位应当按照本规定及合同约定及时向分包单位支付安全防护、文明施工措施费用。
 总承包单位不按本规定和合同约定支付费用，造成分包单位不能及时落实安全防护措施导致发生事故的，由总承包单位负主要责任。
 
 */
#pragma mark 施工现场消防安全职责和应采取的消防安全措施
/*
 
 一、施工单位消防安全责任人和消防安全职责
     机关、团体、企业事业单位法定代表人是本单位消防安全第一责任人。
     切实提高检查消除火灾隐患、组织扑救初起火灾、组织人员疏散逃生和消防宣传教育培训的能力。
     《消防法》规定，机关、团体、企业事业单位，对建筑消防设施每年至少进行一次全面检测。
     单位的主要负责人是本单位的消防安全责任人。
     重点工程的施工现场多位消防安全重点单位。
     注意还应当履行的四个特殊职责。
 二、施工现场的消防安全要求(了解具体要求)
 
 三、施工单位消防安全自我评估和防火检查
     消防安全重点单位每季度、其他单位每半年自行或委托有资质的机构对本单位进行一次消防安全检查评估。
     国家、省级等重点工程的施工现场应当进行每日防火巡查。
 五、施工单位的消防安全教育培训和消防演练
     施工单位应当建立施工现场消防组织，制定灭火和应急疏散预案，并至少每半年组织一次演练。 （消防演练半年一次）
 
 */
#pragma mark 工伤保险(强制)和意外伤害保险(鼓励)的规定
/*
 
 一、工伤保险的规定
     《工伤保险条例》规定，中国境内的企业、事业单位、社会团体、民办非企业单位、基金会、律师事务所、会计师事务所等组织和有雇工的个体工商户应当参加工伤保险。
 (一)工伤保险基金
     工伤保险基金由【用人单位缴纳的工伤保险费】、【工伤保险基金的利息】和依法纳入工伤保险基金的【其他资金】构成。
     用人单位应当按时缴纳工伤保险费。职工个人不缴纳工伤保险费。
     工伤保险基金存入社会保障基金财政专户，用于工伤保险待遇，劳动能力鉴定，工伤预防的宣传、培训等费用，以及法律、法规规定的用于工伤保险的其他费用的支付。
     任何单位或者个人不得将工伤保险基金用于投资运营、兴建或者改建办公场所、发放奖金，或者挪作其他用途。
 (二)工伤认定
     职工有下列情形之一的，应当认定为工伤:
         (1)在工作时间和工作场所内，因工作原因受到事故伤害的;
         (2)工作时间前后在工作场所内，从事与工作有关的预备性或者收尾性工作受到事故伤害的;
         (3)在工作时间和工作场所内，因履行工作职责受到暴力等意外伤害的;
         (4)患职业病的;
         (5)因工外出期间，由于工作原因受到伤害或者发生事故下落不明的;
         (6) 在上下班途中，受到非本人主要责任的交通事故或者城市轨道交通、客运 轮渡、火车事故伤害的;
         (7)法律、行政法规规定应当认定为工伤的其他情形。
     职工有下列情形之一的，视同工伤:
         (1)在工作时间和工作岗位，突发疾病死亡或者在48小时之内经抢救无效死亡的;
         (2)在抢险救灾等维护国家利益、公共利益活动中受到伤害的;
         (3)职工原在军队服役，因战、因公负伤致残，已取得革命伤残军人证，到用人单位后旧伤复发的。
     职工符合以上的规定，但是有下列情形之一的，不得认定为工伤或者视同工伤:
         (1)故意犯罪的;
         (2)醉酒或者吸毒的;
         (3)自残或者自杀的。
     (在施工现场斗殴受伤;施工期间醉酒坠落致残;在办公场所内因劳资纠纷自杀;因失恋，上班时间爬到公司楼顶跳楼自杀;精神抑郁，酗酒过度需要进行治疗;在工作场所与上司产生摩擦，拿剪刀将自己的胸脯刺伤。——均不是工伤。)
 
     职工发生事故伤害或者职业病，所在单位应当自事故伤害发生之日或者鉴定为职业病之日起30日内，提出工伤认定申请。用人单位未按以上规定提出工伤认定申请的，工伤职工或者其近亲属、工会组织在事故伤害发生之日或者鉴定为职业病之日起1年内，可以直接提出工伤认定申请 (——单位30日，个人1年)。
     用人单位未在以上规定的时限内提交工伤认定申请，在此期间发生的工伤待遇等有关费用由该用人单位负担。
 
     职工或者其近亲属认为是工伤，用人单位不认为是工伤的，由用人单位承担举证责任。
 
     社会保险行政部门应当自受理工伤认定申请之日起60日内作出工伤认定的决定。
     社会保险行政部门对受理的事实清楚、权利义务明确的工伤认定申请，应当在15日内作出工伤认定的决定
 
 二、建筑意外伤害保险的规定
     《建筑法》规定，鼓励企业为从事危险作业的职工办理意外伤害保险，支付保险费。（被保险人为从事危险作业人员）
     施工单位应当为施工现场从事危险作业的人员( 高处、深基坑、爆破作业)办理意外伤害保险。
     意外伤害保险费由施工单位支付。
     实行施工总承包的，由总承包单位支付意外伤害保险费。
 
     意外伤害保险期限自建设工程开工之日起至竣工验收合格止。
     保险费应当列入建筑安装工程费用。
     施工企业应在工程项目开工前，办理完投保手续。
 
 */
#pragma mark *******  施工安全事故的应急救援与调查处理

#pragma mark 生产安全事故的等级划分标准
/*
 生产安全事故划分要素:人身、经济、社会因素
 
 事故类别               死亡人数x      重伤人数y          直接经济损失z           罚款
 特别重大事故             x≥30        y≥100               z≥ 1亿元          500万≤y<1000 万
 重大事故               10≤x< 30     50≤y< 100          5000≤z<1亿 元      100万≤y<500 万
 较大事故               3≤x< 10      10≤y< 50           1000万≤z< 5000万   50万≤y<100万
 一般事故               x<3           y<10              z<1000万元           20万≤y<50万
 
 生产安全事故划分划分标准由国务院规定
 
 */

#pragma mark 生产安全事故报告
/*
 
 1.事故现场有关人员立即上报
 2.单位负责人(总承包的由总承包单位上报) 1h之内上报
        组织抢救
        保护现场
        及时上报
 
 3.县级建设、安监部门   2H之内逐级上报
 
 4.上级主管部门
 
 
 逐级上报至：
 特别重大事故         国务院
 重大事故
 
 较大事故           省级政府
 一般事故           市级政府
 
出现新情况应补报;30日内，伤亡数变化，应补报;交通、火灾7日内，伤亡变化的， 应补报
 
 报告事故内容:
    (1)事故发生单位概况;
    (2)事故发生的时间、 地点及事故现场情况;
    (3)事故的简单经过;
    (4)伤亡人数和直接经济损失;
    (5)已经采取的措施;
    (6)其他应当报告的情况
 
 
 二、发生施工生产安全事故后应采取的相应措施
 (一)组织应急抢救工作
     事故发生单位负责人接到事故报告后， 应当立即启动事故相应应急预案，或者采取有效措施，组织抢救，防止事故扩大，减少人员伤亡和财产损失。
 (二)妥善保护事故现场
     事故发生后有关单位和人员应当妥善保护事故现场以及相关证据，任何单位和个人不得破坏事故现场、毁灭相关证据。因抢救人员、防止事故扩大以及疏通交通等原因，需要移动事故现场物件的，应当做出标志，绘制现场简图并做出书面记录，妥善保存现场重要痕迹、物证。
 
     确因特殊情况需要移动事故现场物件的，须同时满足以下条件:
         (1)抢救人员、防止事故扩大以及疏通交通的需要;
         (2)经事故单位负责人或者组织事故调査的安全生产监督管理部门和负有安全生产监督管理职责的有关部门同意;
         (3)做出标志，绘制现场简图， 拍摄现场照片，对被移动物件贴上标签，并做出书面记录:
         (4)尽量使现场少受破坏。
 
 三、生产安全事故调查处理
 地域管辖:
     事故发生地政府
 
 级别管辖:
     特别重大事故     国务院
     重大事故        省级人民政府
     较大事故        市级人民政府
     一般事故        县级人民政府
     非死亡事故      委托事故发生单位
 
 
  上级政府认为必要，可调查下级政府负责调查事故。
 自事故发生之日起30日内(交通、火灾事故7日内)，因事故伤亡人数变化导致事故等级发生变化，可以另行组织事故调查组。
 事故调查组应自事故发生之日起60日提交调查报告，特殊情况最长可延长60日
 
 
 事故调查组由
     1有关人民政府、
     2安监部门、
     3负有安监职责的有关 部门、
     4监察机关、
     5公安机关以及
     6工会派人组成，并应当邀请
     7人民检察院派人参加。——不包括人民法院。
 事故调査组履行下列职责:
     (1)査明事故发生的经过、原因、人员伤亡情况及直接经济损失;
     (2)认定事故的性质和亊故责任;
     (3) 提出对亊故责任者的处理建议;
     (4)总结事故教训，提出防范和整改措施;
     (5)提交事故调査报告。
 事故调査报告应当包括下列内容:
     (1)事故发生单位概况;
     (2)事故发生经过和事故救援情况;
     (3)事故造成的人员伤亡和直接经 济损失;
     (4)事故发生的原因和事故性质;
     (5)事故责任的认定以及对事故责任者的处理建议;
     (6)事故防范和整改措施。
 */

#pragma mark *******  建设单位和相关单位的建设工程安全责任制度

/*
 
 责任主体                                安全生产责任
 
 建设单位          (1)编制工程概算时，应当确定建设工程安全生产所需费用;
                 (2)申请领取施工许可证时提供有关的安全施工措施的资料;
                 (3)涉及建筑主体和承重结构变动的装修工程，建设单位应当在施工前委托原设计单位或者具有相应资质条件的设计单位提出设计方案;没有设计方案的，不得施工。
 
 设计单位         (1)对涉及施工安全的重点部位和环节在设计文件中注明，并对防范生产安全事故提出指导意见。
                 (2)采用新结构、新材料、新工艺的建设工程和特殊结构的建设工程，设计单位应当在设计中提出保障工作作业人员安全和预防安全事故的措施建议。
 
 监理单位         (1)发现存在安全 【事故隐患】的，应当要求施工单位 【整改】;
                (2)【情况严重】 的应当要求施工单位 【暂时停止施工，并及时报告建设单位】;
                (3)施工单位拒不整改或不停止施工的，工程监理单位【应当及时向有关主管部门报告】。
 
 安装拆卸单位     (1)必须由具有相应资质的单位承担;
                (2)应当编制拆装方案、制定安全施工措施，并由专业技术人员现场监督;
                (3)安装完毕后，安装单位应当自检，出具自检合格证明，并向施工单位进行安全使用说明，办理验收手续并签字。
 */
#pragma mark - ************** 建设工程质量法律制度

#pragma mark ***** 工程建设标准

#pragma mark 工程建设标准的分类
/*
 工程建设标准的分类
 
     我国的标准分为国家标准、行业标准、 地方标准和企业标准。
 
     国家标准、行业标准分为强制性标准和推荐性标准。
         保障人体健康，人身、财产安全的标准和法律、行政法规规定强制执行的标准是强制性标准，其他的标准是推荐性标准。
 【强制性和推荐性的区分】
 
     工程建设国家标准的制订程序分为准备、征求意见、送审和报批四个阶段
 
 国家强制性标准:（通用的属于国家强制性标准）
     (1)工程建设勘察、规划、设计、施工(包括安装)及验收等通用的综合标准和重要的通用的质量标准
     (2)工程建设【通用】的有关安全、卫生和环境保护的标准
     (3)工程建设重要的通用的术语、符号、代号、计量与单位、建筑模数和制图方法标准
     (4)工程建设重要的通用的试验、检验和评定方法等标准
     (5)工程建设重要的通用的信息技术标准。
 一般国家标准【实施】后5年复审1次  （不是颁布后）
 
 行业标准强制性标准（行业的属于行业标准）
     (1)工程建设勘察、规划、设计、施工(包括安装)及验收等行业专用的综合性标准和重要的行业专用的质量标准
     (2)工程建设【行业】专用的有关安全、卫生和环境保护的标准
     (3)工程建设重要的行业专用的术语、符号、代号、计量与单位和制图方法标准
     (4)工程建设重要的行业专用的试验、检验和评定方法等标准
     (5)工程建设重要的行业专用的信息技术标准
 行业标准不得与国家标准相抵触。
 在公布国家标准之后，该项行业标准即行废止。
 一般实施后5年复审1次
 
 工程建设地方标准
     没有国家标准、行业标准或不具体，可制定地方标准
     对直接涉及人民财产安全、人体健康、环境保护和公共利益的条文，经国务院建设行政主管部门确定后，可作为强制性条文
     地方标准不得与国家标准和行业标准相抵触。相抵触的工程建设地方标准的规定，应当自行废止
 
 
 工程建设企业标准
     企业生产的产品没有国家标准和行业标准的，应当制定企业标准，作为组织生产的依据
     已有国家标准或者行业标准的，国家鼓励企业制定严于国家标准或者行业标准的企业标准，在企业内部适用
 */

#pragma mark 工程建设强制性标准实施的规定
/*
 工程建设标准强制性条文的实施:工程建设各方主体。
     (1)工程建设强制性标准是指直接涉及工程质量、安全、卫生及环境保护等方面的工程建设标准强制性条文。
         由国务院住房城乡建设主管部门会同国务院有关部门确定。
     (2)建设工程勘察、设计文件中规定采用的新技术、新材料，可能影响建设工程质量和安全，又没有国家技术标准的，应当由国家认可的检测机构进行试验、论证，出具检测报告，并经国务院有关主管部门或者省、自治区、直辖市人民政府有关主管部门组织的建设工程技术专家委员会审定后，方可使用。
     (3)工程建设中采用国际标准或者国外标准，而我国现行强制性标准未作规定的，建设单位应当向国务院住房城乡建设主管部门或者国务院有关主管部门备案。
 */
#pragma mark ***** 施工单位的质量责任和义务
/*
 《建筑工程五方责任主体项目负责人质量终身责任追究暂行办法》 (2014)规定:
     建筑工程开工建设前，建设、勘察、设计、施工、监理单位法定代表人应当签署授权书，明确本单位项目负责人。 （是项目负责人 不是单位负责人）
     建筑工程五方责任主体项目负责人质量终身责任，是指参与新建、 扩建、改建的建筑工程项目负责人按照国家法律法规和有关规定， 在工程设计使用年限内对工程质量承担相应责任。
     工程质量终身责任实行书面承诺和竣工后永久性标牌等制度。
 
 */
#pragma mark 对施工质量负责和总分包单位的质量责任
/*
    一、施工单位对施工质量负责
         施工单位应当建立质量责任制，确定工程项目的项目经理、技术负责人和施工管理负责人
         建设工程质量责任与施工质量责任的主体不同
         施工单位是建设工程质量的重要责任主体，但不是唯一的责任主体
 二、总分包单位的质量责任
         建筑工程实行总承包的，工程质量由工程总承包单位负责。
         《建设工程质量管理条例》规定，总承包单位依法将建设工程分包给其他单位的，分包单位应当按照分包合同的约定对其分包工程的质量向总承包单位负责，总承包单位与分包单位对分包工程的质量承担连带责任。
         分包单位应当接受总承包单位的质量管理，就其分包工程，按分包合同的约定，向总承包单位负责。
         对外连带，对内追偿。
 
 */
#pragma mark 按照工程设计图纸和施工技术标准施工的规定
/*
 
     施工单位必须按照工程设计图纸和施工技术标准施工 ，发现有差错，及时提出意见;
     工程设计修改由原设计单位负责，施工单位不得擅自修改。
     施工单位必须按照工程设计要求、施工技术标准和合同约定，对建筑材料、建筑构配件、设备和商品混凝土进行检验，检验应当有书面记录和专人签字;未经检验或检验不合格的，不得使用。
     如果施工单位没有按照工程设计图纸和施工技术标准施工，则属于违约行为，应该对建设单位承担违约责任。
 
 */
#pragma mark 对建筑材料、设备等进行检验检测的规定
/*
 
     建筑施工企业必须按照【工程设计要求、施工技术标准和合同的约定】， 对建筑材料、建筑构配件、设备和商品混凝土进行检验，不合格的不得使用。
     涉及结构安全的试块、试件及有关材料，应在建设单位或监理单位监督下取样，并送相应检测机构检验
 
     见证取样和送检，是指在建设单位或工程监理单位人员的见证下， 由施工单位的现场试验人员对工程中【涉及结构安全】的试块、试件和材料在现场取样，并送至具有法定资格的质量检测单位进行检测的活动。
     见证取样和送检的比例不得低于应取样数量的【30%】

     必须【实施见证取样和送检】:
         用于承重结构的混凝土试块;
         用于承重墙体的砌筑砂浆试块;
         用于承重结构的钢筋及连接接头试件;
         用于承重墙的砖和混凝土小型砌块;
         用于拌制混凝土和砌筑砂浆的水泥;
         用于承重结构的混凝土中使用的掺加剂;
         地下、屋面、厕浴间使用的防水材料;
         国家规定其它试块、试件和材料。

     见证人员应由建设单位或监理单位中具备施工试验知识的专业技术人员担任，并由建设单位或监理单位书面通知施工单位、 检测单位和负责该工程的质量监督机构。
 
     (5)【取样人员】应在试样或其包装上作出标识、封志。标识和 封志应标明【工程名称、取样部位、取样日期、样品名称和样品数量】，并由【见证人员和取样人员】签字。
 
 (二)工程质量检测机构的资质和检测规定
     (1)工程质量检测机构是具有独立法人资格的中介机构。
     (2)检测机构资质分为专项检测机构资质和见证取样检测机构资质。
         检测机构未取得相应的资质证书，不得承担本办法规定的质量检测业务。
     (3)检测报告经检测人员签字、检测机构法定代表人或者其授权的签字人签署，并加盖检测机构公章或者检测专用章后方可生效。
         检测报告经建设单位或者工程监理单位确认后，由施工单位归档。
         质量检测业务由工程项目建设单位委托具有相应资质的检测机构进行检测。
 
         如果检测结果利害关系人对检测结果发生争议的，由双方共同认可的检测机构复检，复检结果由提出复检方报当地建设主管部门备案。

     (4)检测机构应当将检测过程中发现的建设单位、监理单位、施工单位违反有关法律、法规和工程建设强制性标准的情况，以及涉及结构安全检测结果的不合格情况，及时报告工程所在地建设主管部门。检测机构应当建立档案管理制度，并应当单独建立检测结果不合格项目台账。
     (5)检测人员不得同时受聘于两个或者两个以上的检测机构。检测机构和 检测人员不得推荐或者监制建筑材料、构配件和设备。检测机构不得与行政 机关，法律、法规授权的具有管理公共事务职能的组织以及所检测工程项目相关的设计单位、施工单位、监理单位有隶属关系或者其他利害关系。
     (6)检测机构不得转包检测业务。
 */
#pragma mark ***** 建设单位及相关单位的质量责任和义务
/*
 
 责任主体                                                           质量责任
 建设单位
            (1)建设单位应当将施工图设计文件报县级以上人民政府建设行政主管部门或者其他有关部门审查;
            (2)建设单位在领取施工许可证或者开工报告前，应当按照国家有关规定办理工程质量监督手续;
            (3)涉及建筑主体和承重结构变动的装修工程，建设单位应当在施工前委托原设计单位或者具有相应资质条件的设计单位提出设计方案;没有设计方案的，不得施工。
 设计单位
            (1)设计单位在设计文件中选用的建筑材料、建筑构配件和设备， 应当注明规格、型号、性能等技术指标，其质量要求必须符合国家规定的标准;
            (2)除有特殊要求的建筑材料、专用设备、工艺生产线等外，设计单位不得指定生产厂、供应商。
 监理单位
            (1)工程监理单位与被监理工程的施工承包单位以及建筑材料、建 筑构配件和设备供应单位不得有隶属关系或者其他利害关系的，不得承担该项建设工程的监理业务;
            (2)未经监理工程师签字，建筑 材料、建筑构配件和设备不得在工程上使用或者安装，施工单位不得进行下一道工序的施工;
            (3)未经总监理工程师签字，建设单位不拨付工程款，不进行竣工验收。
 */
#pragma mark ***** 建设工程竣工验收制度
/*
 竣工验收主体
     建设单位收到建设工程竣工报告后，应组织设计、施工、监理等单位进行竣工验收
 
 建设工程竣工验收应具备条件 （不包括竣工相关的文件）
        完成建设工程设计和合同约定的各项内容
        有完整的技术档案和施工管理资料
        有工程使用的主要建筑材料、建筑构配件和设备的进场试验报告【不包括建筑装饰辅助材料】
        有勘察、设计、施工、工程监理等单位分别签署的质量合格文件
        有施工单位签署的工程保修书
 
 
 二、竣工工程质量争议的处理
         《质量条例》规定，施工单位对施工中出现质量问题的建设工程或者竣工验收不合格的建设工程，应当负责返修。
         据此，建设工程竣工时发现的质量问题或者质量缺陷，无论是建设单位的责任还是施工单位的责任，施工单位都有义务进行修复或返修。
         但是，对于非施工单位原因出现的质量问题或质量缺陷，其返修的费用和造成的损失是应由责任方承担的。
 (1)承包方责任的处理
         《解释》规定，因承包人的过错造成建设工程质量不符合约定，承包人拒绝修理、返工或者改建，发包人请求减少支付工程价款的，应予支持。
 (2)发包方责任的处理
         《解释》规定，发包人具有下列情形之一，造成建设工程质量缺陷，应当承担过错责任:
         1)提供的设计有缺陷;
         2)提供或者指定购买的建筑材料、建筑构配件、设备不符合强制性标准;
         3)直接指定分包人分包专业工程。
 (3)未经竣工验收擅自使用的处理
        《建筑法》规定，建设工程竣工经验收合格后，方可交付使用。
        《解释》规定，建设工程未经竣工验收，发包人擅自使用后，又以使用部分质量不符合约定为由主张权利的，不予支持;
        但是承包人应当在建设工程的合理使用寿命内对地基基础工程和主体结构质量承担民事责任
 
 */
#pragma mark ***** 建设工程质量保修制度
/*
     建设工程质量保修制度，是指建设工程竣工经验收后，在规定的保修期限内，因勘察、设计、施工、材料等原因造成的质量缺陷，应当由【施工承包单位】负责维修、返工或更换，由【责任单位】负责赔偿损失的法律制度。
     建设工程承包单位在向建设单位提交工程竣工验收报告时，应当向建设单位出具质量保修书。
     质量保修书中应明确保修范围、保修期限、保修责任等。
     因建设单位或者用户使用不当或擅自改动结构、设备位置以及不当装修等造成质量问题的，施工单位不承担保修责任;由此而造成的质量受损或者其他用户损失，应当由责任人承担相应的责任。
 
 【在规定的保修期限内，因勘察、设计、施工、材料等原因造成的质量缺陷】
 【使用不当或擅自改动结构、设备位置以及不当装修等造成质量问题的】
 
 
 最低保修期限：（竣工验收合格之日起）（这里是最低保修期  大于这个年限都是符合要求的）
         基础设施、房屋建筑地基基础和主体结构工程   —— 合理使用年限
         屋面防水、有防水要求的卫生间、房间和外墙面的防渗漏  ——  5年
         供热和供冷系统    ——  2个采暖期、供冷期
         电气管线、给排水管道、设备安装和装修 ——  2年
 
 因建设单位或用户使用不当或擅自改动结构、设备位置、第三方、不可抗力等，施工单位不保修
 超出合理使用年限后如需继续使用，产权所有人应委托具有资质的勘察、设计单位鉴定，并根据鉴定结果加固、维修等，重新界定使用期。违法使用，后果产权人自负
 
 
 《质量条例》规定，建设工程在保修范围和保修期限内发生质量问题的，施工单位应当履行保修义务，并对造成的损失承担赔偿责任。
 因保修人未及时履行保修义务，导致建筑物损毁或者造成人身、财产损害的，保修人应当承担赔偿责任。
 保修人与建筑物所有人或者发包人对建筑物毁损均有过错的，各自承担相应的责任。
 
 质量损失赔偿责任的承担
         施工单位过错，施工单位返修并赔偿
         设计问题，先由施工单位维修，再通过建设单位向设计单位追偿
         材料问题，先由施工单位维修，谁采购谁承担责任
         建设单位问题，先由施工单位维修，责任建设单位承担;监理单位问题，建设单位向监理单位索赔
         使用不当问题，先由施工单位维修，使用单位负责
         自然灾害损坏，先由施工单位维修，各方根据国家政策分担
 
总结:谁过错谁承担，先由施工单位维修为原则
 */
#pragma mark - ************** 民事诉讼制度
#pragma mark 【本章基本框架】
/*
 
 
 民事纠纷 (民~民)
     私了
        和解
        调解
     公了
        仲裁或诉讼
        (适用诉讼时效)
 行政纠纷 （民~官）
     公了
         60天内 行政复议 （15天内 行政诉讼）
         6个月内 行政诉讼
 */
#pragma mark 民事纠纷解决途径
/*
 民事纠纷解决途径
     和解:可以在民事纠纷任何阶段
     调解:人民、行政、仲裁、司法、行业调解
     仲裁:仅限于合同纠纷和其他财产纠纷
     诉讼:公权性、程序性、强制性
 
                    民事诉讼                           民事仲裁
 
 发动             无须约定(强制性)                   须有书面仲裁协议(自愿性)
 
 管辖            法定(合同纠纷除外)                  约定1个仲裁委员会
             法院之间有隶属关系:基层、            仲裁委员会不隶属于行政机关，
                中级、高级和最高                    互相之间也无隶属关系
 
 程序             严格依法律规定                 根据《仲裁规则》，当事人协议
 审理             一般应公开                       一般不公开(保密)
 终局             二审终审                            一裁终局
 组织属性       法院——司法机关                    仲裁委员会——民间团体
 范围          任何纠纷均可诉讼                  《仲裁法》仅限于民商事仲裁
 
 执行        一审法院或与一审法院同级的            被执行人(或财产)所在地中级法院
            被执行财产所在地法院
 
 
 翻案         再审——法院                          不予执行和撤销——法院
 
 */
#pragma mark 地域管辖
/*
 地域管辖
     一般地域:原告就被告
         公民:
             由被告住所地法院管辖;住所地与经常居住地不一致，由经常居住地法院管辖(连续居住满1年地方)
         法人:
             住所地指主要办事机构所在地，主要办事机构所在地不能确定的，法人或者其他组织的注册地或者登记地为住所地
 
         同一诉讼几个被告的，可以向任何一个被告住所地或经常居住地人民法院起诉
 
     特殊地域管辖
         因合同纠纷提起的诉讼，由被告住所地或者合同履行地人民法院管辖——法定管辖
         当事人可以在合同中协议选择由被告住所地、合同履行地、合同签订地、原告住所地、标的物所在地的人民法院管辖 ——协议管辖
     专属地域管辖:
         排除法定管辖和协议管辖
         不动产纠纷在不动产所在地法院管辖，如房屋买卖纠纷、土地
         使用权转让纠纷、建设工程施工合同纠纷——专属管辖
 
 专属管辖 协议管辖 法定管辖
 
 */
#pragma mark 民事诉讼当事人和代理人的规定
/*
 当事人 (自己名义参加诉讼)
     原告
     被告
     共同诉讼人(原告或被告为两人以上)
     第三人(独立诉求或利害关系)
 
 诉讼代理人
     法定/指定代理:
         未成年人或精神病人
     委托代理人
         一般授权
         特别授权:有权承认、放弃、变更诉求;和解;上诉、反诉
         全权代理为一般授权
 */
 #pragma mark 证据的种类
/*
 
 书证                     以文字、符号证明案件事实    合同文本、信函、电报、传真、图纸  （法律条文、行业规范不是书证）
 
 物证                     用物品的外形、特征、质量等证明:建材、设备、工程质量
 
 视听资料                 偷录的谈话记录可以作证，但侵犯隐私或窃听不行
 
 证人证言                 单位证人、 自然人证人     能正确表达意志
 
 当事人陈述               原告、被告、共同诉讼人、第三人(只有本人陈述，无其他证据，主张不予支持，对方认可除外)
 
 鉴定意见                工程质量、技术、造价、伤残、笔迹鉴定
 
 勘验笔录                应由勘验人、当事人和被邀请参加人签名或盖章
 
 电子数据                电子邮件、电子聊天记录、电子数据交换、电子资金划拨、电子公告牌记录、电子签名、移动电话记录、短信
 
 */
#pragma mark 证据应用
/*
 认证
     不能作为证据情况
         调解中认可的事实
         违法取得的证据(侵犯隐私、窃听)
         当事人只有本人陈述的主张(对方认可的除外)
     不能单独作为认定事实的证据
         未成年人作出与其年龄和智力不相当的证言
         与一方有利害关系的证人出具的证言
         存在疑点的视听资料
         无法与原件、原物核对的复印件
         无正当理由未出庭作证的证人证言
 
 */
#pragma mark 民事诉讼时效的规定
/*
 
 胜诉权消灭(可以起诉，法院应受理)
 实体权不消灭(自愿履行，法律保护)
 
 
 诉讼时效期间的种类
        普通诉讼时效期间(2年) （新的诉讼法规定为3年）
        最长诉讼时效期间(20年)
        特别诉讼时效期间
            1年:
                 身体受伤害;
                 出售质量不合格商品未声明;
                 拒付延付租金;
                 寄存财物丢失损毁。
            3年:
                 污染环境损害赔偿;
                 船舶发生油污损害
                 海上货物运输请求权1年
            4年:
                 国际货物买卖合同、技术进出口合同争议
 
 诉讼时效的中止
         在诉讼时效期间的最后6个月，因不可抗力或其它障碍不能行使请求权的， 诉讼时效中止，中止原因消除，时效继续计算。
 诉讼时效的中断
         从中断时起，诉讼时效重新计算。
        诉讼时效中断事由：
            提起诉讼;
            债权人提出要求;
            债务人同意履行义务
 
 
 */
#pragma mark 民事诉讼的审判程序
/*
 
 一审程序（普通和简易审理）
 
    起诉和受理
            起诉条件
                 有直接利害关系;
                 明确被告;
                 具体诉求、事实和理由;
                 属于民诉范围和法院管辖
            受理:7日
     审理前准备工作
            提交答辩状:被告15日内
            组成合议庭:3人或5人
     开庭审理
            法庭调查:出示与案件有关的全部证据
            法庭辩论:针对有争议的事实和法律问题
            法庭笔录:审判员和书记员签名，且当庭宣读
            宣判:必须告知当事人上诉权利、期限和法院
 
 
 二审程序
 
    上诉期间:判决书送达之日起15内;裁定书10日
    上诉状:应通过原审法院递交上诉状
    对上诉案件的裁判
         维持原判:事实清楚，法律正确
         改判、撤销或变更:事实或法律错误
         发回重审或改判:认定事实不清
         发回重审:遗漏当事人或违法缺席判决（不能改判）
 
 审判监督程序:再审程序
 
 
 */
#pragma mark - ************** 仲裁制度
/*
 
 仲裁
 
 适用范围
    仅限于民商事仲裁:   仅限于合同纠纷和其他财产纠纷
    不适用仲裁法的纠纷
        婚姻、收养、监护、扶养、继承、劳动纠纷
        依法应当由行政机关处理的行政争议
 仲裁的基本特点
 
     自愿性:仲裁协议
     专业性:专家仲裁
     独立性:无隶属关系
     保密性:依不公开审理为原则
     快捷性:一裁终局
     强制性和广泛性:法院强制且缔约国承认和执行
 
 协议仲裁制度:没有协议，仲裁委不受理
 或裁或审制度:两个都选，协议无效，由法院管辖
 一裁终局制度:不绝对
 
 
 仲裁协议的内容 (应当书面)
     请求仲裁的意思表示
     仲裁事项
     选定的仲裁委员会
 内容不全，协议补充;否则协议无效，由法院管辖
 仲裁协议的约定方式：1、在合同中以仲裁条款的形式约定 2、事后协议
 
 
 仲裁裁决自作出之日起发生法律效力
     当事人不得就已经裁决的事项再行申请仲裁，也不得就此提起诉讼。
     仲裁裁决具有执行力
 仲裁调解书自双方签收时生效
 
 裁决应当按照多数仲裁员的意见作出，少数仲裁员的不同意见可以记入笔录。仲裁庭不能形成多数意见时，裁决应当按照首席仲裁员的意见作出
 
 仲裁协议效力的确认
     有异议，在首次开庭前提出;
     仲裁协议独立存在，合同无效不影响
     一方请仲裁委，另一方请法院，法院裁定(仲裁机构所在地中院)
 */
#pragma mark - ************** 行政复议和行政诉讼制度
/*
 行政许可
 行政处罚
 行政强制
 行政复议
 行政诉讼
 
 
 复议前置，复议终局
 
有的必须先行政复议后行政诉讼
有的可行政复议可行政诉讼
有的只能行政复议
 
 
 
 行政强制执行
     (1)行政强制执行的方式:
         1加处罚款或者滞纳金;
         2划拨存款、汇款;
         3拍卖或者依法处理查封、扣押的场所、设施或者财物;
         4排除妨碍、恢复原状;
         5代履行;
         6其他强制执行方式。
 
     行政强制的程序
         没有行政强制执行权的行政机关可以自期限届满之日起3个月内申请人民法院强制执行。
         强制执行的费用由被执行人承担。
     行政强制措施的设定
         不得在夜间或者法定节假日实施强制，紧急情况除外
         不得对居民采用停止供水、供电、供热、供燃气等方式迫使当事人履行
         对违法建筑物拆除，应先公告，限期自行拆除。法定期限不复议或诉讼，又不拆除，可强制拆除
 
 */
 #pragma mark 行政复议的范围、受理和复议决定
/*
 
 可以申请行政复议(具体行政行为)
 
     (1)行政处罚:罚款、拘留、吊照、撤销、没收
     (2)行政强制:查封、扣押、冻结、拍卖、划拨
     (3)行政许可:施工许可、安全许可、营业执照
     (4)行政侵权:人身权、财产权
     (5)行政不作为:不发执照、证书、抚恤金
     (6)其他具体侵犯其合法权益行为
 对拘役（刑罚）不服的 不能提起行政复议
 
 
 不得申请行政复议
     (1)行政处分、行政奖励或其他人事处理
     (2)行政机关调解或者行政指导
     (3)行政法规、文件(法、条例、规定、办法、细则)
     (4)政府国防、外交行为
 
 注意:与行政诉讼范围大体相同
 
 行政复议申请
     申请期限:知道之日60天
     可自己，可委托;可书面，可口头
     复议机关:
         对县以上政府工作部门的具体行政行为不服的，可以向该部门的本级人民政府，也可以向上一级主管部门
     复议不诉讼，诉讼不复议
 
 行政复议受理
     具体行政行为不停止执行
     停止执行
        被申请人认为需要停止;
        复议机关认为需要停止;
        申请人申请停止，复议机关认为合理
 
 行政复议决定
     (1) 事实、证据、依据正确，内容适当的，决定维持;
     (2)被申请人不履行法定职责的，决定其在一定期限内履行
     (3)决定撤销、变更或者确认该具体行政行为违法;
     (4)被申请人不按法律规定提出书面答复、提交当初作出具体行政行为的证据、依据和其他有关材料的，视为该具体行政行为没有证据、依据，决定撤销该具体行政行为。
 
 */
#pragma mark 行政诉讼制度
/*
 
 第一审程序
     管辖:最初做出地法院，复议改变两被告，人身自由原被告，最先立案不动产
     起诉:具体行政行为之日6个月或复议决定15日
     审理:不适用调解，行政赔偿、补偿、自由裁量权例外
 
 判决
     驳回原告诉讼请求
     撤销判决，并可判决重新作出行政行为
     履行判决:不作为行为
     变更判决:行政处罚显失公平或及对款额认定有错误
 
 第二审程序
     上诉期限:判决15日或裁定10日
     上诉判决:维持原判;依法改判;发回重审或改判
 
 再审程序:向上一级人民法院
 执 行:公民、法人拒绝履行判决、裁定的，行政机关可以向 第一审人民法院申请强制执行，或者依法强制执行。
 国家赔偿:行使职权，人身权和财产权;个人行为和自己行为国家不赔
 
 
 对于不接收起诉状、接收起诉状后不出具书面凭证，以及不一次性告知 当事人需要补正的起诉状内容的，当事人可以向上级人民法院投诉
 人民法院既不立案，又不作出不予立案裁定的，当事人可以向上一级人民法院起诉
 行政行为所依据的国务院部门和地方人民政府及其部门制定的规范性文 件(不含规章)不合法，提起诉讼时，可以一并请求对该规范性文件进行审查
 
 行政案件的审理程序
         (1)行政争议未经行政复议的，应当自知道作出具体行政行为之日起6个月内起诉
         (2)经过行政复议但对行政复议决定不服而依法提起行政诉讼的， 应当在收到行政复议决定书之日起15日内起诉
         (3)法院审理行政案件不适用调解，但行政赔偿诉讼可以调解
         (4)行政诉讼期间，除该法规定的情形外，不停止具体行政行为的 执行。
             除涉及国家秘密、个人隐私和法律另有规定的外，人民法院应当公开审理行政案件。
             涉及商业秘密的案件，当事人申请不公开审理的， 可以不公开审理。
             人民法院审理行政案件，不适用调解。但是，行政赔偿、补偿以及行政机关行使法律、法规规定的自由裁量权的案件可以调 解。
         (5)人民法院审理行政案件，以【法律和行政法规、地方性法规】为依据。
             审理民族自治地方的行政案件，并以该民族自治地方的自治条例和 单行条例为依据。人民法院审理行政案件，参照规章。
 
 
 行政诉讼与民事诉讼比较
         (1)在行政诉讼中，被告对其作出的具体行政行为负有举证责任(民事诉讼"谁主张，谁举证”)
         (2)在行政诉讼过程中，被告不得自行向原告和证人收集证据
         (3)行政诉讼上诉审不受上诉范围限制，应进行全面审查(民事诉讼只审查上诉请求的范围)
         (4)必须组成合议庭(民事诉讼简易程序独任审理)
         (5)不能调解(行政赔偿诉讼可以调解，民事诉讼都可以调解)
 
     侵权的赔偿责任
     行使行政职权时侵权的赔偿责任
     赔偿诉讼可以适用调解。
     行政机关及其工作人员在行使行政职权时侵犯人身权和财产权的行为，受害人有取得赔偿的权利。
 属于下列情形之一的，国家不承担赔偿责任:
         1行政机关工作人员与行使职权无关的个人行为;
         2因公民、法人和其他组织自己的行为致使损害发生的;
         3法律规定的其他情形。
 */














