
#pragma mark - 考试时间
/*
 一级建造师 考试时间 2018年09月15、16日
 
 经济     100/60      单选 60*1     2小时
                      多选 20*2
 
 法规     130/78      单选 70*1     3小时
                      多选 30*2
 
 项目管理     130/78      单选 70*1     3小时
                        多选 30*2

 实务     160/96      单选 20*1     4小时
                     多选 10*2
                     案例 3*20+2*30
 
 
 
 选择题应该
 1.把真题做完 并分析  （保底分数到手 确定考试范围）
 2.看书
 
 分值分布不固定 各章节分值都有可能多
 
 分值分布：
 1.六、七章 2.二、三章 3.四、五章 4.一、八章
 
 建设工程基本法律制度     28
 施工许可法律制度           10
 建设工程发承包法律制度        13
 建设工程合同和劳动合同        16
 环保、节能和文物保护          10
 建设工程安全生产制度         20
 建设工程质量管理制度         20
 建设工程纠纷处理            16
 
 */

